jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
/*
 * Copyright 2016 The Chromium OS Authors. All rights reserved.
 * Use of this source code is governed by a BSD-style license that can be
 * found in the LICENSE file.
 */

#ifndef __EC_CHIP_STM32_DWC_REG_DEFS_H
#define __EC_CHIP_STM32_DWC_REG_DEFS_H


#define GC_USB_FS_BASE_ADDR                        0x50000000
#define GC_USB_HS_BASE_ADDR                        0x40040000
#ifdef CONFIG_DWC_USB_FS
#define GC_USB_BASE_ADDR                         GC_USB_FS_BASE_ADDR
#else
#define GC_USB_BASE_ADDR                         GC_USB_HS_BASE_ADDR
#endif

#define GC_USB_GOTGCTL_OFFSET                    0x0
#define GC_USB_GOTGCTL_DEFAULT                   0x0
#define GC_USB_GOTGINT_OFFSET                    0x4
#define GC_USB_GOTGINT_DEFAULT                   0x0
#define GC_USB_GAHBCFG_OFFSET                    0x8
#define GC_USB_GAHBCFG_DEFAULT                   0x0
#define GC_USB_GUSBCFG_OFFSET                    0xc
#define GC_USB_GUSBCFG_DEFAULT                   0x0
#define GC_USB_GRSTCTL_OFFSET                    0x10
#define GC_USB_GRSTCTL_DEFAULT                   0x0
#define GC_USB_GINTSTS_OFFSET                    0x14
#define GC_USB_GINTSTS_DEFAULT                   0x0
#define GC_USB_GINTMSK_OFFSET                    0x18
#define GC_USB_GINTMSK_DEFAULT                   0x0
#define GC_USB_GRXSTSR_OFFSET                    0x1c
#define GC_USB_GRXSTSR_DEFAULT                   0x0
#define GC_USB_GRXSTSP_OFFSET                    0x20
#define GC_USB_GRXSTSP_DEFAULT                   0x0
#define GC_USB_GRXFSIZ_OFFSET                    0x24
#define GC_USB_GRXFSIZ_DEFAULT                   0x0
#define GC_USB_GNPTXFSIZ_OFFSET                  0x28
#define GC_USB_GNPTXFSIZ_DEFAULT                 0x0

#define GC_USB_GCCFG_OFFSET                      0x38
#define GC_USB_GCCFG_DEFAULT                     0x0
/*#define GC_USB_GGPIO_OFFSET                      0x38
#define GC_USB_GGPIO_DEFAULT                     0x0*/
#define GC_USB_GUID_OFFSET                       0x3c
#define GC_USB_GUID_DEFAULT                      0x0
#define GC_USB_GSNPSID_OFFSET                    0x40
#define GC_USB_GSNPSID_DEFAULT                   0x0
#define GC_USB_GHWCFG1_OFFSET                    0x44
#define GC_USB_GHWCFG1_DEFAULT                   0x0
#define GC_USB_GHWCFG2_OFFSET                    0x48
#define GC_USB_GHWCFG2_DEFAULT                   0x0
#define GC_USB_GHWCFG3_OFFSET                    0x4c
#define GC_USB_GHWCFG3_DEFAULT                   0x0
#define GC_USB_GHWCFG4_OFFSET                    0x50
#define GC_USB_GHWCFG4_DEFAULT                   0x0
#define GC_USB_GDFIFOCFG_OFFSET                  0x5c
#define GC_USB_GDFIFOCFG_DEFAULT                 0x0
#define GC_USB_DIEPTXF1_OFFSET                   0x104
#define GC_USB_DIEPTXF1_DEFAULT                  0x1000
#define GC_USB_DIEPTXF2_OFFSET                   0x108
#define GC_USB_DIEPTXF2_DEFAULT                  0x0
#define GC_USB_DIEPTXF3_OFFSET                   0x10c
#define GC_USB_DIEPTXF3_DEFAULT                  0x0
#define GC_USB_DIEPTXF4_OFFSET                   0x110
#define GC_USB_DIEPTXF4_DEFAULT                  0x0
#define GC_USB_DIEPTXF5_OFFSET                   0x114
#define GC_USB_DIEPTXF5_DEFAULT                  0x0
#define GC_USB_DIEPTXF6_OFFSET                   0x118
#define GC_USB_DIEPTXF6_DEFAULT                  0x0
#define GC_USB_DIEPTXF7_OFFSET                   0x11c
#define GC_USB_DIEPTXF7_DEFAULT                  0x0
#define GC_USB_DIEPTXF8_OFFSET                   0x120
#define GC_USB_DIEPTXF8_DEFAULT                  0x0
#define GC_USB_DIEPTXF9_OFFSET                   0x124
#define GC_USB_DIEPTXF9_DEFAULT                  0x0
#define GC_USB_DIEPTXF10_OFFSET                  0x128
#define GC_USB_DIEPTXF10_DEFAULT                 0x0
#define GC_USB_DIEPTXF11_OFFSET                  0x12c
#define GC_USB_DIEPTXF11_DEFAULT                 0x0
#define GC_USB_DIEPTXF12_OFFSET                  0x130
#define GC_USB_DIEPTXF12_DEFAULT                 0x0
#define GC_USB_DIEPTXF13_OFFSET                  0x134
#define GC_USB_DIEPTXF13_DEFAULT                 0x0
#define GC_USB_DIEPTXF14_OFFSET                  0x138
#define GC_USB_DIEPTXF14_DEFAULT                 0x0
#define GC_USB_DIEPTXF15_OFFSET                  0x13c
#define GC_USB_DIEPTXF15_DEFAULT                 0x0
#define GC_USB_DCFG_OFFSET                       0x800
#define GC_USB_DCFG_DEFAULT                      0x8000000
#define GC_USB_DCTL_OFFSET                       0x804
#define GC_USB_DCTL_DEFAULT                      0x0
#define GC_USB_DSTS_OFFSET                       0x808
#define GC_USB_DSTS_DEFAULT                      0x0
#define GC_USB_DIEPMSK_OFFSET                    0x810
#define GC_USB_DIEPMSK_DEFAULT                   0x80
#define GC_USB_DOEPMSK_OFFSET                    0x814
#define GC_USB_DOEPMSK_DEFAULT                   0x0
#define GC_USB_DAINT_OFFSET                      0x818
#define GC_USB_DAINT_DEFAULT                     0x0
#define GC_USB_DAINTMSK_OFFSET                   0x81c
#define GC_USB_DAINTMSK_DEFAULT                  0x0
#define GC_USB_DVBUSDIS_OFFSET                   0x828
#define GC_USB_DVBUSDIS_DEFAULT                  0x0
#define GC_USB_DVBUSPULSE_OFFSET                 0x82c
#define GC_USB_DVBUSPULSE_DEFAULT                0x0
#define GC_USB_DTHRCTL_OFFSET                    0x830
#define GC_USB_DTHRCTL_DEFAULT                   0x0
#define GC_USB_DIEPEMPMSK_OFFSET                 0x834
#define GC_USB_DIEPEMPMSK_DEFAULT                0x0
#define GC_USB_DIEPCTL0_OFFSET                   0x900
#define GC_USB_DIEPCTL0_DEFAULT                  0x0
#define GC_USB_DIEPINT0_OFFSET                   0x908
#define GC_USB_DIEPINT0_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ0_OFFSET                  0x910
#define GC_USB_DIEPTSIZ0_DEFAULT                 0x0
#define GC_USB_DIEPDMA0_OFFSET                   0x914
#define GC_USB_DIEPDMA0_DEFAULT                  0x0
#define GC_USB_DTXFSTS0_OFFSET                   0x918
#define GC_USB_DTXFSTS0_DEFAULT                  0x0
#define GC_USB_DIEPDMAB0_OFFSET                  0x91c
#define GC_USB_DIEPDMAB0_DEFAULT                 0x0
#define GC_USB_DIEPCTL1_OFFSET                   0x920
#define GC_USB_DIEPCTL1_DEFAULT                  0x0
#define GC_USB_DIEPINT1_OFFSET                   0x928
#define GC_USB_DIEPINT1_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ1_OFFSET                  0x930
#define GC_USB_DIEPTSIZ1_DEFAULT                 0x0
#define GC_USB_DIEPDMA1_OFFSET                   0x934
#define GC_USB_DIEPDMA1_DEFAULT                  0x0
#define GC_USB_DTXFSTS1_OFFSET                   0x938
#define GC_USB_DTXFSTS1_DEFAULT                  0x0
#define GC_USB_DIEPDMAB1_OFFSET                  0x93c
#define GC_USB_DIEPDMAB1_DEFAULT                 0x0
#define GC_USB_DIEPCTL2_OFFSET                   0x940
#define GC_USB_DIEPCTL2_DEFAULT                  0x0
#define GC_USB_DIEPINT2_OFFSET                   0x948
#define GC_USB_DIEPINT2_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ2_OFFSET                  0x950
#define GC_USB_DIEPTSIZ2_DEFAULT                 0x0
#define GC_USB_DIEPDMA2_OFFSET                   0x954
#define GC_USB_DIEPDMA2_DEFAULT                  0x0
#define GC_USB_DTXFSTS2_OFFSET                   0x958
#define GC_USB_DTXFSTS2_DEFAULT                  0x0
#define GC_USB_DIEPDMAB2_OFFSET                  0x95c
#define GC_USB_DIEPDMAB2_DEFAULT                 0x0
#define GC_USB_DIEPCTL3_OFFSET                   0x960
#define GC_USB_DIEPCTL3_DEFAULT                  0x0
#define GC_USB_DIEPINT3_OFFSET                   0x968
#define GC_USB_DIEPINT3_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ3_OFFSET                  0x970
#define GC_USB_DIEPTSIZ3_DEFAULT                 0x0
#define GC_USB_DIEPDMA3_OFFSET                   0x974
#define GC_USB_DIEPDMA3_DEFAULT                  0x0
#define GC_USB_DTXFSTS3_OFFSET                   0x978
#define GC_USB_DTXFSTS3_DEFAULT                  0x0
#define GC_USB_DIEPDMAB3_OFFSET                  0x97c
#define GC_USB_DIEPDMAB3_DEFAULT                 0x0
#define GC_USB_DIEPCTL4_OFFSET                   0x980
#define GC_USB_DIEPCTL4_DEFAULT                  0x0
#define GC_USB_DIEPINT4_OFFSET                   0x988
#define GC_USB_DIEPINT4_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ4_OFFSET                  0x990
#define GC_USB_DIEPTSIZ4_DEFAULT                 0x0
#define GC_USB_DIEPDMA4_OFFSET                   0x994
#define GC_USB_DIEPDMA4_DEFAULT                  0x0
#define GC_USB_DTXFSTS4_OFFSET                   0x998
#define GC_USB_DTXFSTS4_DEFAULT                  0x0
#define GC_USB_DIEPDMAB4_OFFSET                  0x99c
#define GC_USB_DIEPDMAB4_DEFAULT                 0x0
#define GC_USB_DIEPCTL5_OFFSET                   0x9a0
#define GC_USB_DIEPCTL5_DEFAULT                  0x0
#define GC_USB_DIEPINT5_OFFSET                   0x9a8
#define GC_USB_DIEPINT5_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ5_OFFSET                  0x9b0
#define GC_USB_DIEPTSIZ5_DEFAULT                 0x0
#define GC_USB_DIEPDMA5_OFFSET                   0x9b4
#define GC_USB_DIEPDMA5_DEFAULT                  0x0
#define GC_USB_DTXFSTS5_OFFSET                   0x9b8
#define GC_USB_DTXFSTS5_DEFAULT                  0x0
#define GC_USB_DIEPDMAB5_OFFSET                  0x9bc
#define GC_USB_DIEPDMAB5_DEFAULT                 0x0
#define GC_USB_DIEPCTL6_OFFSET                   0x9c0
#define GC_USB_DIEPCTL6_DEFAULT                  0x0
#define GC_USB_DIEPINT6_OFFSET                   0x9c8
#define GC_USB_DIEPINT6_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ6_OFFSET                  0x9d0
#define GC_USB_DIEPTSIZ6_DEFAULT                 0x0
#define GC_USB_DIEPDMA6_OFFSET                   0x9d4
#define GC_USB_DIEPDMA6_DEFAULT                  0x0
#define GC_USB_DTXFSTS6_OFFSET                   0x9d8
#define GC_USB_DTXFSTS6_DEFAULT                  0x0
#define GC_USB_DIEPDMAB6_OFFSET                  0x9dc
#define GC_USB_DIEPDMAB6_DEFAULT                 0x0
#define GC_USB_DIEPCTL7_OFFSET                   0x9e0
#define GC_USB_DIEPCTL7_DEFAULT                  0x0
#define GC_USB_DIEPINT7_OFFSET                   0x9e8
#define GC_USB_DIEPINT7_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ7_OFFSET                  0x9f0
#define GC_USB_DIEPTSIZ7_DEFAULT                 0x0
#define GC_USB_DIEPDMA7_OFFSET                   0x9f4
#define GC_USB_DIEPDMA7_DEFAULT                  0x0
#define GC_USB_DTXFSTS7_OFFSET                   0x9f8
#define GC_USB_DTXFSTS7_DEFAULT                  0x0
#define GC_USB_DIEPDMAB7_OFFSET                  0x9fc
#define GC_USB_DIEPDMAB7_DEFAULT                 0x0
#define GC_USB_DIEPCTL8_OFFSET                   0xa00
#define GC_USB_DIEPCTL8_DEFAULT                  0x0
#define GC_USB_DIEPINT8_OFFSET                   0xa08
#define GC_USB_DIEPINT8_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ8_OFFSET                  0xa10
#define GC_USB_DIEPTSIZ8_DEFAULT                 0x0
#define GC_USB_DIEPDMA8_OFFSET                   0xa14
#define GC_USB_DIEPDMA8_DEFAULT                  0x0
#define GC_USB_DTXFSTS8_OFFSET                   0xa18
#define GC_USB_DTXFSTS8_DEFAULT                  0x0
#define GC_USB_DIEPDMAB8_OFFSET                  0xa1c
#define GC_USB_DIEPDMAB8_DEFAULT                 0x0
#define GC_USB_DIEPCTL9_OFFSET                   0xa20
#define GC_USB_DIEPCTL9_DEFAULT                  0x0
#define GC_USB_DIEPINT9_OFFSET                   0xa28
#define GC_USB_DIEPINT9_DEFAULT                  0x0
#define GC_USB_DIEPTSIZ9_OFFSET                  0xa30
#define GC_USB_DIEPTSIZ9_DEFAULT                 0x0
#define GC_USB_DIEPDMA9_OFFSET                   0xa34
#define GC_USB_DIEPDMA9_DEFAULT                  0x0
#define GC_USB_DTXFSTS9_OFFSET                   0xa38
#define GC_USB_DTXFSTS9_DEFAULT                  0x0
#define GC_USB_DIEPDMAB9_OFFSET                  0xa3c
#define GC_USB_DIEPDMAB9_DEFAULT                 0x0
#define GC_USB_DIEPCTL10_OFFSET                  0xa40
#define GC_USB_DIEPCTL10_DEFAULT                 0x0
#define GC_USB_DIEPINT10_OFFSET                  0xa48
#define GC_USB_DIEPINT10_DEFAULT                 0x0
#define GC_USB_DIEPTSIZ10_OFFSET                 0xa50
#define GC_USB_DIEPTSIZ10_DEFAULT                0x0
#define GC_USB_DIEPDMA10_OFFSET                  0xa54
#define GC_USB_DIEPDMA10_DEFAULT                 0x0
#define GC_USB_DTXFSTS10_OFFSET                  0xa58
#define GC_USB_DTXFSTS10_DEFAULT                 0x0
#define GC_USB_DIEPDMAB10_OFFSET                 0xa5c
#define GC_USB_DIEPDMAB10_DEFAULT                0x0
#define GC_USB_DIEPCTL11_OFFSET                  0xa60
#define GC_USB_DIEPCTL11_DEFAULT                 0x0
#define GC_USB_DIEPINT11_OFFSET                  0xa68
#define GC_USB_DIEPINT11_DEFAULT                 0x0
#define GC_USB_DIEPTSIZ11_OFFSET                 0xa70
#define GC_USB_DIEPTSIZ11_DEFAULT                0x0
#define GC_USB_DIEPDMA11_OFFSET                  0xa74
#define GC_USB_DIEPDMA11_DEFAULT                 0x0
#define GC_USB_DTXFSTS11_OFFSET                  0xa78
#define GC_USB_DTXFSTS11_DEFAULT                 0x0
#define GC_USB_DIEPDMAB11_OFFSET                 0xa7c
#define GC_USB_DIEPDMAB11_DEFAULT                0x0
#define GC_USB_DIEPCTL12_OFFSET                  0xa80
#define GC_USB_DIEPCTL12_DEFAULT                 0x0
#define GC_USB_DIEPINT12_OFFSET                  0xa88
#define GC_USB_DIEPINT12_DEFAULT                 0x0
#define GC_USB_DIEPTSIZ12_OFFSET                 0xa90
#define GC_USB_DIEPTSIZ12_DEFAULT                0x0
#define GC_USB_DIEPDMA12_OFFSET                  0xa94
#define GC_USB_DIEPDMA12_DEFAULT                 0x0
#define GC_USB_DTXFSTS12_OFFSET                  0xa98
#define GC_USB_DTXFSTS12_DEFAULT                 0x0
#define GC_USB_DIEPDMAB12_OFFSET                 0xa9c
#define GC_USB_DIEPDMAB12_DEFAULT                0x0
#define GC_USB_DIEPCTL13_OFFSET                  0xaa0
#define GC_USB_DIEPCTL13_DEFAULT                 0x0
#define GC_USB_DIEPINT13_OFFSET                  0xaa8
#define GC_USB_DIEPINT13_DEFAULT                 0x0
#define GC_USB_DIEPTSIZ13_OFFSET                 0xab0
#define GC_USB_DIEPTSIZ13_DEFAULT                0x0
#define GC_USB_DIEPDMA13_OFFSET                  0xab4
#define GC_USB_DIEPDMA13_DEFAULT                 0x0
#define GC_USB_DTXFSTS13_OFFSET                  0xab8
#define GC_USB_DTXFSTS13_DEFAULT                 0x0
#define GC_USB_DIEPDMAB13_OFFSET                 0xabc
#define GC_USB_DIEPDMAB13_DEFAULT                0x0
#define GC_USB_DIEPCTL14_OFFSET                  0xac0
#define GC_USB_DIEPCTL14_DEFAULT                 0x0
#define GC_USB_DIEPINT14_OFFSET                  0xac8
#define GC_USB_DIEPINT14_DEFAULT                 0x0
#define GC_USB_DIEPTSIZ14_OFFSET                 0xad0
#define GC_USB_DIEPTSIZ14_DEFAULT                0x0
#define GC_USB_DIEPDMA14_OFFSET                  0xad4
#define GC_USB_DIEPDMA14_DEFAULT                 0x0
#define GC_USB_DTXFSTS14_OFFSET                  0xad8
#define GC_USB_DTXFSTS14_DEFAULT                 0x0
#define GC_USB_DIEPDMAB14_OFFSET                 0xadc
#define GC_USB_DIEPDMAB14_DEFAULT                0x0
#define GC_USB_DIEPCTL15_OFFSET                  0xae0
#define GC_USB_DIEPCTL15_DEFAULT                 0x0
#define GC_USB_DIEPINT15_OFFSET                  0xae8
#define GC_USB_DIEPINT15_DEFAULT                 0x0
#define GC_USB_DIEPTSIZ15_OFFSET                 0xaf0
#define GC_USB_DIEPTSIZ15_DEFAULT                0x0
#define GC_USB_DIEPDMA15_OFFSET                  0xaf4
#define GC_USB_DIEPDMA15_DEFAULT                 0x0
#define GC_USB_DTXFSTS15_OFFSET                  0xaf8
#define GC_USB_DTXFSTS15_DEFAULT                 0x0
#define GC_USB_DIEPDMAB15_OFFSET                 0xafc
#define GC_USB_DIEPDMAB15_DEFAULT                0x0
#define GC_USB_DOEPCTL0_OFFSET                   0xb00
#define GC_USB_DOEPCTL0_DEFAULT                  0x0
#define GC_USB_DOEPINT0_OFFSET                   0xb08
#define GC_USB_DOEPINT0_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ0_OFFSET                  0xb10
#define GC_USB_DOEPTSIZ0_DEFAULT                 0x0
#define GC_USB_DOEPDMA0_OFFSET                   0xb14
#define GC_USB_DOEPDMA0_DEFAULT                  0x0
#define GC_USB_DOEPDMAB0_OFFSET                  0xb1c
#define GC_USB_DOEPDMAB0_DEFAULT                 0x0
#define GC_USB_DOEPCTL1_OFFSET                   0xb20
#define GC_USB_DOEPCTL1_DEFAULT                  0x0
#define GC_USB_DOEPINT1_OFFSET                   0xb28
#define GC_USB_DOEPINT1_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ1_OFFSET                  0xb30
#define GC_USB_DOEPTSIZ1_DEFAULT                 0x0
#define GC_USB_DOEPDMA1_OFFSET                   0xb34
#define GC_USB_DOEPDMA1_DEFAULT                  0x0
#define GC_USB_DOEPDMAB1_OFFSET                  0xb3c
#define GC_USB_DOEPDMAB1_DEFAULT                 0x0
#define GC_USB_DOEPCTL2_OFFSET                   0xb40
#define GC_USB_DOEPCTL2_DEFAULT                  0x0
#define GC_USB_DOEPINT2_OFFSET                   0xb48
#define GC_USB_DOEPINT2_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ2_OFFSET                  0xb50
#define GC_USB_DOEPTSIZ2_DEFAULT                 0x0
#define GC_USB_DOEPDMA2_OFFSET                   0xb54
#define GC_USB_DOEPDMA2_DEFAULT                  0x0
#define GC_USB_DOEPDMAB2_OFFSET                  0xb5c
#define GC_USB_DOEPDMAB2_DEFAULT                 0x0
#define GC_USB_DOEPCTL3_OFFSET                   0xb60
#define GC_USB_DOEPCTL3_DEFAULT                  0x0
#define GC_USB_DOEPINT3_OFFSET                   0xb68
#define GC_USB_DOEPINT3_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ3_OFFSET                  0xb70
#define GC_USB_DOEPTSIZ3_DEFAULT                 0x0
#define GC_USB_DOEPDMA3_OFFSET                   0xb74
#define GC_USB_DOEPDMA3_DEFAULT                  0x0
#define GC_USB_DOEPDMAB3_OFFSET                  0xb7c
#define GC_USB_DOEPDMAB3_DEFAULT                 0x0
#define GC_USB_DOEPCTL4_OFFSET                   0xb80
#define GC_USB_DOEPCTL4_DEFAULT                  0x0
#define GC_USB_DOEPINT4_OFFSET                   0xb88
#define GC_USB_DOEPINT4_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ4_OFFSET                  0xb90
#define GC_USB_DOEPTSIZ4_DEFAULT                 0x0
#define GC_USB_DOEPDMA4_OFFSET                   0xb94
#define GC_USB_DOEPDMA4_DEFAULT                  0x0
#define GC_USB_DOEPDMAB4_OFFSET                  0xb9c
#define GC_USB_DOEPDMAB4_DEFAULT                 0x0
#define GC_USB_DOEPCTL5_OFFSET                   0xba0
#define GC_USB_DOEPCTL5_DEFAULT                  0x0
#define GC_USB_DOEPINT5_OFFSET                   0xba8
#define GC_USB_DOEPINT5_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ5_OFFSET                  0xbb0
#define GC_USB_DOEPTSIZ5_DEFAULT                 0x0
#define GC_USB_DOEPDMA5_OFFSET                   0xbb4
#define GC_USB_DOEPDMA5_DEFAULT                  0x0
#define GC_USB_DOEPDMAB5_OFFSET                  0xbbc
#define GC_USB_DOEPDMAB5_DEFAULT                 0x0
#define GC_USB_DOEPCTL6_OFFSET                   0xbc0
#define GC_USB_DOEPCTL6_DEFAULT                  0x0
#define GC_USB_DOEPINT6_OFFSET                   0xbc8
#define GC_USB_DOEPINT6_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ6_OFFSET                  0xbd0
#define GC_USB_DOEPTSIZ6_DEFAULT                 0x0
#define GC_USB_DOEPDMA6_OFFSET                   0xbd4
#define GC_USB_DOEPDMA6_DEFAULT                  0x0
#define GC_USB_DOEPDMAB6_OFFSET                  0xbdc
#define GC_USB_DOEPDMAB6_DEFAULT                 0x0
#define GC_USB_DOEPCTL7_OFFSET                   0xbe0
#define GC_USB_DOEPCTL7_DEFAULT                  0x0
#define GC_USB_DOEPINT7_OFFSET                   0xbe8
#define GC_USB_DOEPINT7_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ7_OFFSET                  0xbf0
#define GC_USB_DOEPTSIZ7_DEFAULT                 0x0
#define GC_USB_DOEPDMA7_OFFSET                   0xbf4
#define GC_USB_DOEPDMA7_DEFAULT                  0x0
#define GC_USB_DOEPDMAB7_OFFSET                  0xbfc
#define GC_USB_DOEPDMAB7_DEFAULT                 0x0
#define GC_USB_DOEPCTL8_OFFSET                   0xc00
#define GC_USB_DOEPCTL8_DEFAULT                  0x0
#define GC_USB_DOEPINT8_OFFSET                   0xc08
#define GC_USB_DOEPINT8_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ8_OFFSET                  0xc10
#define GC_USB_DOEPTSIZ8_DEFAULT                 0x0
#define GC_USB_DOEPDMA8_OFFSET                   0xc14
#define GC_USB_DOEPDMA8_DEFAULT                  0x0
#define GC_USB_DOEPDMAB8_OFFSET                  0xc1c
#define GC_USB_DOEPDMAB8_DEFAULT                 0x0
#define GC_USB_DOEPCTL9_OFFSET                   0xc20
#define GC_USB_DOEPCTL9_DEFAULT                  0x0
#define GC_USB_DOEPINT9_OFFSET                   0xc28
#define GC_USB_DOEPINT9_DEFAULT                  0x0
#define GC_USB_DOEPTSIZ9_OFFSET                  0xc30
#define GC_USB_DOEPTSIZ9_DEFAULT                 0x0
#define GC_USB_DOEPDMA9_OFFSET                   0xc34
#define GC_USB_DOEPDMA9_DEFAULT                  0x0
#define GC_USB_DOEPDMAB9_OFFSET                  0xc3c
#define GC_USB_DOEPDMAB9_DEFAULT                 0x0
#define GC_USB_DOEPCTL10_OFFSET                  0xc40
#define GC_USB_DOEPCTL10_DEFAULT                 0x0
#define GC_USB_DOEPINT10_OFFSET                  0xc48
#define GC_USB_DOEPINT10_DEFAULT                 0x0
#define GC_USB_DOEPTSIZ10_OFFSET                 0xc50
#define GC_USB_DOEPTSIZ10_DEFAULT                0x0
#define GC_USB_DOEPDMA10_OFFSET                  0xc54
#define GC_USB_DOEPDMA10_DEFAULT                 0x0
#define GC_USB_DOEPDMAB10_OFFSET                 0xc5c
#define GC_USB_DOEPDMAB10_DEFAULT                0x0
#define GC_USB_DOEPCTL11_OFFSET                  0xc60
#define GC_USB_DOEPCTL11_DEFAULT                 0x0
#define GC_USB_DOEPINT11_OFFSET                  0xc68
#define GC_USB_DOEPINT11_DEFAULT                 0x0
#define GC_USB_DOEPTSIZ11_OFFSET                 0xc70
#define GC_USB_DOEPTSIZ11_DEFAULT                0x0
#define GC_USB_DOEPDMA11_OFFSET                  0xc74
#define GC_USB_DOEPDMA11_DEFAULT                 0x0
#define GC_USB_DOEPDMAB11_OFFSET                 0xc7c
#define GC_USB_DOEPDMAB11_DEFAULT                0x0
#define GC_USB_DOEPCTL12_OFFSET                  0xc80
#define GC_USB_DOEPCTL12_DEFAULT                 0x0
#define GC_USB_DOEPINT12_OFFSET                  0xc88
#define GC_USB_DOEPINT12_DEFAULT                 0x0
#define GC_USB_DOEPTSIZ12_OFFSET                 0xc90
#define GC_USB_DOEPTSIZ12_DEFAULT                0x0
#define GC_USB_DOEPDMA12_OFFSET                  0xc94
#define GC_USB_DOEPDMA12_DEFAULT                 0x0
#define GC_USB_DOEPDMAB12_OFFSET                 0xc9c
#define GC_USB_DOEPDMAB12_DEFAULT                0x0
#define GC_USB_DOEPCTL13_OFFSET                  0xca0
#define GC_USB_DOEPCTL13_DEFAULT                 0x0
#define GC_USB_DOEPINT13_OFFSET                  0xca8
#define GC_USB_DOEPINT13_DEFAULT                 0x0
#define GC_USB_DOEPTSIZ13_OFFSET                 0xcb0
#define GC_USB_DOEPTSIZ13_DEFAULT                0x0
#define GC_USB_DOEPDMA13_OFFSET                  0xcb4
#define GC_USB_DOEPDMA13_DEFAULT                 0x0
#define GC_USB_DOEPDMAB13_OFFSET                 0xcbc
#define GC_USB_DOEPDMAB13_DEFAULT                0x0
#define GC_USB_DOEPCTL14_OFFSET                  0xcc0
#define GC_USB_DOEPCTL14_DEFAULT                 0x0
#define GC_USB_DOEPINT14_OFFSET                  0xcc8
#define GC_USB_DOEPINT14_DEFAULT                 0x0
#define GC_USB_DOEPTSIZ14_OFFSET                 0xcd0
#define GC_USB_DOEPTSIZ14_DEFAULT                0x0
#define GC_USB_DOEPDMA14_OFFSET                  0xcd4
#define GC_USB_DOEPDMA14_DEFAULT                 0x0
#define GC_USB_DOEPDMAB14_OFFSET                 0xcdc
#define GC_USB_DOEPDMAB14_DEFAULT                0x0
