jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
#define GC_USB_DOEPCTL15_OFFSET                  0xce0
#define GC_USB_DOEPCTL15_DEFAULT                 0x0
#define GC_USB_DOEPINT15_OFFSET                  0xce8
#define GC_USB_DOEPINT15_DEFAULT                 0x0
#define GC_USB_DOEPTSIZ15_OFFSET                 0xcf0
#define GC_USB_DOEPTSIZ15_DEFAULT                0x0
#define GC_USB_DOEPDMA15_OFFSET                  0xcf4
#define GC_USB_DOEPDMA15_DEFAULT                 0x0
#define GC_USB_DOEPDMAB15_OFFSET                 0xcfc
#define GC_USB_DOEPDMAB15_DEFAULT                0x0
#define GC_USB_PCGCCTL_OFFSET                    0xe00
#define GC_USB_PCGCCTL_DEFAULT                   0x0
#define GC_USB_DFIFO_OFFSET                      0x20000
#define GC_USB_GOTGCTL_BVALIDOVEN_LSB            0x6
#define GC_USB_GOTGCTL_BVALIDOVEN_MASK           0x40
#define GC_USB_GOTGCTL_BVALIDOVEN_SIZE           0x1
#define GC_USB_GOTGCTL_BVALIDOVEN_DEFAULT        0x0
#define GC_USB_GOTGCTL_BVALIDOVEN_OFFSET         0x0
#define GC_USB_GOTGCTL_BVALIDOVVAL_LSB           0x7
#define GC_USB_GOTGCTL_BVALIDOVVAL_MASK          0x80
#define GC_USB_GOTGCTL_BVALIDOVVAL_SIZE          0x1
#define GC_USB_GOTGCTL_BVALIDOVVAL_DEFAULT       0x0
#define GC_USB_GOTGCTL_BVALIDOVVAL_OFFSET        0x0
#define GC_USB_GOTGCTL_CONIDSTS_LSB              0x10
#define GC_USB_GOTGCTL_CONIDSTS_MASK             0x10000
#define GC_USB_GOTGCTL_CONIDSTS_SIZE             0x1
#define GC_USB_GOTGCTL_CONIDSTS_DEFAULT          0x0
#define GC_USB_GOTGCTL_CONIDSTS_OFFSET           0x0
#define GC_USB_GOTGCTL_BSESVLD_LSB               0x13
#define GC_USB_GOTGCTL_BSESVLD_MASK              0x80000
#define GC_USB_GOTGCTL_BSESVLD_SIZE              0x1
#define GC_USB_GOTGCTL_BSESVLD_DEFAULT           0x0
#define GC_USB_GOTGCTL_BSESVLD_OFFSET            0x0
#define GC_USB_GOTGCTL_OTGVER_LSB                0x14
#define GC_USB_GOTGCTL_OTGVER_MASK               0x100000
#define GC_USB_GOTGCTL_OTGVER_SIZE               0x1
#define GC_USB_GOTGCTL_OTGVER_DEFAULT            0x0
#define GC_USB_GOTGCTL_OTGVER_OFFSET             0x0
#define GC_USB_GOTGCTL_CURMOD_LSB                0x15
#define GC_USB_GOTGCTL_CURMOD_MASK               0x200000
#define GC_USB_GOTGCTL_CURMOD_SIZE               0x1
#define GC_USB_GOTGCTL_CURMOD_DEFAULT            0x0
#define GC_USB_GOTGCTL_CURMOD_OFFSET             0x0
#define GC_USB_GOTGINT_SESENDDET_LSB             0x2
#define GC_USB_GOTGINT_SESENDDET_MASK            0x4
#define GC_USB_GOTGINT_SESENDDET_SIZE            0x1
#define GC_USB_GOTGINT_SESENDDET_DEFAULT         0x0
#define GC_USB_GOTGINT_SESENDDET_OFFSET          0x4
#define GC_USB_GOTGINT_SESREQSUCSTSCHNG_LSB      0x8
#define GC_USB_GOTGINT_SESREQSUCSTSCHNG_MASK     0x100
#define GC_USB_GOTGINT_SESREQSUCSTSCHNG_SIZE     0x1
#define GC_USB_GOTGINT_SESREQSUCSTSCHNG_DEFAULT  0x0
#define GC_USB_GOTGINT_SESREQSUCSTSCHNG_OFFSET   0x4
#define GC_USB_GOTGINT_HSTNEGSUCSTSCHNG_LSB      0x9
#define GC_USB_GOTGINT_HSTNEGSUCSTSCHNG_MASK     0x200
#define GC_USB_GOTGINT_HSTNEGSUCSTSCHNG_SIZE     0x1
#define GC_USB_GOTGINT_HSTNEGSUCSTSCHNG_DEFAULT  0x0
#define GC_USB_GOTGINT_HSTNEGSUCSTSCHNG_OFFSET   0x4
#define GC_USB_GOTGINT_HSTNEGDET_LSB             0x11
#define GC_USB_GOTGINT_HSTNEGDET_MASK            0x20000
#define GC_USB_GOTGINT_HSTNEGDET_SIZE            0x1
#define GC_USB_GOTGINT_HSTNEGDET_DEFAULT         0x0
#define GC_USB_GOTGINT_HSTNEGDET_OFFSET          0x4
#define GC_USB_GOTGINT_ADEVTOUTCHG_LSB           0x12
#define GC_USB_GOTGINT_ADEVTOUTCHG_MASK          0x40000
#define GC_USB_GOTGINT_ADEVTOUTCHG_SIZE          0x1
#define GC_USB_GOTGINT_ADEVTOUTCHG_DEFAULT       0x0
#define GC_USB_GOTGINT_ADEVTOUTCHG_OFFSET        0x4
#define GC_USB_GAHBCFG_GLBLINTRMSK_LSB           0x0
#define GC_USB_GAHBCFG_GLBLINTRMSK_MASK          0x1
#define GC_USB_GAHBCFG_GLBLINTRMSK_SIZE          0x1
#define GC_USB_GAHBCFG_GLBLINTRMSK_DEFAULT       0x0
#define GC_USB_GAHBCFG_GLBLINTRMSK_OFFSET        0x8
#define GC_USB_GAHBCFG_HBSTLEN_LSB               0x1
#define GC_USB_GAHBCFG_HBSTLEN_MASK              0x1e
#define GC_USB_GAHBCFG_HBSTLEN_SIZE              0x4
#define GC_USB_GAHBCFG_HBSTLEN_DEFAULT           0x0
#define GC_USB_GAHBCFG_HBSTLEN_OFFSET            0x8
#define GC_USB_GAHBCFG_DMAEN_LSB                 0x5
#define GC_USB_GAHBCFG_DMAEN_MASK                0x20
#define GC_USB_GAHBCFG_DMAEN_SIZE                0x1
#define GC_USB_GAHBCFG_DMAEN_DEFAULT             0x0
#define GC_USB_GAHBCFG_DMAEN_OFFSET              0x8

#define GC_USB_GAHBCFG_NPTXFEMPLVL_LSB           0x7
#define GC_USB_GAHBCFG_NPTXFEMPLVL_MASK          0x80
#define GC_USB_GAHBCFG_NPTXFEMPLVL_SIZE          0x1
#define GC_USB_GAHBCFG_NPTXFEMPLVL_DEFAULT       0x0
#define GC_USB_GAHBCFG_NPTXFEMPLVL_OFFSET        0x8

#define GC_USB_GAHBCFG_REMMEMSUPP_LSB            0x15
#define GC_USB_GAHBCFG_REMMEMSUPP_MASK           0x200000
#define GC_USB_GAHBCFG_REMMEMSUPP_SIZE           0x1
#define GC_USB_GAHBCFG_REMMEMSUPP_DEFAULT        0x0
#define GC_USB_GAHBCFG_REMMEMSUPP_OFFSET         0x8
#define GC_USB_GAHBCFG_NOTIALLDMAWRIT_LSB        0x16
#define GC_USB_GAHBCFG_NOTIALLDMAWRIT_MASK       0x400000
#define GC_USB_GAHBCFG_NOTIALLDMAWRIT_SIZE       0x1
#define GC_USB_GAHBCFG_NOTIALLDMAWRIT_DEFAULT    0x0
#define GC_USB_GAHBCFG_NOTIALLDMAWRIT_OFFSET     0x8
#define GC_USB_GAHBCFG_AHBSINGLE_LSB             0x17
#define GC_USB_GAHBCFG_AHBSINGLE_MASK            0x800000
#define GC_USB_GAHBCFG_AHBSINGLE_SIZE            0x1
#define GC_USB_GAHBCFG_AHBSINGLE_DEFAULT         0x0
#define GC_USB_GAHBCFG_AHBSINGLE_OFFSET          0x8
#define GC_USB_GAHBCFG_INVDESCENDIANESS_LSB      0x18
#define GC_USB_GAHBCFG_INVDESCENDIANESS_MASK     0x1000000
#define GC_USB_GAHBCFG_INVDESCENDIANESS_SIZE     0x1
#define GC_USB_GAHBCFG_INVDESCENDIANESS_DEFAULT  0x0
#define GC_USB_GAHBCFG_INVDESCENDIANESS_OFFSET   0x8
#define GC_USB_GUSBCFG_TOUTCAL_LSB               0x0
#define GC_USB_GUSBCFG_TOUTCAL_MASK              0x7
#define GC_USB_GUSBCFG_TOUTCAL_SIZE              0x3
#define GC_USB_GUSBCFG_TOUTCAL_DEFAULT           0x0
#define GC_USB_GUSBCFG_TOUTCAL_OFFSET            0xc 
/*#define GC_USB_GUSBCFG_PHYSEL_LSB                0x6
#define GC_USB_GUSBCFG_PHYSEL_MASK               0x40
#define GC_USB_GUSBCFG_PHYSEL_SIZE               0x1
#define GC_USB_GUSBCFG_PHYSEL_DEFAULT            0x0
#define GC_USB_GUSBCFG_PHYSEL_OFFSET             0xc*/

#define GC_USB_GUSBCFG_USBTRDTIM_LSB             0xa
#define GC_USB_GUSBCFG_USBTRDTIM_MASK            0x3c00
#define GC_USB_GUSBCFG_USBTRDTIM_SIZE            0x4
#define GC_USB_GUSBCFG_USBTRDTIM_DEFAULT         0x0
#define GC_USB_GUSBCFG_USBTRDTIM_OFFSET          0xc
#define GC_USB_GUSBCFG_PHYLPWRCLKSEL_LSB         15
#define GC_USB_GUSBCFG_PHYLPWRCLKSEL_MASK        0x8000
#define GC_USB_GUSBCFG_PHYLPWRCLKSEL_SIZE        0x1
#define GC_USB_GUSBCFG_PHYLPWRCLKSEL_DEFAULT     0x0
#define GC_USB_GUSBCFG_PHYLPWRCLKSEL_OFFSET      0xc
#define GC_USB_GUSBCFG_ULPIFSLS_LSB              17
#define GC_USB_GUSBCFG_ULPIFSLS_MASK             0x20000
#define GC_USB_GUSBCFG_ULPIFSLS_SIZE             0x1
#define GC_USB_GUSBCFG_ULPIFSLS_DEFAULT          0x0
#define GC_USB_GUSBCFG_ULPIFSLS_OFFSET           0xc
#define GC_USB_GUSBCFG_ULPIAUTORES_LSB           18
#define GC_USB_GUSBCFG_ULPIAUTORES_MASK          0x40000
#define GC_USB_GUSBCFG_ULPIAUTORES_SIZE          0x1
#define GC_USB_GUSBCFG_ULPIAUTORES_DEFAULT       0x0
#define GC_USB_GUSBCFG_ULPIAUTORES_OFFSET        0xc
#define GC_USB_GUSBCFG_ULPICLKSUSM_LSB           19 
#define GC_USB_GUSBCFG_ULPICLKSUSM_MASK          0x80000
#define GC_USB_GUSBCFG_ULPICLKSUSM_SIZE          0x1
#define GC_USB_GUSBCFG_ULPICLKSUSM_DEFAULT       0x0
#define GC_USB_GUSBCFG_ULPICLKSUSM_OFFSET        0xc

#define GC_USB_GUSBCFG_ULPIEVBUSD_LSB            20
#define GC_USB_GUSBCFG_ULPIEVBUSD_MASK           0x100000
#define GC_USB_GUSBCFG_ULPIEVBUSD_SIZE           0x1
#define GC_USB_GUSBCFG_ULPIEVBUSD_DEFAULT        0x0
#define GC_USB_GUSBCFG_ULPIEVBUSD_OFFSET         0xc

#define GC_USB_GUSBCFG_ULPIEVBUSI_LSB            21
#define GC_USB_GUSBCFG_ULPIEVBUSI_MASK           0x200000
#define GC_USB_GUSBCFG_ULPIEVBUSI_SIZE           0x1
#define GC_USB_GUSBCFG_ULPIEVBUSI_DEFAULT        0x0
#define GC_USB_GUSBCFG_ULPIEVBUSI_OFFSET         0xc

