jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
#define GC_USB_GUID_GUID_LSB                     0x0
#define GC_USB_GUID_GUID_MASK                    0xffffffff
#define GC_USB_GUID_GUID_SIZE                    0x20
#define GC_USB_GUID_GUID_DEFAULT                 0x0
#define GC_USB_GUID_GUID_OFFSET                  0x3c
#define GC_USB_GSNPSID_SYNOPSYSID_LSB            0x0
#define GC_USB_GSNPSID_SYNOPSYSID_MASK           0xffffffff
#define GC_USB_GSNPSID_SYNOPSYSID_SIZE           0x20
#define GC_USB_GSNPSID_SYNOPSYSID_DEFAULT        0x0
#define GC_USB_GSNPSID_SYNOPSYSID_OFFSET         0x40
#define GC_USB_GHWCFG1_EPDIR_LSB                 0x0
#define GC_USB_GHWCFG1_EPDIR_MASK                0xffffffff
#define GC_USB_GHWCFG1_EPDIR_SIZE                0x20
#define GC_USB_GHWCFG1_EPDIR_DEFAULT             0x0
#define GC_USB_GHWCFG1_EPDIR_OFFSET              0x44
#define GC_USB_GHWCFG2_OTGMODE_LSB               0x0
#define GC_USB_GHWCFG2_OTGMODE_MASK              0x7
#define GC_USB_GHWCFG2_OTGMODE_SIZE              0x3
#define GC_USB_GHWCFG2_OTGMODE_DEFAULT           0x0
#define GC_USB_GHWCFG2_OTGMODE_OFFSET            0x48
#define GC_USB_GHWCFG2_OTGARCH_LSB               0x3
#define GC_USB_GHWCFG2_OTGARCH_MASK              0x18
#define GC_USB_GHWCFG2_OTGARCH_SIZE              0x2
#define GC_USB_GHWCFG2_OTGARCH_DEFAULT           0x0
#define GC_USB_GHWCFG2_OTGARCH_OFFSET            0x48
#define GC_USB_GHWCFG2_SINGPNT_LSB               0x5
#define GC_USB_GHWCFG2_SINGPNT_MASK              0x20
#define GC_USB_GHWCFG2_SINGPNT_SIZE              0x1
#define GC_USB_GHWCFG2_SINGPNT_DEFAULT           0x0
#define GC_USB_GHWCFG2_SINGPNT_OFFSET            0x48
#define GC_USB_GHWCFG2_HSPHYTYPE_LSB             0x6
#define GC_USB_GHWCFG2_HSPHYTYPE_MASK            0xc0
#define GC_USB_GHWCFG2_HSPHYTYPE_SIZE            0x2
#define GC_USB_GHWCFG2_HSPHYTYPE_DEFAULT         0x0
#define GC_USB_GHWCFG2_HSPHYTYPE_OFFSET          0x48
#define GC_USB_GHWCFG2_FSPHYTYPE_LSB             0x8
#define GC_USB_GHWCFG2_FSPHYTYPE_MASK            0x300
#define GC_USB_GHWCFG2_FSPHYTYPE_SIZE            0x2
#define GC_USB_GHWCFG2_FSPHYTYPE_DEFAULT         0x0
#define GC_USB_GHWCFG2_FSPHYTYPE_OFFSET          0x48
#define GC_USB_GHWCFG2_NUMDEVEPS_LSB             0xa
#define GC_USB_GHWCFG2_NUMDEVEPS_MASK            0x3c00
#define GC_USB_GHWCFG2_NUMDEVEPS_SIZE            0x4
#define GC_USB_GHWCFG2_NUMDEVEPS_DEFAULT         0x0
#define GC_USB_GHWCFG2_NUMDEVEPS_OFFSET          0x48
#define GC_USB_GHWCFG2_NUMHSTCHNL_LSB            0xe
#define GC_USB_GHWCFG2_NUMHSTCHNL_MASK           0x3c000
#define GC_USB_GHWCFG2_NUMHSTCHNL_SIZE           0x4
#define GC_USB_GHWCFG2_NUMHSTCHNL_DEFAULT        0x0
#define GC_USB_GHWCFG2_NUMHSTCHNL_OFFSET         0x48
#define GC_USB_GHWCFG2_PERIOSUPPORT_LSB          0x12
#define GC_USB_GHWCFG2_PERIOSUPPORT_MASK         0x40000
#define GC_USB_GHWCFG2_PERIOSUPPORT_SIZE         0x1
#define GC_USB_GHWCFG2_PERIOSUPPORT_DEFAULT      0x0
#define GC_USB_GHWCFG2_PERIOSUPPORT_OFFSET       0x48
#define GC_USB_GHWCFG2_DYNFIFOSIZING_LSB         0x13
#define GC_USB_GHWCFG2_DYNFIFOSIZING_MASK        0x80000
#define GC_USB_GHWCFG2_DYNFIFOSIZING_SIZE        0x1
#define GC_USB_GHWCFG2_DYNFIFOSIZING_DEFAULT     0x0
#define GC_USB_GHWCFG2_DYNFIFOSIZING_OFFSET      0x48
#define GC_USB_GHWCFG2_MULTIPROCINTRPT_LSB       0x14
#define GC_USB_GHWCFG2_MULTIPROCINTRPT_MASK      0x100000
#define GC_USB_GHWCFG2_MULTIPROCINTRPT_SIZE      0x1
#define GC_USB_GHWCFG2_MULTIPROCINTRPT_DEFAULT   0x0
#define GC_USB_GHWCFG2_MULTIPROCINTRPT_OFFSET    0x48
#define GC_USB_GHWCFG2_NPTXQDEPTH_LSB            0x16
#define GC_USB_GHWCFG2_NPTXQDEPTH_MASK           0xc00000
#define GC_USB_GHWCFG2_NPTXQDEPTH_SIZE           0x2
#define GC_USB_GHWCFG2_NPTXQDEPTH_DEFAULT        0x0
#define GC_USB_GHWCFG2_NPTXQDEPTH_OFFSET         0x48
#define GC_USB_GHWCFG2_PTXQDEPTH_LSB             0x18
#define GC_USB_GHWCFG2_PTXQDEPTH_MASK            0x3000000
#define GC_USB_GHWCFG2_PTXQDEPTH_SIZE            0x2
#define GC_USB_GHWCFG2_PTXQDEPTH_DEFAULT         0x0
#define GC_USB_GHWCFG2_PTXQDEPTH_OFFSET          0x48
#define GC_USB_GHWCFG2_TKNQDEPTH_LSB             0x1a
#define GC_USB_GHWCFG2_TKNQDEPTH_MASK            0x7c000000
#define GC_USB_GHWCFG2_TKNQDEPTH_SIZE            0x5
#define GC_USB_GHWCFG2_TKNQDEPTH_DEFAULT         0x0
#define GC_USB_GHWCFG2_TKNQDEPTH_OFFSET          0x48
#define GC_USB_GHWCFG3_XFERSIZEWIDTH_LSB         0x0
#define GC_USB_GHWCFG3_XFERSIZEWIDTH_MASK        0xf
#define GC_USB_GHWCFG3_XFERSIZEWIDTH_SIZE        0x4
#define GC_USB_GHWCFG3_XFERSIZEWIDTH_DEFAULT     0x0
#define GC_USB_GHWCFG3_XFERSIZEWIDTH_OFFSET      0x4c
#define GC_USB_GHWCFG3_PKTSIZEWIDTH_LSB          0x4
#define GC_USB_GHWCFG3_PKTSIZEWIDTH_MASK         0x70
#define GC_USB_GHWCFG3_PKTSIZEWIDTH_SIZE         0x3
#define GC_USB_GHWCFG3_PKTSIZEWIDTH_DEFAULT      0x0
#define GC_USB_GHWCFG3_PKTSIZEWIDTH_OFFSET       0x4c
#define GC_USB_GHWCFG3_OTGEN_LSB                 0x7
#define GC_USB_GHWCFG3_OTGEN_MASK                0x80
#define GC_USB_GHWCFG3_OTGEN_SIZE                0x1
#define GC_USB_GHWCFG3_OTGEN_DEFAULT             0x0
#define GC_USB_GHWCFG3_OTGEN_OFFSET              0x4c
#define GC_USB_GHWCFG3_I2CINTSEL_LSB             0x8
#define GC_USB_GHWCFG3_I2CINTSEL_MASK            0x100
#define GC_USB_GHWCFG3_I2CINTSEL_SIZE            0x1
#define GC_USB_GHWCFG3_I2CINTSEL_DEFAULT         0x0
#define GC_USB_GHWCFG3_I2CINTSEL_OFFSET          0x4c
#define GC_USB_GHWCFG3_VNDCTLSUPT_LSB            0x9
#define GC_USB_GHWCFG3_VNDCTLSUPT_MASK           0x200
#define GC_USB_GHWCFG3_VNDCTLSUPT_SIZE           0x1
#define GC_USB_GHWCFG3_VNDCTLSUPT_DEFAULT        0x0
#define GC_USB_GHWCFG3_VNDCTLSUPT_OFFSET         0x4c
#define GC_USB_GHWCFG3_OPTFEATURE_LSB            0xa
#define GC_USB_GHWCFG3_OPTFEATURE_MASK           0x400
#define GC_USB_GHWCFG3_OPTFEATURE_SIZE           0x1
#define GC_USB_GHWCFG3_OPTFEATURE_DEFAULT        0x0
#define GC_USB_GHWCFG3_OPTFEATURE_OFFSET         0x4c
#define GC_USB_GHWCFG3_RSTTYPE_LSB               0xb
#define GC_USB_GHWCFG3_RSTTYPE_MASK              0x800
#define GC_USB_GHWCFG3_RSTTYPE_SIZE              0x1
#define GC_USB_GHWCFG3_RSTTYPE_DEFAULT           0x0
#define GC_USB_GHWCFG3_RSTTYPE_OFFSET            0x4c
#define GC_USB_GHWCFG3_ADPSUPPORT_LSB            0xc
#define GC_USB_GHWCFG3_ADPSUPPORT_MASK           0x1000
#define GC_USB_GHWCFG3_ADPSUPPORT_SIZE           0x1
#define GC_USB_GHWCFG3_ADPSUPPORT_DEFAULT        0x0
#define GC_USB_GHWCFG3_ADPSUPPORT_OFFSET         0x4c
#define GC_USB_GHWCFG3_HSICMODE_LSB              0xd
#define GC_USB_GHWCFG3_HSICMODE_MASK             0x2000
#define GC_USB_GHWCFG3_HSICMODE_SIZE             0x1
#define GC_USB_GHWCFG3_HSICMODE_DEFAULT          0x0
#define GC_USB_GHWCFG3_HSICMODE_OFFSET           0x4c
#define GC_USB_GHWCFG3_BCSUPPORT_LSB             0xe
#define GC_USB_GHWCFG3_BCSUPPORT_MASK            0x4000
#define GC_USB_GHWCFG3_BCSUPPORT_SIZE            0x1
#define GC_USB_GHWCFG3_BCSUPPORT_DEFAULT         0x0
#define GC_USB_GHWCFG3_BCSUPPORT_OFFSET          0x4c
#define GC_USB_GHWCFG3_LPMMODE_LSB               0xf
#define GC_USB_GHWCFG3_LPMMODE_MASK              0x8000
#define GC_USB_GHWCFG3_LPMMODE_SIZE              0x1
#define GC_USB_GHWCFG3_LPMMODE_DEFAULT           0x0
#define GC_USB_GHWCFG3_LPMMODE_OFFSET            0x4c
#define GC_USB_GHWCFG3_DFIFODEPTH_LSB            0x10
#define GC_USB_GHWCFG3_DFIFODEPTH_MASK           0xffff0000
#define GC_USB_GHWCFG3_DFIFODEPTH_SIZE           0x10
#define GC_USB_GHWCFG3_DFIFODEPTH_DEFAULT        0x0
#define GC_USB_GHWCFG3_DFIFODEPTH_OFFSET         0x4c
#define GC_USB_GHWCFG4_NUMDEVPERIOEPS_LSB        0x0
#define GC_USB_GHWCFG4_NUMDEVPERIOEPS_MASK       0xf
#define GC_USB_GHWCFG4_NUMDEVPERIOEPS_SIZE       0x4
#define GC_USB_GHWCFG4_NUMDEVPERIOEPS_DEFAULT    0x0
#define GC_USB_GHWCFG4_NUMDEVPERIOEPS_OFFSET     0x50
#define GC_USB_GHWCFG4_PARTIALPWRDN_LSB          0x4
#define GC_USB_GHWCFG4_PARTIALPWRDN_MASK         0x10
#define GC_USB_GHWCFG4_PARTIALPWRDN_SIZE         0x1
#define GC_USB_GHWCFG4_PARTIALPWRDN_DEFAULT      0x0
#define GC_USB_GHWCFG4_PARTIALPWRDN_OFFSET       0x50
#define GC_USB_GHWCFG4_AHBFREQ_LSB               0x5
#define GC_USB_GHWCFG4_AHBFREQ_MASK              0x20
#define GC_USB_GHWCFG4_AHBFREQ_SIZE              0x1
#define GC_USB_GHWCFG4_AHBFREQ_DEFAULT           0x0
#define GC_USB_GHWCFG4_AHBFREQ_OFFSET            0x50
#define GC_USB_GHWCFG4_HIBERNATION_LSB           0x6
#define GC_USB_GHWCFG4_HIBERNATION_MASK          0x40
#define GC_USB_GHWCFG4_HIBERNATION_SIZE          0x1
#define GC_USB_GHWCFG4_HIBERNATION_DEFAULT       0x0
#define GC_USB_GHWCFG4_HIBERNATION_OFFSET        0x50
#define GC_USB_GHWCFG4_EXTENDEDHIBERNATION_LSB   0x7
#define GC_USB_GHWCFG4_EXTENDEDHIBERNATION_MASK  0x80
#define GC_USB_GHWCFG4_EXTENDEDHIBERNATION_SIZE  0x1
#define GC_USB_GHWCFG4_EXTENDEDHIBERNATION_DEFAULT 0x0
#define GC_USB_GHWCFG4_EXTENDEDHIBERNATION_OFFSET 0x50
#define GC_USB_GHWCFG4_PHYDATAWIDTH_LSB          0xe
#define GC_USB_GHWCFG4_PHYDATAWIDTH_MASK         0xc000
#define GC_USB_GHWCFG4_PHYDATAWIDTH_SIZE         0x2
#define GC_USB_GHWCFG4_PHYDATAWIDTH_DEFAULT      0x0
#define GC_USB_GHWCFG4_PHYDATAWIDTH_OFFSET       0x50
#define GC_USB_GHWCFG4_NUMCTLEPS_LSB             0x10
#define GC_USB_GHWCFG4_NUMCTLEPS_MASK            0xf0000
#define GC_USB_GHWCFG4_NUMCTLEPS_SIZE            0x4
#define GC_USB_GHWCFG4_NUMCTLEPS_DEFAULT         0x0
#define GC_USB_GHWCFG4_NUMCTLEPS_OFFSET          0x50
#define GC_USB_GHWCFG4_IDDGFLTR_LSB              0x14
#define GC_USB_GHWCFG4_IDDGFLTR_MASK             0x100000
#define GC_USB_GHWCFG4_IDDGFLTR_SIZE             0x1
#define GC_USB_GHWCFG4_IDDGFLTR_DEFAULT          0x0
#define GC_USB_GHWCFG4_IDDGFLTR_OFFSET           0x50
#define GC_USB_GHWCFG4_VBUSVALIDFLTR_LSB         0x15
#define GC_USB_GHWCFG4_VBUSVALIDFLTR_MASK        0x200000
#define GC_USB_GHWCFG4_VBUSVALIDFLTR_SIZE        0x1
#define GC_USB_GHWCFG4_VBUSVALIDFLTR_DEFAULT     0x0
#define GC_USB_GHWCFG4_VBUSVALIDFLTR_OFFSET      0x50
#define GC_USB_GHWCFG4_AVALIDFLTR_LSB            0x16
#define GC_USB_GHWCFG4_AVALIDFLTR_MASK           0x400000
#define GC_USB_GHWCFG4_AVALIDFLTR_SIZE           0x1
#define GC_USB_GHWCFG4_AVALIDFLTR_DEFAULT        0x0
#define GC_USB_GHWCFG4_AVALIDFLTR_OFFSET         0x50
#define GC_USB_GHWCFG4_BVALIDFLTR_LSB            0x17
#define GC_USB_GHWCFG4_BVALIDFLTR_MASK           0x800000
#define GC_USB_GHWCFG4_BVALIDFLTR_SIZE           0x1
#define GC_USB_GHWCFG4_BVALIDFLTR_DEFAULT        0x0
#define GC_USB_GHWCFG4_BVALIDFLTR_OFFSET         0x50
#define GC_USB_GHWCFG4_SESSENDFLTR_LSB           0x18
#define GC_USB_GHWCFG4_SESSENDFLTR_MASK          0x1000000
#define GC_USB_GHWCFG4_SESSENDFLTR_SIZE          0x1
#define GC_USB_GHWCFG4_SESSENDFLTR_DEFAULT       0x0
#define GC_USB_GHWCFG4_SESSENDFLTR_OFFSET        0x50
#define GC_USB_GHWCFG4_DEDFIFOMODE_LSB           0x19
#define GC_USB_GHWCFG4_DEDFIFOMODE_MASK          0x2000000
#define GC_USB_GHWCFG4_DEDFIFOMODE_SIZE          0x1
#define GC_USB_GHWCFG4_DEDFIFOMODE_DEFAULT       0x0
#define GC_USB_GHWCFG4_DEDFIFOMODE_OFFSET        0x50
#define GC_USB_GHWCFG4_INEPS_LSB                 0x1a
#define GC_USB_GHWCFG4_INEPS_MASK                0x3c000000
#define GC_USB_GHWCFG4_INEPS_SIZE                0x4
#define GC_USB_GHWCFG4_INEPS_DEFAULT             0x0
#define GC_USB_GHWCFG4_INEPS_OFFSET              0x50
#define GC_USB_GHWCFG4_DESCDMAENABLED_LSB        0x1e
#define GC_USB_GHWCFG4_DESCDMAENABLED_MASK       0x40000000
#define GC_USB_GHWCFG4_DESCDMAENABLED_SIZE       0x1
#define GC_USB_GHWCFG4_DESCDMAENABLED_DEFAULT    0x0
#define GC_USB_GHWCFG4_DESCDMAENABLED_OFFSET     0x50
#define GC_USB_GHWCFG4_DESCDMA_LSB               0x1f
#define GC_USB_GHWCFG4_DESCDMA_MASK              0x80000000
#define GC_USB_GHWCFG4_DESCDMA_SIZE              0x1
#define GC_USB_GHWCFG4_DESCDMA_DEFAULT           0x0
#define GC_USB_GHWCFG4_DESCDMA_OFFSET            0x50
#define GC_USB_GDFIFOCFG_GDFIFOCFG_LSB           0x0
#define GC_USB_GDFIFOCFG_GDFIFOCFG_MASK          0xffff
#define GC_USB_GDFIFOCFG_GDFIFOCFG_SIZE          0x10
#define GC_USB_GDFIFOCFG_GDFIFOCFG_DEFAULT       0x0
#define GC_USB_GDFIFOCFG_GDFIFOCFG_OFFSET        0x5c
#define GC_USB_GDFIFOCFG_EPINFOBASEADDR_LSB      0x10
#define GC_USB_GDFIFOCFG_EPINFOBASEADDR_MASK     0xffff0000
#define GC_USB_GDFIFOCFG_EPINFOBASEADDR_SIZE     0x10
#define GC_USB_GDFIFOCFG_EPINFOBASEADDR_DEFAULT  0x0
#define GC_USB_GDFIFOCFG_EPINFOBASEADDR_OFFSET   0x5c
#define GC_USB_DIEPTXF1_INEPNTXFSTADDR_LSB       0x0
#define GC_USB_DIEPTXF1_INEPNTXFSTADDR_MASK      0x7ff
#define GC_USB_DIEPTXF1_INEPNTXFSTADDR_SIZE      0xb
#define GC_USB_DIEPTXF1_INEPNTXFSTADDR_DEFAULT   0x0
#define GC_USB_DIEPTXF1_INEPNTXFSTADDR_OFFSET    0x104
#define GC_USB_DIEPTXF1_RESERVED11_LSB           0xc
#define GC_USB_DIEPTXF1_RESERVED11_MASK          0x1000
#define GC_USB_DIEPTXF1_RESERVED11_SIZE          0x1
#define GC_USB_DIEPTXF1_RESERVED11_DEFAULT       0x1
#define GC_USB_DIEPTXF1_RESERVED11_OFFSET        0x104
#define GC_USB_DIEPTXF1_INEPNTXFDEP_LSB          0x10
#define GC_USB_DIEPTXF1_INEPNTXFDEP_MASK         0x3f0000
#define GC_USB_DIEPTXF1_INEPNTXFDEP_SIZE         0x6
#define GC_USB_DIEPTXF1_INEPNTXFDEP_DEFAULT      0x0
#define GC_USB_DIEPTXF1_INEPNTXFDEP_OFFSET       0x104
#define GC_USB_DIEPTXF2_INEPNTXFSTADDR_LSB       0x0
#define GC_USB_DIEPTXF2_INEPNTXFSTADDR_MASK      0x7ff
#define GC_USB_DIEPTXF2_INEPNTXFSTADDR_SIZE      0xb
#define GC_USB_DIEPTXF2_INEPNTXFSTADDR_DEFAULT   0x0
#define GC_USB_DIEPTXF2_INEPNTXFSTADDR_OFFSET    0x108
#define GC_USB_DIEPTXF2_INEPNTXFDEP_LSB          0x10
#define GC_USB_DIEPTXF2_INEPNTXFDEP_MASK         0x3f0000
#define GC_USB_DIEPTXF2_INEPNTXFDEP_SIZE         0x6
#define GC_USB_DIEPTXF2_INEPNTXFDEP_DEFAULT      0x0
#define GC_USB_DIEPTXF2_INEPNTXFDEP_OFFSET       0x108
#define GC_USB_DIEPTXF3_INEPNTXFSTADDR_LSB       0x0
#define GC_USB_DIEPTXF3_INEPNTXFSTADDR_MASK      0x7ff
#define GC_USB_DIEPTXF3_INEPNTXFSTADDR_SIZE      0xb
#define GC_USB_DIEPTXF3_INEPNTXFSTADDR_DEFAULT   0x0
#define GC_USB_DIEPTXF3_INEPNTXFSTADDR_OFFSET    0x10c
#define GC_USB_DIEPTXF3_INEPNTXFDEP_LSB          0x10
#define GC_USB_DIEPTXF3_INEPNTXFDEP_MASK         0x3f0000
#define GC_USB_DIEPTXF3_INEPNTXFDEP_SIZE         0x6
#define GC_USB_DIEPTXF3_INEPNTXFDEP_DEFAULT      0x0
#define GC_USB_DIEPTXF3_INEPNTXFDEP_OFFSET       0x10c
#define GC_USB_DIEPTXF4_INEPNTXFSTADDR_LSB       0x0
#define GC_USB_DIEPTXF4_INEPNTXFSTADDR_MASK      0x7ff
#define GC_USB_DIEPTXF4_INEPNTXFSTADDR_SIZE      0xb
#define GC_USB_DIEPTXF4_INEPNTXFSTADDR_DEFAULT   0x0
#define GC_USB_DIEPTXF4_INEPNTXFSTADDR_OFFSET    0x110
#define GC_USB_DIEPTXF4_INEPNTXFDEP_LSB          0x10
#define GC_USB_DIEPTXF4_INEPNTXFDEP_MASK         0x3f0000
#define GC_USB_DIEPTXF4_INEPNTXFDEP_SIZE         0x6
#define GC_USB_DIEPTXF4_INEPNTXFDEP_DEFAULT      0x0
#define GC_USB_DIEPTXF4_INEPNTXFDEP_OFFSET       0x110
#define GC_USB_DIEPTXF5_INEPNTXFSTADDR_LSB       0x0
#define GC_USB_DIEPTXF5_INEPNTXFSTADDR_MASK      0x7ff
#define GC_USB_DIEPTXF5_INEPNTXFSTADDR_SIZE      0xb
#define GC_USB_DIEPTXF5_INEPNTXFSTADDR_DEFAULT   0x0
#define GC_USB_DIEPTXF5_INEPNTXFSTADDR_OFFSET    0x114
#define GC_USB_DIEPTXF5_INEPNTXFDEP_LSB          0x10
#define GC_USB_DIEPTXF5_INEPNTXFDEP_MASK         0x3f0000
#define GC_USB_DIEPTXF5_INEPNTXFDEP_SIZE         0x6
#define GC_USB_DIEPTXF5_INEPNTXFDEP_DEFAULT      0x0
#define GC_USB_DIEPTXF5_INEPNTXFDEP_OFFSET       0x114
#define GC_USB_DIEPTXF6_INEPNTXFSTADDR_LSB       0x0
#define GC_USB_DIEPTXF6_INEPNTXFSTADDR_MASK      0x7ff
#define GC_USB_DIEPTXF6_INEPNTXFSTADDR_SIZE      0xb
#define GC_USB_DIEPTXF6_INEPNTXFSTADDR_DEFAULT   0x0
#define GC_USB_DIEPTXF6_INEPNTXFSTADDR_OFFSET    0x118
#define GC_USB_DIEPTXF6_INEPNTXFDEP_LSB          0x10
#define GC_USB_DIEPTXF6_INEPNTXFDEP_MASK         0x3f0000
#define GC_USB_DIEPTXF6_INEPNTXFDEP_SIZE         0x6
#define GC_USB_DIEPTXF6_INEPNTXFDEP_DEFAULT      0x0
#define GC_USB_DIEPTXF6_INEPNTXFDEP_OFFSET       0x118
#define GC_USB_DIEPTXF7_INEPNTXFSTADDR_LSB       0x0
#define GC_USB_DIEPTXF7_INEPNTXFSTADDR_MASK      0x7ff
#define GC_USB_DIEPTXF7_INEPNTXFSTADDR_SIZE      0xb
#define GC_USB_DIEPTXF7_INEPNTXFSTADDR_DEFAULT   0x0
#define GC_USB_DIEPTXF7_INEPNTXFSTADDR_OFFSET    0x11c
#define GC_USB_DIEPTXF7_INEPNTXFDEP_LSB          0x10
#define GC_USB_DIEPTXF7_INEPNTXFDEP_MASK         0x3f0000
#define GC_USB_DIEPTXF7_INEPNTXFDEP_SIZE         0x6
#define GC_USB_DIEPTXF7_INEPNTXFDEP_DEFAULT      0x0
#define GC_USB_DIEPTXF7_INEPNTXFDEP_OFFSET       0x11c
#define GC_USB_DIEPTXF8_INEPNTXFSTADDR_LSB       0x0
#define GC_USB_DIEPTXF8_INEPNTXFSTADDR_MASK      0x7ff
#define GC_USB_DIEPTXF8_INEPNTXFSTADDR_SIZE      0xb
#define GC_USB_DIEPTXF8_INEPNTXFSTADDR_DEFAULT   0x0
#define GC_USB_DIEPTXF8_INEPNTXFSTADDR_OFFSET    0x120
#define GC_USB_DIEPTXF8_INEPNTXFDEP_LSB          0x10
#define GC_USB_DIEPTXF8_INEPNTXFDEP_MASK         0x3f0000
#define GC_USB_DIEPTXF8_INEPNTXFDEP_SIZE         0x6
#define GC_USB_DIEPTXF8_INEPNTXFDEP_DEFAULT      0x0
#define GC_USB_DIEPTXF8_INEPNTXFDEP_OFFSET       0x120
#define GC_USB_DIEPTXF9_INEPNTXFSTADDR_LSB       0x0
#define GC_USB_DIEPTXF9_INEPNTXFSTADDR_MASK      0x7ff
#define GC_USB_DIEPTXF9_INEPNTXFSTADDR_SIZE      0xb
#define GC_USB_DIEPTXF9_INEPNTXFSTADDR_DEFAULT   0x0
#define GC_USB_DIEPTXF9_INEPNTXFSTADDR_OFFSET    0x124
#define GC_USB_DIEPTXF9_INEPNTXFDEP_LSB          0x10
#define GC_USB_DIEPTXF9_INEPNTXFDEP_MASK         0x3f0000
#define GC_USB_DIEPTXF9_INEPNTXFDEP_SIZE         0x6
#define GC_USB_DIEPTXF9_INEPNTXFDEP_DEFAULT      0x0
#define GC_USB_DIEPTXF9_INEPNTXFDEP_OFFSET       0x124
#define GC_USB_DIEPTXF10_INEPNTXFSTADDR_LSB      0x0
#define GC_USB_DIEPTXF10_INEPNTXFSTADDR_MASK     0x7ff
#define GC_USB_DIEPTXF10_INEPNTXFSTADDR_SIZE     0xb
#define GC_USB_DIEPTXF10_INEPNTXFSTADDR_DEFAULT  0x0
#define GC_USB_DIEPTXF10_INEPNTXFSTADDR_OFFSET   0x128
#define GC_USB_DIEPTXF10_INEPNTXFDEP_LSB         0x10
#define GC_USB_DIEPTXF10_INEPNTXFDEP_MASK        0x3f0000
#define GC_USB_DIEPTXF10_INEPNTXFDEP_SIZE        0x6
#define GC_USB_DIEPTXF10_INEPNTXFDEP_DEFAULT     0x0
#define GC_USB_DIEPTXF10_INEPNTXFDEP_OFFSET      0x128
#define GC_USB_DIEPTXF11_INEPNTXFSTADDR_LSB      0x0
#define GC_USB_DIEPTXF11_INEPNTXFSTADDR_MASK     0x7ff
#define GC_USB_DIEPTXF11_INEPNTXFSTADDR_SIZE     0xb
#define GC_USB_DIEPTXF11_INEPNTXFSTADDR_DEFAULT  0x0
#define GC_USB_DIEPTXF11_INEPNTXFSTADDR_OFFSET   0x12c
#define GC_USB_DIEPTXF11_INEPNTXFDEP_LSB         0x10
#define GC_USB_DIEPTXF11_INEPNTXFDEP_MASK        0x3f0000
#define GC_USB_DIEPTXF11_INEPNTXFDEP_SIZE        0x6
#define GC_USB_DIEPTXF11_INEPNTXFDEP_DEFAULT     0x0
#define GC_USB_DIEPTXF11_INEPNTXFDEP_OFFSET      0x12c
#define GC_USB_DIEPTXF12_INEPNTXFSTADDR_LSB      0x0
#define GC_USB_DIEPTXF12_INEPNTXFSTADDR_MASK     0x7ff
#define GC_USB_DIEPTXF12_INEPNTXFSTADDR_SIZE     0xb
#define GC_USB_DIEPTXF12_INEPNTXFSTADDR_DEFAULT  0x0
#define GC_USB_DIEPTXF12_INEPNTXFSTADDR_OFFSET   0x130
#define GC_USB_DIEPTXF12_INEPNTXFDEP_LSB         0x10
#define GC_USB_DIEPTXF12_INEPNTXFDEP_MASK        0x3f0000
#define GC_USB_DIEPTXF12_INEPNTXFDEP_SIZE        0x6
#define GC_USB_DIEPTXF12_INEPNTXFDEP_DEFAULT     0x0
#define GC_USB_DIEPTXF12_INEPNTXFDEP_OFFSET      0x130
#define GC_USB_DIEPTXF13_INEPNTXFSTADDR_LSB      0x0
#define GC_USB_DIEPTXF13_INEPNTXFSTADDR_MASK     0x7ff
#define GC_USB_DIEPTXF13_INEPNTXFSTADDR_SIZE     0xb
#define GC_USB_DIEPTXF13_INEPNTXFSTADDR_DEFAULT  0x0
#define GC_USB_DIEPTXF13_INEPNTXFSTADDR_OFFSET   0x134
#define GC_USB_DIEPTXF13_INEPNTXFDEP_LSB         0x10
#define GC_USB_DIEPTXF13_INEPNTXFDEP_MASK        0x3f0000
#define GC_USB_DIEPTXF13_INEPNTXFDEP_SIZE        0x6
#define GC_USB_DIEPTXF13_INEPNTXFDEP_DEFAULT     0x0
#define GC_USB_DIEPTXF13_INEPNTXFDEP_OFFSET      0x134
#define GC_USB_DIEPTXF14_INEPNTXFSTADDR_LSB      0x0
#define GC_USB_DIEPTXF14_INEPNTXFSTADDR_MASK     0x7ff
#define GC_USB_DIEPTXF14_INEPNTXFSTADDR_SIZE     0xb
#define GC_USB_DIEPTXF14_INEPNTXFSTADDR_DEFAULT  0x0
#define GC_USB_DIEPTXF14_INEPNTXFSTADDR_OFFSET   0x138
#define GC_USB_DIEPTXF14_INEPNTXFDEP_LSB         0x10
#define GC_USB_DIEPTXF14_INEPNTXFDEP_MASK        0x3f0000
#define GC_USB_DIEPTXF14_INEPNTXFDEP_SIZE        0x6
#define GC_USB_DIEPTXF14_INEPNTXFDEP_DEFAULT     0x0
#define GC_USB_DIEPTXF14_INEPNTXFDEP_OFFSET      0x138
#define GC_USB_DIEPTXF15_INEPNTXFSTADDR_LSB      0x0
#define GC_USB_DIEPTXF15_INEPNTXFSTADDR_MASK     0x7ff
#define GC_USB_DIEPTXF15_INEPNTXFSTADDR_SIZE     0xb
#define GC_USB_DIEPTXF15_INEPNTXFSTADDR_DEFAULT  0x0
#define GC_USB_DIEPTXF15_INEPNTXFSTADDR_OFFSET   0x13c
#define GC_USB_DIEPTXF15_INEPNTXFDEP_LSB         0x10
#define GC_USB_DIEPTXF15_INEPNTXFDEP_MASK        0x3f0000
#define GC_USB_DIEPTXF15_INEPNTXFDEP_SIZE        0x6
#define GC_USB_DIEPTXF15_INEPNTXFDEP_DEFAULT     0x0
#define GC_USB_DIEPTXF15_INEPNTXFDEP_OFFSET      0x13c
#define GC_USB_DCFG_DEVSPD_LSB                   0x0
#define GC_USB_DCFG_DEVSPD_MASK                  0x3
#define GC_USB_DCFG_DEVSPD_SIZE                  0x2
#define GC_USB_DCFG_DEVSPD_DEFAULT               0x0
#define GC_USB_DCFG_DEVSPD_OFFSET                0x800
#define GC_USB_DCFG_NZSTSOUTHSHK_LSB             0x2
#define GC_USB_DCFG_NZSTSOUTHSHK_MASK            0x4
#define GC_USB_DCFG_NZSTSOUTHSHK_SIZE            0x1
#define GC_USB_DCFG_NZSTSOUTHSHK_DEFAULT         0x0
#define GC_USB_DCFG_NZSTSOUTHSHK_OFFSET          0x800
#define GC_USB_DCFG_ENA32KHZSUSP_LSB             0x3
#define GC_USB_DCFG_ENA32KHZSUSP_MASK            0x8
#define GC_USB_DCFG_ENA32KHZSUSP_SIZE            0x1
#define GC_USB_DCFG_ENA32KHZSUSP_DEFAULT         0x0
#define GC_USB_DCFG_ENA32KHZSUSP_OFFSET          0x800
#define GC_USB_DCFG_DEVADDR_LSB                  0x4
#define GC_USB_DCFG_DEVADDR_MASK                 0x7f0
#define GC_USB_DCFG_DEVADDR_SIZE                 0x7
#define GC_USB_DCFG_DEVADDR_DEFAULT              0x0
#define GC_USB_DCFG_DEVADDR_OFFSET               0x800
#define GC_USB_DCFG_PERFRINT_LSB                 0xb
#define GC_USB_DCFG_PERFRINT_MASK                0x1800
#define GC_USB_DCFG_PERFRINT_SIZE                0x2
#define GC_USB_DCFG_PERFRINT_DEFAULT             0x0
#define GC_USB_DCFG_PERFRINT_OFFSET              0x800
#define GC_USB_DCFG_ENDEVOUTNAK_LSB              0xd
#define GC_USB_DCFG_ENDEVOUTNAK_MASK             0x2000
#define GC_USB_DCFG_ENDEVOUTNAK_SIZE             0x1
#define GC_USB_DCFG_ENDEVOUTNAK_DEFAULT          0x0
#define GC_USB_DCFG_ENDEVOUTNAK_OFFSET           0x800
#define GC_USB_DCFG_XCVRDLY_LSB                  0xe
#define GC_USB_DCFG_XCVRDLY_MASK                 0x4000
#define GC_USB_DCFG_XCVRDLY_SIZE                 0x1
#define GC_USB_DCFG_XCVRDLY_DEFAULT              0x0
#define GC_USB_DCFG_XCVRDLY_OFFSET               0x800
#define GC_USB_DCFG_ERRATICINTMSK_LSB            0xf
#define GC_USB_DCFG_ERRATICINTMSK_MASK           0x8000
#define GC_USB_DCFG_ERRATICINTMSK_SIZE           0x1
#define GC_USB_DCFG_ERRATICINTMSK_DEFAULT        0x0
#define GC_USB_DCFG_ERRATICINTMSK_OFFSET         0x800
#define GC_USB_DCFG_DESCDMA_LSB                  0x17
#define GC_USB_DCFG_DESCDMA_MASK                 0x800000
#define GC_USB_DCFG_DESCDMA_SIZE                 0x1
#define GC_USB_DCFG_DESCDMA_DEFAULT              0x0
#define GC_USB_DCFG_DESCDMA_OFFSET               0x800
#define GC_USB_DCFG_PERSCHINTVL_LSB              0x18
#define GC_USB_DCFG_PERSCHINTVL_MASK             0x3000000
#define GC_USB_DCFG_PERSCHINTVL_SIZE             0x2
#define GC_USB_DCFG_PERSCHINTVL_DEFAULT          0x0
#define GC_USB_DCFG_PERSCHINTVL_OFFSET           0x800
#define GC_USB_DCFG_RESVALID_LSB                 0x1a
#define GC_USB_DCFG_RESVALID_MASK                0xfc000000
#define GC_USB_DCFG_RESVALID_SIZE                0x6
#define GC_USB_DCFG_RESVALID_DEFAULT             0x2
#define GC_USB_DCFG_RESVALID_OFFSET              0x800
#define GC_USB_DCTL_RMTWKUPSIG_LSB               0x0
#define GC_USB_DCTL_RMTWKUPSIG_MASK              0x1
#define GC_USB_DCTL_RMTWKUPSIG_SIZE              0x1
