jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
#define GC_USB_DAINTMSK_INEPMSK15_DEFAULT        0x0
#define GC_USB_DAINTMSK_INEPMSK15_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK0_LSB            0x10
#define GC_USB_DAINTMSK_OUTEPMSK0_MASK           0x10000
#define GC_USB_DAINTMSK_OUTEPMSK0_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK0_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK0_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK1_LSB            0x11
#define GC_USB_DAINTMSK_OUTEPMSK1_MASK           0x20000
#define GC_USB_DAINTMSK_OUTEPMSK1_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK1_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK1_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK2_LSB            0x12
#define GC_USB_DAINTMSK_OUTEPMSK2_MASK           0x40000
#define GC_USB_DAINTMSK_OUTEPMSK2_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK2_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK2_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK3_LSB            0x13
#define GC_USB_DAINTMSK_OUTEPMSK3_MASK           0x80000
#define GC_USB_DAINTMSK_OUTEPMSK3_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK3_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK3_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK4_LSB            0x14
#define GC_USB_DAINTMSK_OUTEPMSK4_MASK           0x100000
#define GC_USB_DAINTMSK_OUTEPMSK4_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK4_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK4_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK5_LSB            0x15
#define GC_USB_DAINTMSK_OUTEPMSK5_MASK           0x200000
#define GC_USB_DAINTMSK_OUTEPMSK5_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK5_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK5_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK6_LSB            0x16
#define GC_USB_DAINTMSK_OUTEPMSK6_MASK           0x400000
#define GC_USB_DAINTMSK_OUTEPMSK6_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK6_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK6_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK7_LSB            0x17
#define GC_USB_DAINTMSK_OUTEPMSK7_MASK           0x800000
#define GC_USB_DAINTMSK_OUTEPMSK7_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK7_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK7_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK8_LSB            0x18
#define GC_USB_DAINTMSK_OUTEPMSK8_MASK           0x1000000
#define GC_USB_DAINTMSK_OUTEPMSK8_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK8_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK8_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK9_LSB            0x19
#define GC_USB_DAINTMSK_OUTEPMSK9_MASK           0x2000000
#define GC_USB_DAINTMSK_OUTEPMSK9_SIZE           0x1
#define GC_USB_DAINTMSK_OUTEPMSK9_DEFAULT        0x0
#define GC_USB_DAINTMSK_OUTEPMSK9_OFFSET         0x81c
#define GC_USB_DAINTMSK_OUTEPMSK10_LSB           0x1a
#define GC_USB_DAINTMSK_OUTEPMSK10_MASK          0x4000000
#define GC_USB_DAINTMSK_OUTEPMSK10_SIZE          0x1
#define GC_USB_DAINTMSK_OUTEPMSK10_DEFAULT       0x0
#define GC_USB_DAINTMSK_OUTEPMSK10_OFFSET        0x81c
#define GC_USB_DAINTMSK_OUTEPMSK11_LSB           0x1b
#define GC_USB_DAINTMSK_OUTEPMSK11_MASK          0x8000000
#define GC_USB_DAINTMSK_OUTEPMSK11_SIZE          0x1
#define GC_USB_DAINTMSK_OUTEPMSK11_DEFAULT       0x0
#define GC_USB_DAINTMSK_OUTEPMSK11_OFFSET        0x81c
#define GC_USB_DAINTMSK_OUTEPMSK12_LSB           0x1c
#define GC_USB_DAINTMSK_OUTEPMSK12_MASK          0x10000000
#define GC_USB_DAINTMSK_OUTEPMSK12_SIZE          0x1
#define GC_USB_DAINTMSK_OUTEPMSK12_DEFAULT       0x0
#define GC_USB_DAINTMSK_OUTEPMSK12_OFFSET        0x81c
#define GC_USB_DAINTMSK_OUTEPMSK13_LSB           0x1d
#define GC_USB_DAINTMSK_OUTEPMSK13_MASK          0x20000000
#define GC_USB_DAINTMSK_OUTEPMSK13_SIZE          0x1
#define GC_USB_DAINTMSK_OUTEPMSK13_DEFAULT       0x0
#define GC_USB_DAINTMSK_OUTEPMSK13_OFFSET        0x81c
#define GC_USB_DAINTMSK_OUTEPMSK14_LSB           0x1e
#define GC_USB_DAINTMSK_OUTEPMSK14_MASK          0x40000000
#define GC_USB_DAINTMSK_OUTEPMSK14_SIZE          0x1
#define GC_USB_DAINTMSK_OUTEPMSK14_DEFAULT       0x0
#define GC_USB_DAINTMSK_OUTEPMSK14_OFFSET        0x81c
#define GC_USB_DAINTMSK_OUTEPMSK15_LSB           0x1f
#define GC_USB_DAINTMSK_OUTEPMSK15_MASK          0x80000000
#define GC_USB_DAINTMSK_OUTEPMSK15_SIZE          0x1
#define GC_USB_DAINTMSK_OUTEPMSK15_DEFAULT       0x0
#define GC_USB_DAINTMSK_OUTEPMSK15_OFFSET        0x81c
#define GC_USB_DVBUSDIS_DVBUSDIS_LSB             0x0
#define GC_USB_DVBUSDIS_DVBUSDIS_MASK            0xffff
#define GC_USB_DVBUSDIS_DVBUSDIS_SIZE            0x10
#define GC_USB_DVBUSDIS_DVBUSDIS_DEFAULT         0x0
#define GC_USB_DVBUSDIS_DVBUSDIS_OFFSET          0x828
#define GC_USB_DVBUSPULSE_DVBUSPULSE_LSB         0x0
#define GC_USB_DVBUSPULSE_DVBUSPULSE_MASK        0xfff
#define GC_USB_DVBUSPULSE_DVBUSPULSE_SIZE        0xc
#define GC_USB_DVBUSPULSE_DVBUSPULSE_DEFAULT     0x0
#define GC_USB_DVBUSPULSE_DVBUSPULSE_OFFSET      0x82c
#define GC_USB_DTHRCTL_NONISOTHREN_LSB           0x0
#define GC_USB_DTHRCTL_NONISOTHREN_MASK          0x1
#define GC_USB_DTHRCTL_NONISOTHREN_SIZE          0x1
#define GC_USB_DTHRCTL_NONISOTHREN_DEFAULT       0x0
#define GC_USB_DTHRCTL_NONISOTHREN_OFFSET        0x830
#define GC_USB_DTHRCTL_ISOTHREN_LSB              0x1
#define GC_USB_DTHRCTL_ISOTHREN_MASK             0x2
#define GC_USB_DTHRCTL_ISOTHREN_SIZE             0x1
#define GC_USB_DTHRCTL_ISOTHREN_DEFAULT          0x0
#define GC_USB_DTHRCTL_ISOTHREN_OFFSET           0x830
#define GC_USB_DTHRCTL_TXTHRLEN_LSB              0x2
#define GC_USB_DTHRCTL_TXTHRLEN_MASK             0x7fc
#define GC_USB_DTHRCTL_TXTHRLEN_SIZE             0x9
#define GC_USB_DTHRCTL_TXTHRLEN_DEFAULT          0x0
#define GC_USB_DTHRCTL_TXTHRLEN_OFFSET           0x830
#define GC_USB_DTHRCTL_AHBTHRRATIO_LSB           0xb
#define GC_USB_DTHRCTL_AHBTHRRATIO_MASK          0x1800
#define GC_USB_DTHRCTL_AHBTHRRATIO_SIZE          0x2
#define GC_USB_DTHRCTL_AHBTHRRATIO_DEFAULT       0x0
#define GC_USB_DTHRCTL_AHBTHRRATIO_OFFSET        0x830
#define GC_USB_DTHRCTL_RXTHREN_LSB               0x10
#define GC_USB_DTHRCTL_RXTHREN_MASK              0x10000
#define GC_USB_DTHRCTL_RXTHREN_SIZE              0x1
#define GC_USB_DTHRCTL_RXTHREN_DEFAULT           0x0
#define GC_USB_DTHRCTL_RXTHREN_OFFSET            0x830
#define GC_USB_DTHRCTL_RXTHRLEN_LSB              0x11
#define GC_USB_DTHRCTL_RXTHRLEN_MASK             0x3fe0000
#define GC_USB_DTHRCTL_RXTHRLEN_SIZE             0x9
#define GC_USB_DTHRCTL_RXTHRLEN_DEFAULT          0x0
#define GC_USB_DTHRCTL_RXTHRLEN_OFFSET           0x830
#define GC_USB_DTHRCTL_ARBPRKEN_LSB              0x1b
#define GC_USB_DTHRCTL_ARBPRKEN_MASK             0x8000000
#define GC_USB_DTHRCTL_ARBPRKEN_SIZE             0x1
#define GC_USB_DTHRCTL_ARBPRKEN_DEFAULT          0x0
#define GC_USB_DTHRCTL_ARBPRKEN_OFFSET           0x830
#define GC_USB_DIEPEMPMSK_INEPTXFEMPMSK_LSB      0x0
#define GC_USB_DIEPEMPMSK_INEPTXFEMPMSK_MASK     0xffff
#define GC_USB_DIEPEMPMSK_INEPTXFEMPMSK_SIZE     0x10
#define GC_USB_DIEPEMPMSK_INEPTXFEMPMSK_DEFAULT  0x0
#define GC_USB_DIEPEMPMSK_INEPTXFEMPMSK_OFFSET   0x834
#define GC_USB_DIEPCTL0_MPS_LSB                  0x0
#define GC_USB_DIEPCTL0_MPS_MASK                 0x3
#define GC_USB_DIEPCTL0_MPS_SIZE                 0x2
#define GC_USB_DIEPCTL0_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL0_MPS_OFFSET               0x900
#define GC_USB_DIEPCTL0_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL0_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL0_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL0_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL0_USBACTEP_OFFSET          0x900
#define GC_USB_DIEPCTL0_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL0_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL0_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL0_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL0_NAKSTS_OFFSET            0x900
#define GC_USB_DIEPCTL0_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL0_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL0_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL0_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL0_EPTYPE_OFFSET            0x900
#define GC_USB_DIEPCTL0_STALL_LSB                0x15
#define GC_USB_DIEPCTL0_STALL_MASK               0x200000
#define GC_USB_DIEPCTL0_STALL_SIZE               0x1
#define GC_USB_DIEPCTL0_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL0_STALL_OFFSET             0x900
#define GC_USB_DIEPCTL0_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL0_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL0_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL0_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL0_TXFNUM_OFFSET            0x900
#define GC_USB_DIEPCTL0_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL0_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL0_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL0_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL0_CNAK_OFFSET              0x900
#define GC_USB_DIEPCTL0_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL0_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL0_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL0_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL0_SNAK_OFFSET              0x900
#define GC_USB_DIEPCTL0_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL0_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL0_EPDIS_SIZE               0x1
#define GC_USB_DIEPCTL0_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL0_EPDIS_OFFSET             0x900
#define GC_USB_DIEPCTL0_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL0_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL0_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL0_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL0_EPENA_OFFSET             0x900
#define GC_USB_DIEPINT0_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT0_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT0_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT0_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT0_XFERCOMPL_OFFSET         0x908
#define GC_USB_DIEPINT0_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT0_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT0_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT0_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT0_EPDISBLD_OFFSET          0x908
#define GC_USB_DIEPINT0_AHBERR_LSB               0x2
#define GC_USB_DIEPINT0_AHBERR_MASK              0x4
#define GC_USB_DIEPINT0_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT0_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT0_AHBERR_OFFSET            0x908
#define GC_USB_DIEPINT0_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT0_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT0_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT0_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT0_TIMEOUT_OFFSET           0x908
#define GC_USB_DIEPINT0_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT0_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT0_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT0_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT0_INTKNTXFEMP_OFFSET       0x908
#define GC_USB_DIEPINT0_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT0_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT0_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT0_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT0_INTKNEPMIS_OFFSET        0x908
#define GC_USB_DIEPINT0_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT0_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT0_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT0_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT0_INEPNAKEFF_OFFSET        0x908
#define GC_USB_DIEPINT0_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT0_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT0_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT0_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT0_TXFEMP_OFFSET            0x908
#define GC_USB_DIEPINT0_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT0_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT0_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT0_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT0_TXFIFOUNDRN_OFFSET       0x908
#define GC_USB_DIEPINT0_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT0_BNAINTR_MASK             0x200
#define GC_USB_DIEPINT0_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT0_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT0_BNAINTR_OFFSET           0x908
#define GC_USB_DIEPINT0_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT0_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT0_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT0_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT0_PKTDRPSTS_OFFSET         0x908
#define GC_USB_DIEPINT0_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT0_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT0_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT0_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT0_BBLEERR_OFFSET           0x908
#define GC_USB_DIEPINT0_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT0_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT0_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT0_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT0_NAKINTRPT_OFFSET         0x908
#define GC_USB_DIEPINT0_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT0_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT0_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT0_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT0_NYETINTRPT_OFFSET        0x908
#define GC_USB_DIEPTSIZ0_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ0_XFERSIZE_MASK           0x7f
#define GC_USB_DIEPTSIZ0_XFERSIZE_SIZE           0x7
#define GC_USB_DIEPTSIZ0_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ0_XFERSIZE_OFFSET         0x910
#define GC_USB_DIEPTSIZ0_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ0_PKTCNT_MASK             0x180000
#define GC_USB_DIEPTSIZ0_PKTCNT_SIZE             0x2
#define GC_USB_DIEPTSIZ0_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ0_PKTCNT_OFFSET           0x910
#define GC_USB_DIEPDMA0_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA0_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA0_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA0_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA0_DMAADDR_OFFSET           0x914
#define GC_USB_DTXFSTS0_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS0_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS0_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS0_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS0_INEPTXFSPCAVAIL_OFFSET   0x918
#define GC_USB_DIEPDMAB0_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB0_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB0_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB0_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB0_DMABUFFERADDR_OFFSET    0x91c
#define GC_USB_DIEPCTL1_MPS_LSB                  0x0
#define GC_USB_DIEPCTL1_MPS_MASK                 0x7ff
#define GC_USB_DIEPCTL1_MPS_SIZE                 0xb
#define GC_USB_DIEPCTL1_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL1_MPS_OFFSET               0x920
#define GC_USB_DIEPCTL1_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL1_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL1_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL1_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL1_USBACTEP_OFFSET          0x920
#define GC_USB_DIEPCTL1_DPID_LSB                 0x10
#define GC_USB_DIEPCTL1_DPID_MASK                0x10000
#define GC_USB_DIEPCTL1_DPID_SIZE                0x1
#define GC_USB_DIEPCTL1_DPID_DEFAULT             0x0
#define GC_USB_DIEPCTL1_DPID_OFFSET              0x920
#define GC_USB_DIEPCTL1_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL1_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL1_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL1_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL1_NAKSTS_OFFSET            0x920
#define GC_USB_DIEPCTL1_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL1_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL1_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL1_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL1_EPTYPE_OFFSET            0x920
#define GC_USB_DIEPCTL1_STALL_LSB                0x15
#define GC_USB_DIEPCTL1_STALL_MASK               0x200000
#define GC_USB_DIEPCTL1_STALL_SIZE               0x1
#define GC_USB_DIEPCTL1_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL1_STALL_OFFSET             0x920
#define GC_USB_DIEPCTL1_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL1_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL1_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL1_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL1_TXFNUM_OFFSET            0x920
#define GC_USB_DIEPCTL1_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL1_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL1_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL1_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL1_CNAK_OFFSET              0x920
#define GC_USB_DIEPCTL1_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL1_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL1_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL1_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL1_SNAK_OFFSET              0x920
#define GC_USB_DIEPCTL1_SETD0PID_LSB             0x1c
#define GC_USB_DIEPCTL1_SETD0PID_MASK            0x10000000
#define GC_USB_DIEPCTL1_SETD0PID_SIZE            0x1
#define GC_USB_DIEPCTL1_SETD0PID_DEFAULT         0x0
#define GC_USB_DIEPCTL1_SETD0PID_OFFSET          0x920
#define GC_USB_DIEPCTL1_SETD1PID_LSB             0x1d
#define GC_USB_DIEPCTL1_SETD1PID_MASK            0x20000000
#define GC_USB_DIEPCTL1_SETD1PID_SIZE            0x1
#define GC_USB_DIEPCTL1_SETD1PID_DEFAULT         0x0
#define GC_USB_DIEPCTL1_SETD1PID_OFFSET          0x920
#define GC_USB_DIEPCTL1_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL1_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL1_EPDIS_SIZE               0x1
#define GC_USB_DIEPCTL1_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL1_EPDIS_OFFSET             0x920
#define GC_USB_DIEPCTL1_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL1_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL1_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL1_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL1_EPENA_OFFSET             0x920
#define GC_USB_DIEPINT1_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT1_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT1_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT1_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT1_XFERCOMPL_OFFSET         0x928
#define GC_USB_DIEPINT1_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT1_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT1_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT1_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT1_EPDISBLD_OFFSET          0x928
#define GC_USB_DIEPINT1_AHBERR_LSB               0x2
#define GC_USB_DIEPINT1_AHBERR_MASK              0x4
#define GC_USB_DIEPINT1_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT1_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT1_AHBERR_OFFSET            0x928
#define GC_USB_DIEPINT1_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT1_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT1_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT1_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT1_TIMEOUT_OFFSET           0x928
#define GC_USB_DIEPINT1_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT1_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT1_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT1_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT1_INTKNTXFEMP_OFFSET       0x928
#define GC_USB_DIEPINT1_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT1_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT1_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT1_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT1_INTKNEPMIS_OFFSET        0x928
#define GC_USB_DIEPINT1_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT1_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT1_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT1_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT1_INEPNAKEFF_OFFSET        0x928
#define GC_USB_DIEPINT1_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT1_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT1_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT1_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT1_TXFEMP_OFFSET            0x928
#define GC_USB_DIEPINT1_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT1_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT1_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT1_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT1_TXFIFOUNDRN_OFFSET       0x928
#define GC_USB_DIEPINT1_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT1_BNAINTR_MASK             0x200
#define GC_USB_DIEPINT1_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT1_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT1_BNAINTR_OFFSET           0x928
#define GC_USB_DIEPINT1_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT1_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT1_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT1_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT1_PKTDRPSTS_OFFSET         0x928
#define GC_USB_DIEPINT1_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT1_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT1_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT1_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT1_BBLEERR_OFFSET           0x928
#define GC_USB_DIEPINT1_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT1_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT1_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT1_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT1_NAKINTRPT_OFFSET         0x928
#define GC_USB_DIEPINT1_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT1_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT1_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT1_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT1_NYETINTRPT_OFFSET        0x928
#define GC_USB_DIEPTSIZ1_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ1_XFERSIZE_MASK           0x7ffff
#define GC_USB_DIEPTSIZ1_XFERSIZE_SIZE           0x13
#define GC_USB_DIEPTSIZ1_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ1_XFERSIZE_OFFSET         0x930
#define GC_USB_DIEPTSIZ1_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ1_PKTCNT_MASK             0x1ff80000
#define GC_USB_DIEPTSIZ1_PKTCNT_SIZE             0xa
#define GC_USB_DIEPTSIZ1_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ1_PKTCNT_OFFSET           0x930
#define GC_USB_DIEPTSIZ1_MC_LSB                  0x1d
#define GC_USB_DIEPTSIZ1_MC_MASK                 0x60000000
#define GC_USB_DIEPTSIZ1_MC_SIZE                 0x2
#define GC_USB_DIEPTSIZ1_MC_DEFAULT              0x0
#define GC_USB_DIEPTSIZ1_MC_OFFSET               0x930
#define GC_USB_DIEPDMA1_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA1_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA1_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA1_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA1_DMAADDR_OFFSET           0x934
#define GC_USB_DTXFSTS1_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS1_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS1_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS1_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS1_INEPTXFSPCAVAIL_OFFSET   0x938
#define GC_USB_DIEPDMAB1_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB1_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB1_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB1_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB1_DMABUFFERADDR_OFFSET    0x93c
