jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
#define GC_USB_DIEPCTL2_MPS_LSB                  0x0
#define GC_USB_DIEPCTL2_MPS_MASK                 0x7ff
#define GC_USB_DIEPCTL2_MPS_SIZE                 0xb
#define GC_USB_DIEPCTL2_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL2_MPS_OFFSET               0x940
#define GC_USB_DIEPCTL2_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL2_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL2_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL2_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL2_USBACTEP_OFFSET          0x940
#define GC_USB_DIEPCTL2_DPID_LSB                 0x10
#define GC_USB_DIEPCTL2_DPID_MASK                0x10000
#define GC_USB_DIEPCTL2_DPID_SIZE                0x1
#define GC_USB_DIEPCTL2_DPID_DEFAULT             0x0
#define GC_USB_DIEPCTL2_DPID_OFFSET              0x940
#define GC_USB_DIEPCTL2_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL2_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL2_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL2_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL2_NAKSTS_OFFSET            0x940
#define GC_USB_DIEPCTL2_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL2_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL2_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL2_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL2_EPTYPE_OFFSET            0x940
#define GC_USB_DIEPCTL2_STALL_LSB                0x15
#define GC_USB_DIEPCTL2_STALL_MASK               0x200000
#define GC_USB_DIEPCTL2_STALL_SIZE               0x1
#define GC_USB_DIEPCTL2_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL2_STALL_OFFSET             0x940
#define GC_USB_DIEPCTL2_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL2_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL2_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL2_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL2_TXFNUM_OFFSET            0x940
#define GC_USB_DIEPCTL2_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL2_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL2_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL2_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL2_CNAK_OFFSET              0x940
#define GC_USB_DIEPCTL2_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL2_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL2_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL2_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL2_SNAK_OFFSET              0x940
#define GC_USB_DIEPCTL2_SETD0PID_LSB             0x1c
#define GC_USB_DIEPCTL2_SETD0PID_MASK            0x10000000
#define GC_USB_DIEPCTL2_SETD0PID_SIZE            0x1
#define GC_USB_DIEPCTL2_SETD0PID_DEFAULT         0x0
#define GC_USB_DIEPCTL2_SETD0PID_OFFSET          0x940
#define GC_USB_DIEPCTL2_SETD1PID_LSB             0x1d
#define GC_USB_DIEPCTL2_SETD1PID_MASK            0x20000000
#define GC_USB_DIEPCTL2_SETD1PID_SIZE            0x1
#define GC_USB_DIEPCTL2_SETD1PID_DEFAULT         0x0
#define GC_USB_DIEPCTL2_SETD1PID_OFFSET          0x940
#define GC_USB_DIEPCTL2_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL2_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL2_EPDIS_SIZE               0x1
#define GC_USB_DIEPCTL2_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL2_EPDIS_OFFSET             0x940
#define GC_USB_DIEPCTL2_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL2_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL2_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL2_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL2_EPENA_OFFSET             0x940
#define GC_USB_DIEPINT2_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT2_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT2_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT2_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT2_XFERCOMPL_OFFSET         0x948
#define GC_USB_DIEPINT2_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT2_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT2_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT2_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT2_EPDISBLD_OFFSET          0x948
#define GC_USB_DIEPINT2_AHBERR_LSB               0x2
#define GC_USB_DIEPINT2_AHBERR_MASK              0x4
#define GC_USB_DIEPINT2_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT2_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT2_AHBERR_OFFSET            0x948
#define GC_USB_DIEPINT2_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT2_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT2_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT2_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT2_TIMEOUT_OFFSET           0x948
#define GC_USB_DIEPINT2_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT2_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT2_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT2_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT2_INTKNTXFEMP_OFFSET       0x948
#define GC_USB_DIEPINT2_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT2_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT2_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT2_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT2_INTKNEPMIS_OFFSET        0x948
#define GC_USB_DIEPINT2_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT2_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT2_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT2_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT2_INEPNAKEFF_OFFSET        0x948
#define GC_USB_DIEPINT2_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT2_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT2_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT2_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT2_TXFEMP_OFFSET            0x948
#define GC_USB_DIEPINT2_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT2_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT2_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT2_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT2_TXFIFOUNDRN_OFFSET       0x948
#define GC_USB_DIEPINT2_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT2_BNAINTR_MASK             0x200
#define GC_USB_DIEPINT2_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT2_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT2_BNAINTR_OFFSET           0x948
#define GC_USB_DIEPINT2_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT2_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT2_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT2_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT2_PKTDRPSTS_OFFSET         0x948
#define GC_USB_DIEPINT2_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT2_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT2_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT2_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT2_BBLEERR_OFFSET           0x948
#define GC_USB_DIEPINT2_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT2_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT2_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT2_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT2_NAKINTRPT_OFFSET         0x948
#define GC_USB_DIEPINT2_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT2_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT2_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT2_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT2_NYETINTRPT_OFFSET        0x948
#define GC_USB_DIEPTSIZ2_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ2_XFERSIZE_MASK           0x7ffff
#define GC_USB_DIEPTSIZ2_XFERSIZE_SIZE           0x13
#define GC_USB_DIEPTSIZ2_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ2_XFERSIZE_OFFSET         0x950
#define GC_USB_DIEPTSIZ2_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ2_PKTCNT_MASK             0x1ff80000
#define GC_USB_DIEPTSIZ2_PKTCNT_SIZE             0xa
#define GC_USB_DIEPTSIZ2_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ2_PKTCNT_OFFSET           0x950
#define GC_USB_DIEPTSIZ2_MC_LSB                  0x1d
#define GC_USB_DIEPTSIZ2_MC_MASK                 0x60000000
#define GC_USB_DIEPTSIZ2_MC_SIZE                 0x2
#define GC_USB_DIEPTSIZ2_MC_DEFAULT              0x0
#define GC_USB_DIEPTSIZ2_MC_OFFSET               0x950
#define GC_USB_DIEPDMA2_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA2_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA2_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA2_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA2_DMAADDR_OFFSET           0x954
#define GC_USB_DTXFSTS2_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS2_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS2_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS2_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS2_INEPTXFSPCAVAIL_OFFSET   0x958
#define GC_USB_DIEPDMAB2_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB2_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB2_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB2_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB2_DMABUFFERADDR_OFFSET    0x95c
#define GC_USB_DIEPCTL3_MPS_LSB                  0x0
#define GC_USB_DIEPCTL3_MPS_MASK                 0x7ff
#define GC_USB_DIEPCTL3_MPS_SIZE                 0xb
#define GC_USB_DIEPCTL3_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL3_MPS_OFFSET               0x960
#define GC_USB_DIEPCTL3_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL3_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL3_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL3_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL3_USBACTEP_OFFSET          0x960
#define GC_USB_DIEPCTL3_DPID_LSB                 0x10
#define GC_USB_DIEPCTL3_DPID_MASK                0x10000
#define GC_USB_DIEPCTL3_DPID_SIZE                0x1
#define GC_USB_DIEPCTL3_DPID_DEFAULT             0x0
#define GC_USB_DIEPCTL3_DPID_OFFSET              0x960
#define GC_USB_DIEPCTL3_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL3_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL3_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL3_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL3_NAKSTS_OFFSET            0x960
#define GC_USB_DIEPCTL3_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL3_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL3_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL3_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL3_EPTYPE_OFFSET            0x960
#define GC_USB_DIEPCTL3_STALL_LSB                0x15
#define GC_USB_DIEPCTL3_STALL_MASK               0x200000
#define GC_USB_DIEPCTL3_STALL_SIZE               0x1
#define GC_USB_DIEPCTL3_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL3_STALL_OFFSET             0x960
#define GC_USB_DIEPCTL3_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL3_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL3_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL3_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL3_TXFNUM_OFFSET            0x960
#define GC_USB_DIEPCTL3_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL3_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL3_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL3_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL3_CNAK_OFFSET              0x960
#define GC_USB_DIEPCTL3_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL3_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL3_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL3_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL3_SNAK_OFFSET              0x960
#define GC_USB_DIEPCTL3_SETD0PID_LSB             0x1c
#define GC_USB_DIEPCTL3_SETD0PID_MASK            0x10000000
#define GC_USB_DIEPCTL3_SETD0PID_SIZE            0x1
#define GC_USB_DIEPCTL3_SETD0PID_DEFAULT         0x0
#define GC_USB_DIEPCTL3_SETD0PID_OFFSET          0x960
#define GC_USB_DIEPCTL3_SETD1PID_LSB             0x1d
#define GC_USB_DIEPCTL3_SETD1PID_MASK            0x20000000
#define GC_USB_DIEPCTL3_SETD1PID_SIZE            0x1
#define GC_USB_DIEPCTL3_SETD1PID_DEFAULT         0x0
#define GC_USB_DIEPCTL3_SETD1PID_OFFSET          0x960
#define GC_USB_DIEPCTL3_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL3_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL3_EPDIS_SIZE               0x1
#define GC_USB_DIEPCTL3_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL3_EPDIS_OFFSET             0x960
#define GC_USB_DIEPCTL3_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL3_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL3_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL3_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL3_EPENA_OFFSET             0x960
#define GC_USB_DIEPINT3_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT3_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT3_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT3_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT3_XFERCOMPL_OFFSET         0x968
#define GC_USB_DIEPINT3_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT3_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT3_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT3_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT3_EPDISBLD_OFFSET          0x968
#define GC_USB_DIEPINT3_AHBERR_LSB               0x2
#define GC_USB_DIEPINT3_AHBERR_MASK              0x4
#define GC_USB_DIEPINT3_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT3_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT3_AHBERR_OFFSET            0x968
#define GC_USB_DIEPINT3_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT3_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT3_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT3_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT3_TIMEOUT_OFFSET           0x968
#define GC_USB_DIEPINT3_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT3_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT3_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT3_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT3_INTKNTXFEMP_OFFSET       0x968
#define GC_USB_DIEPINT3_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT3_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT3_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT3_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT3_INTKNEPMIS_OFFSET        0x968
#define GC_USB_DIEPINT3_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT3_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT3_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT3_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT3_INEPNAKEFF_OFFSET        0x968
#define GC_USB_DIEPINT3_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT3_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT3_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT3_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT3_TXFEMP_OFFSET            0x968
#define GC_USB_DIEPINT3_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT3_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT3_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT3_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT3_TXFIFOUNDRN_OFFSET       0x968
#define GC_USB_DIEPINT3_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT3_BNAINTR_MASK             0x200
#define GC_USB_DIEPINT3_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT3_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT3_BNAINTR_OFFSET           0x968
#define GC_USB_DIEPINT3_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT3_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT3_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT3_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT3_PKTDRPSTS_OFFSET         0x968
#define GC_USB_DIEPINT3_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT3_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT3_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT3_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT3_BBLEERR_OFFSET           0x968
#define GC_USB_DIEPINT3_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT3_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT3_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT3_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT3_NAKINTRPT_OFFSET         0x968
#define GC_USB_DIEPINT3_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT3_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT3_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT3_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT3_NYETINTRPT_OFFSET        0x968
#define GC_USB_DIEPTSIZ3_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ3_XFERSIZE_MASK           0x7ffff
#define GC_USB_DIEPTSIZ3_XFERSIZE_SIZE           0x13
#define GC_USB_DIEPTSIZ3_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ3_XFERSIZE_OFFSET         0x970
#define GC_USB_DIEPTSIZ3_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ3_PKTCNT_MASK             0x1ff80000
#define GC_USB_DIEPTSIZ3_PKTCNT_SIZE             0xa
#define GC_USB_DIEPTSIZ3_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ3_PKTCNT_OFFSET           0x970
#define GC_USB_DIEPTSIZ3_MC_LSB                  0x1d
#define GC_USB_DIEPTSIZ3_MC_MASK                 0x60000000
#define GC_USB_DIEPTSIZ3_MC_SIZE                 0x2
#define GC_USB_DIEPTSIZ3_MC_DEFAULT              0x0
#define GC_USB_DIEPTSIZ3_MC_OFFSET               0x970
#define GC_USB_DIEPDMA3_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA3_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA3_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA3_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA3_DMAADDR_OFFSET           0x974
#define GC_USB_DTXFSTS3_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS3_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS3_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS3_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS3_INEPTXFSPCAVAIL_OFFSET   0x978
#define GC_USB_DIEPDMAB3_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB3_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB3_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB3_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB3_DMABUFFERADDR_OFFSET    0x97c
#define GC_USB_DIEPCTL4_MPS_LSB                  0x0
#define GC_USB_DIEPCTL4_MPS_MASK                 0x7ff
#define GC_USB_DIEPCTL4_MPS_SIZE                 0xb
#define GC_USB_DIEPCTL4_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL4_MPS_OFFSET               0x980
#define GC_USB_DIEPCTL4_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL4_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL4_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL4_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL4_USBACTEP_OFFSET          0x980
#define GC_USB_DIEPCTL4_DPID_LSB                 0x10
#define GC_USB_DIEPCTL4_DPID_MASK                0x10000
#define GC_USB_DIEPCTL4_DPID_SIZE                0x1
#define GC_USB_DIEPCTL4_DPID_DEFAULT             0x0
#define GC_USB_DIEPCTL4_DPID_OFFSET              0x980
#define GC_USB_DIEPCTL4_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL4_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL4_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL4_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL4_NAKSTS_OFFSET            0x980
#define GC_USB_DIEPCTL4_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL4_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL4_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL4_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL4_EPTYPE_OFFSET            0x980
#define GC_USB_DIEPCTL4_STALL_LSB                0x15
#define GC_USB_DIEPCTL4_STALL_MASK               0x200000
#define GC_USB_DIEPCTL4_STALL_SIZE               0x1
#define GC_USB_DIEPCTL4_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL4_STALL_OFFSET             0x980
#define GC_USB_DIEPCTL4_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL4_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL4_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL4_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL4_TXFNUM_OFFSET            0x980
#define GC_USB_DIEPCTL4_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL4_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL4_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL4_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL4_CNAK_OFFSET              0x980
#define GC_USB_DIEPCTL4_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL4_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL4_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL4_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL4_SNAK_OFFSET              0x980
#define GC_USB_DIEPCTL4_SETD0PID_LSB             0x1c
#define GC_USB_DIEPCTL4_SETD0PID_MASK            0x10000000
#define GC_USB_DIEPCTL4_SETD0PID_SIZE            0x1
#define GC_USB_DIEPCTL4_SETD0PID_DEFAULT         0x0
#define GC_USB_DIEPCTL4_SETD0PID_OFFSET          0x980
#define GC_USB_DIEPCTL4_SETD1PID_LSB             0x1d
#define GC_USB_DIEPCTL4_SETD1PID_MASK            0x20000000
#define GC_USB_DIEPCTL4_SETD1PID_SIZE            0x1
#define GC_USB_DIEPCTL4_SETD1PID_DEFAULT         0x0
#define GC_USB_DIEPCTL4_SETD1PID_OFFSET          0x980
#define GC_USB_DIEPCTL4_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL4_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL4_EPDIS_SIZE               0x1
#define GC_USB_DIEPCTL4_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL4_EPDIS_OFFSET             0x980
#define GC_USB_DIEPCTL4_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL4_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL4_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL4_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL4_EPENA_OFFSET             0x980
#define GC_USB_DIEPINT4_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT4_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT4_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT4_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT4_XFERCOMPL_OFFSET         0x988
#define GC_USB_DIEPINT4_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT4_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT4_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT4_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT4_EPDISBLD_OFFSET          0x988
#define GC_USB_DIEPINT4_AHBERR_LSB               0x2
#define GC_USB_DIEPINT4_AHBERR_MASK              0x4
#define GC_USB_DIEPINT4_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT4_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT4_AHBERR_OFFSET            0x988
#define GC_USB_DIEPINT4_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT4_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT4_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT4_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT4_TIMEOUT_OFFSET           0x988
#define GC_USB_DIEPINT4_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT4_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT4_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT4_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT4_INTKNTXFEMP_OFFSET       0x988
#define GC_USB_DIEPINT4_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT4_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT4_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT4_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT4_INTKNEPMIS_OFFSET        0x988
#define GC_USB_DIEPINT4_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT4_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT4_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT4_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT4_INEPNAKEFF_OFFSET        0x988
#define GC_USB_DIEPINT4_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT4_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT4_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT4_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT4_TXFEMP_OFFSET            0x988
#define GC_USB_DIEPINT4_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT4_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT4_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT4_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT4_TXFIFOUNDRN_OFFSET       0x988
#define GC_USB_DIEPINT4_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT4_BNAINTR_MASK             0x200
