jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
#define GC_USB_DIEPINT4_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT4_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT4_BNAINTR_OFFSET           0x988
#define GC_USB_DIEPINT4_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT4_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT4_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT4_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT4_PKTDRPSTS_OFFSET         0x988
#define GC_USB_DIEPINT4_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT4_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT4_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT4_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT4_BBLEERR_OFFSET           0x988
#define GC_USB_DIEPINT4_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT4_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT4_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT4_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT4_NAKINTRPT_OFFSET         0x988
#define GC_USB_DIEPINT4_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT4_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT4_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT4_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT4_NYETINTRPT_OFFSET        0x988
#define GC_USB_DIEPTSIZ4_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ4_XFERSIZE_MASK           0x7ffff
#define GC_USB_DIEPTSIZ4_XFERSIZE_SIZE           0x13
#define GC_USB_DIEPTSIZ4_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ4_XFERSIZE_OFFSET         0x990
#define GC_USB_DIEPTSIZ4_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ4_PKTCNT_MASK             0x1ff80000
#define GC_USB_DIEPTSIZ4_PKTCNT_SIZE             0xa
#define GC_USB_DIEPTSIZ4_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ4_PKTCNT_OFFSET           0x990
#define GC_USB_DIEPTSIZ4_MC_LSB                  0x1d
#define GC_USB_DIEPTSIZ4_MC_MASK                 0x60000000
#define GC_USB_DIEPTSIZ4_MC_SIZE                 0x2
#define GC_USB_DIEPTSIZ4_MC_DEFAULT              0x0
#define GC_USB_DIEPTSIZ4_MC_OFFSET               0x990
#define GC_USB_DIEPDMA4_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA4_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA4_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA4_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA4_DMAADDR_OFFSET           0x994
#define GC_USB_DTXFSTS4_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS4_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS4_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS4_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS4_INEPTXFSPCAVAIL_OFFSET   0x998
#define GC_USB_DIEPDMAB4_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB4_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB4_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB4_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB4_DMABUFFERADDR_OFFSET    0x99c
#define GC_USB_DIEPCTL5_MPS_LSB                  0x0
#define GC_USB_DIEPCTL5_MPS_MASK                 0x7ff
#define GC_USB_DIEPCTL5_MPS_SIZE                 0xb
#define GC_USB_DIEPCTL5_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL5_MPS_OFFSET               0x9a0
#define GC_USB_DIEPCTL5_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL5_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL5_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL5_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL5_USBACTEP_OFFSET          0x9a0
#define GC_USB_DIEPCTL5_DPID_LSB                 0x10
#define GC_USB_DIEPCTL5_DPID_MASK                0x10000
#define GC_USB_DIEPCTL5_DPID_SIZE                0x1
#define GC_USB_DIEPCTL5_DPID_DEFAULT             0x0
#define GC_USB_DIEPCTL5_DPID_OFFSET              0x9a0
#define GC_USB_DIEPCTL5_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL5_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL5_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL5_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL5_NAKSTS_OFFSET            0x9a0
#define GC_USB_DIEPCTL5_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL5_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL5_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL5_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL5_EPTYPE_OFFSET            0x9a0
#define GC_USB_DIEPCTL5_STALL_LSB                0x15
#define GC_USB_DIEPCTL5_STALL_MASK               0x200000
#define GC_USB_DIEPCTL5_STALL_SIZE               0x1
#define GC_USB_DIEPCTL5_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL5_STALL_OFFSET             0x9a0
#define GC_USB_DIEPCTL5_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL5_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL5_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL5_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL5_TXFNUM_OFFSET            0x9a0
#define GC_USB_DIEPCTL5_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL5_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL5_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL5_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL5_CNAK_OFFSET              0x9a0
#define GC_USB_DIEPCTL5_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL5_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL5_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL5_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL5_SNAK_OFFSET              0x9a0
#define GC_USB_DIEPCTL5_SETD0PID_LSB             0x1c
#define GC_USB_DIEPCTL5_SETD0PID_MASK            0x10000000
#define GC_USB_DIEPCTL5_SETD0PID_SIZE            0x1
#define GC_USB_DIEPCTL5_SETD0PID_DEFAULT         0x0
#define GC_USB_DIEPCTL5_SETD0PID_OFFSET          0x9a0
#define GC_USB_DIEPCTL5_SETD1PID_LSB             0x1d
#define GC_USB_DIEPCTL5_SETD1PID_MASK            0x20000000
#define GC_USB_DIEPCTL5_SETD1PID_SIZE            0x1
#define GC_USB_DIEPCTL5_SETD1PID_DEFAULT         0x0
#define GC_USB_DIEPCTL5_SETD1PID_OFFSET          0x9a0
#define GC_USB_DIEPCTL5_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL5_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL5_EPDIS_SIZE               0x1
#define GC_USB_DIEPCTL5_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL5_EPDIS_OFFSET             0x9a0
#define GC_USB_DIEPCTL5_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL5_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL5_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL5_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL5_EPENA_OFFSET             0x9a0
#define GC_USB_DIEPINT5_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT5_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT5_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT5_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT5_XFERCOMPL_OFFSET         0x9a8
#define GC_USB_DIEPINT5_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT5_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT5_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT5_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT5_EPDISBLD_OFFSET          0x9a8
#define GC_USB_DIEPINT5_AHBERR_LSB               0x2
#define GC_USB_DIEPINT5_AHBERR_MASK              0x4
#define GC_USB_DIEPINT5_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT5_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT5_AHBERR_OFFSET            0x9a8
#define GC_USB_DIEPINT5_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT5_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT5_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT5_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT5_TIMEOUT_OFFSET           0x9a8
#define GC_USB_DIEPINT5_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT5_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT5_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT5_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT5_INTKNTXFEMP_OFFSET       0x9a8
#define GC_USB_DIEPINT5_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT5_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT5_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT5_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT5_INTKNEPMIS_OFFSET        0x9a8
#define GC_USB_DIEPINT5_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT5_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT5_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT5_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT5_INEPNAKEFF_OFFSET        0x9a8
#define GC_USB_DIEPINT5_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT5_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT5_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT5_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT5_TXFEMP_OFFSET            0x9a8
#define GC_USB_DIEPINT5_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT5_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT5_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT5_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT5_TXFIFOUNDRN_OFFSET       0x9a8
#define GC_USB_DIEPINT5_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT5_BNAINTR_MASK             0x200
#define GC_USB_DIEPINT5_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT5_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT5_BNAINTR_OFFSET           0x9a8
#define GC_USB_DIEPINT5_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT5_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT5_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT5_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT5_PKTDRPSTS_OFFSET         0x9a8
#define GC_USB_DIEPINT5_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT5_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT5_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT5_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT5_BBLEERR_OFFSET           0x9a8
#define GC_USB_DIEPINT5_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT5_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT5_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT5_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT5_NAKINTRPT_OFFSET         0x9a8
#define GC_USB_DIEPINT5_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT5_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT5_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT5_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT5_NYETINTRPT_OFFSET        0x9a8
#define GC_USB_DIEPTSIZ5_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ5_XFERSIZE_MASK           0x7ffff
#define GC_USB_DIEPTSIZ5_XFERSIZE_SIZE           0x13
#define GC_USB_DIEPTSIZ5_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ5_XFERSIZE_OFFSET         0x9b0
#define GC_USB_DIEPTSIZ5_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ5_PKTCNT_MASK             0x1ff80000
#define GC_USB_DIEPTSIZ5_PKTCNT_SIZE             0xa
#define GC_USB_DIEPTSIZ5_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ5_PKTCNT_OFFSET           0x9b0
#define GC_USB_DIEPTSIZ5_MC_LSB                  0x1d
#define GC_USB_DIEPTSIZ5_MC_MASK                 0x60000000
#define GC_USB_DIEPTSIZ5_MC_SIZE                 0x2
#define GC_USB_DIEPTSIZ5_MC_DEFAULT              0x0
#define GC_USB_DIEPTSIZ5_MC_OFFSET               0x9b0
#define GC_USB_DIEPDMA5_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA5_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA5_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA5_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA5_DMAADDR_OFFSET           0x9b4
#define GC_USB_DTXFSTS5_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS5_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS5_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS5_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS5_INEPTXFSPCAVAIL_OFFSET   0x9b8
#define GC_USB_DIEPDMAB5_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB5_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB5_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB5_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB5_DMABUFFERADDR_OFFSET    0x9bc
#define GC_USB_DIEPCTL6_MPS_LSB                  0x0
#define GC_USB_DIEPCTL6_MPS_MASK                 0x7ff
#define GC_USB_DIEPCTL6_MPS_SIZE                 0xb
#define GC_USB_DIEPCTL6_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL6_MPS_OFFSET               0x9c0
#define GC_USB_DIEPCTL6_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL6_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL6_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL6_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL6_USBACTEP_OFFSET          0x9c0
#define GC_USB_DIEPCTL6_DPID_LSB                 0x10
#define GC_USB_DIEPCTL6_DPID_MASK                0x10000
#define GC_USB_DIEPCTL6_DPID_SIZE                0x1
#define GC_USB_DIEPCTL6_DPID_DEFAULT             0x0
#define GC_USB_DIEPCTL6_DPID_OFFSET              0x9c0
#define GC_USB_DIEPCTL6_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL6_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL6_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL6_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL6_NAKSTS_OFFSET            0x9c0
#define GC_USB_DIEPCTL6_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL6_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL6_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL6_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL6_EPTYPE_OFFSET            0x9c0
#define GC_USB_DIEPCTL6_STALL_LSB                0x15
#define GC_USB_DIEPCTL6_STALL_MASK               0x200000
#define GC_USB_DIEPCTL6_STALL_SIZE               0x1
#define GC_USB_DIEPCTL6_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL6_STALL_OFFSET             0x9c0
#define GC_USB_DIEPCTL6_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL6_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL6_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL6_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL6_TXFNUM_OFFSET            0x9c0
#define GC_USB_DIEPCTL6_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL6_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL6_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL6_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL6_CNAK_OFFSET              0x9c0
#define GC_USB_DIEPCTL6_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL6_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL6_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL6_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL6_SNAK_OFFSET              0x9c0
#define GC_USB_DIEPCTL6_SETD0PID_LSB             0x1c
#define GC_USB_DIEPCTL6_SETD0PID_MASK            0x10000000
#define GC_USB_DIEPCTL6_SETD0PID_SIZE            0x1
#define GC_USB_DIEPCTL6_SETD0PID_DEFAULT         0x0
#define GC_USB_DIEPCTL6_SETD0PID_OFFSET          0x9c0
#define GC_USB_DIEPCTL6_SETD1PID_LSB             0x1d
#define GC_USB_DIEPCTL6_SETD1PID_MASK            0x20000000
#define GC_USB_DIEPCTL6_SETD1PID_SIZE            0x1
#define GC_USB_DIEPCTL6_SETD1PID_DEFAULT         0x0
#define GC_USB_DIEPCTL6_SETD1PID_OFFSET          0x9c0
#define GC_USB_DIEPCTL6_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL6_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL6_EPDIS_SIZE               0x1
#define GC_USB_DIEPCTL6_EPDIS_DEFAULT            0x0
#define GC_USB_DIEPCTL6_EPDIS_OFFSET             0x9c0
#define GC_USB_DIEPCTL6_EPENA_LSB                0x1f
#define GC_USB_DIEPCTL6_EPENA_MASK               0x80000000
#define GC_USB_DIEPCTL6_EPENA_SIZE               0x1
#define GC_USB_DIEPCTL6_EPENA_DEFAULT            0x0
#define GC_USB_DIEPCTL6_EPENA_OFFSET             0x9c0
#define GC_USB_DIEPINT6_XFERCOMPL_LSB            0x0
#define GC_USB_DIEPINT6_XFERCOMPL_MASK           0x1
#define GC_USB_DIEPINT6_XFERCOMPL_SIZE           0x1
#define GC_USB_DIEPINT6_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DIEPINT6_XFERCOMPL_OFFSET         0x9c8
#define GC_USB_DIEPINT6_EPDISBLD_LSB             0x1
#define GC_USB_DIEPINT6_EPDISBLD_MASK            0x2
#define GC_USB_DIEPINT6_EPDISBLD_SIZE            0x1
#define GC_USB_DIEPINT6_EPDISBLD_DEFAULT         0x0
#define GC_USB_DIEPINT6_EPDISBLD_OFFSET          0x9c8
#define GC_USB_DIEPINT6_AHBERR_LSB               0x2
#define GC_USB_DIEPINT6_AHBERR_MASK              0x4
#define GC_USB_DIEPINT6_AHBERR_SIZE              0x1
#define GC_USB_DIEPINT6_AHBERR_DEFAULT           0x0
#define GC_USB_DIEPINT6_AHBERR_OFFSET            0x9c8
#define GC_USB_DIEPINT6_TIMEOUT_LSB              0x3
#define GC_USB_DIEPINT6_TIMEOUT_MASK             0x8
#define GC_USB_DIEPINT6_TIMEOUT_SIZE             0x1
#define GC_USB_DIEPINT6_TIMEOUT_DEFAULT          0x0
#define GC_USB_DIEPINT6_TIMEOUT_OFFSET           0x9c8
#define GC_USB_DIEPINT6_INTKNTXFEMP_LSB          0x4
#define GC_USB_DIEPINT6_INTKNTXFEMP_MASK         0x10
#define GC_USB_DIEPINT6_INTKNTXFEMP_SIZE         0x1
#define GC_USB_DIEPINT6_INTKNTXFEMP_DEFAULT      0x0
#define GC_USB_DIEPINT6_INTKNTXFEMP_OFFSET       0x9c8
#define GC_USB_DIEPINT6_INTKNEPMIS_LSB           0x5
#define GC_USB_DIEPINT6_INTKNEPMIS_MASK          0x20
#define GC_USB_DIEPINT6_INTKNEPMIS_SIZE          0x1
#define GC_USB_DIEPINT6_INTKNEPMIS_DEFAULT       0x0
#define GC_USB_DIEPINT6_INTKNEPMIS_OFFSET        0x9c8
#define GC_USB_DIEPINT6_INEPNAKEFF_LSB           0x6
#define GC_USB_DIEPINT6_INEPNAKEFF_MASK          0x40
#define GC_USB_DIEPINT6_INEPNAKEFF_SIZE          0x1
#define GC_USB_DIEPINT6_INEPNAKEFF_DEFAULT       0x0
#define GC_USB_DIEPINT6_INEPNAKEFF_OFFSET        0x9c8
#define GC_USB_DIEPINT6_TXFEMP_LSB               0x7
#define GC_USB_DIEPINT6_TXFEMP_MASK              0x80
#define GC_USB_DIEPINT6_TXFEMP_SIZE              0x1
#define GC_USB_DIEPINT6_TXFEMP_DEFAULT           0x0
#define GC_USB_DIEPINT6_TXFEMP_OFFSET            0x9c8
#define GC_USB_DIEPINT6_TXFIFOUNDRN_LSB          0x8
#define GC_USB_DIEPINT6_TXFIFOUNDRN_MASK         0x100
#define GC_USB_DIEPINT6_TXFIFOUNDRN_SIZE         0x1
#define GC_USB_DIEPINT6_TXFIFOUNDRN_DEFAULT      0x0
#define GC_USB_DIEPINT6_TXFIFOUNDRN_OFFSET       0x9c8
#define GC_USB_DIEPINT6_BNAINTR_LSB              0x9
#define GC_USB_DIEPINT6_BNAINTR_MASK             0x200
#define GC_USB_DIEPINT6_BNAINTR_SIZE             0x1
#define GC_USB_DIEPINT6_BNAINTR_DEFAULT          0x0
#define GC_USB_DIEPINT6_BNAINTR_OFFSET           0x9c8
#define GC_USB_DIEPINT6_PKTDRPSTS_LSB            0xb
#define GC_USB_DIEPINT6_PKTDRPSTS_MASK           0x800
#define GC_USB_DIEPINT6_PKTDRPSTS_SIZE           0x1
#define GC_USB_DIEPINT6_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DIEPINT6_PKTDRPSTS_OFFSET         0x9c8
#define GC_USB_DIEPINT6_BBLEERR_LSB              0xc
#define GC_USB_DIEPINT6_BBLEERR_MASK             0x1000
#define GC_USB_DIEPINT6_BBLEERR_SIZE             0x1
#define GC_USB_DIEPINT6_BBLEERR_DEFAULT          0x0
#define GC_USB_DIEPINT6_BBLEERR_OFFSET           0x9c8
#define GC_USB_DIEPINT6_NAKINTRPT_LSB            0xd
#define GC_USB_DIEPINT6_NAKINTRPT_MASK           0x2000
#define GC_USB_DIEPINT6_NAKINTRPT_SIZE           0x1
#define GC_USB_DIEPINT6_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DIEPINT6_NAKINTRPT_OFFSET         0x9c8
#define GC_USB_DIEPINT6_NYETINTRPT_LSB           0xe
#define GC_USB_DIEPINT6_NYETINTRPT_MASK          0x4000
#define GC_USB_DIEPINT6_NYETINTRPT_SIZE          0x1
#define GC_USB_DIEPINT6_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT6_NYETINTRPT_OFFSET        0x9c8
#define GC_USB_DIEPTSIZ6_XFERSIZE_LSB            0x0
#define GC_USB_DIEPTSIZ6_XFERSIZE_MASK           0x7ffff
#define GC_USB_DIEPTSIZ6_XFERSIZE_SIZE           0x13
#define GC_USB_DIEPTSIZ6_XFERSIZE_DEFAULT        0x0
#define GC_USB_DIEPTSIZ6_XFERSIZE_OFFSET         0x9d0
#define GC_USB_DIEPTSIZ6_PKTCNT_LSB              0x13
#define GC_USB_DIEPTSIZ6_PKTCNT_MASK             0x1ff80000
#define GC_USB_DIEPTSIZ6_PKTCNT_SIZE             0xa
#define GC_USB_DIEPTSIZ6_PKTCNT_DEFAULT          0x0
#define GC_USB_DIEPTSIZ6_PKTCNT_OFFSET           0x9d0
#define GC_USB_DIEPTSIZ6_MC_LSB                  0x1d
#define GC_USB_DIEPTSIZ6_MC_MASK                 0x60000000
#define GC_USB_DIEPTSIZ6_MC_SIZE                 0x2
#define GC_USB_DIEPTSIZ6_MC_DEFAULT              0x0
#define GC_USB_DIEPTSIZ6_MC_OFFSET               0x9d0
#define GC_USB_DIEPDMA6_DMAADDR_LSB              0x0
#define GC_USB_DIEPDMA6_DMAADDR_MASK             0xffffffff
#define GC_USB_DIEPDMA6_DMAADDR_SIZE             0x20
#define GC_USB_DIEPDMA6_DMAADDR_DEFAULT          0x0
#define GC_USB_DIEPDMA6_DMAADDR_OFFSET           0x9d4
#define GC_USB_DTXFSTS6_INEPTXFSPCAVAIL_LSB      0x0
#define GC_USB_DTXFSTS6_INEPTXFSPCAVAIL_MASK     0xffff
#define GC_USB_DTXFSTS6_INEPTXFSPCAVAIL_SIZE     0x10
#define GC_USB_DTXFSTS6_INEPTXFSPCAVAIL_DEFAULT  0x0
#define GC_USB_DTXFSTS6_INEPTXFSPCAVAIL_OFFSET   0x9d8
#define GC_USB_DIEPDMAB6_DMABUFFERADDR_LSB       0x0
#define GC_USB_DIEPDMAB6_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DIEPDMAB6_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DIEPDMAB6_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DIEPDMAB6_DMABUFFERADDR_OFFSET    0x9dc
#define GC_USB_DIEPCTL7_MPS_LSB                  0x0
#define GC_USB_DIEPCTL7_MPS_MASK                 0x7ff
#define GC_USB_DIEPCTL7_MPS_SIZE                 0xb
#define GC_USB_DIEPCTL7_MPS_DEFAULT              0x0
#define GC_USB_DIEPCTL7_MPS_OFFSET               0x9e0
#define GC_USB_DIEPCTL7_USBACTEP_LSB             0xf
#define GC_USB_DIEPCTL7_USBACTEP_MASK            0x8000
#define GC_USB_DIEPCTL7_USBACTEP_SIZE            0x1
#define GC_USB_DIEPCTL7_USBACTEP_DEFAULT         0x0
#define GC_USB_DIEPCTL7_USBACTEP_OFFSET          0x9e0
#define GC_USB_DIEPCTL7_DPID_LSB                 0x10
#define GC_USB_DIEPCTL7_DPID_MASK                0x10000
#define GC_USB_DIEPCTL7_DPID_SIZE                0x1
#define GC_USB_DIEPCTL7_DPID_DEFAULT             0x0
#define GC_USB_DIEPCTL7_DPID_OFFSET              0x9e0
#define GC_USB_DIEPCTL7_NAKSTS_LSB               0x11
#define GC_USB_DIEPCTL7_NAKSTS_MASK              0x20000
#define GC_USB_DIEPCTL7_NAKSTS_SIZE              0x1
#define GC_USB_DIEPCTL7_NAKSTS_DEFAULT           0x0
#define GC_USB_DIEPCTL7_NAKSTS_OFFSET            0x9e0
#define GC_USB_DIEPCTL7_EPTYPE_LSB               0x12
#define GC_USB_DIEPCTL7_EPTYPE_MASK              0xc0000
#define GC_USB_DIEPCTL7_EPTYPE_SIZE              0x2
#define GC_USB_DIEPCTL7_EPTYPE_DEFAULT           0x0
#define GC_USB_DIEPCTL7_EPTYPE_OFFSET            0x9e0
#define GC_USB_DIEPCTL7_STALL_LSB                0x15
#define GC_USB_DIEPCTL7_STALL_MASK               0x200000
#define GC_USB_DIEPCTL7_STALL_SIZE               0x1
#define GC_USB_DIEPCTL7_STALL_DEFAULT            0x0
#define GC_USB_DIEPCTL7_STALL_OFFSET             0x9e0
#define GC_USB_DIEPCTL7_TXFNUM_LSB               0x16
#define GC_USB_DIEPCTL7_TXFNUM_MASK              0x3c00000
#define GC_USB_DIEPCTL7_TXFNUM_SIZE              0x4
#define GC_USB_DIEPCTL7_TXFNUM_DEFAULT           0x0
#define GC_USB_DIEPCTL7_TXFNUM_OFFSET            0x9e0
#define GC_USB_DIEPCTL7_CNAK_LSB                 0x1a
#define GC_USB_DIEPCTL7_CNAK_MASK                0x4000000
#define GC_USB_DIEPCTL7_CNAK_SIZE                0x1
#define GC_USB_DIEPCTL7_CNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL7_CNAK_OFFSET              0x9e0
#define GC_USB_DIEPCTL7_SNAK_LSB                 0x1b
#define GC_USB_DIEPCTL7_SNAK_MASK                0x8000000
#define GC_USB_DIEPCTL7_SNAK_SIZE                0x1
#define GC_USB_DIEPCTL7_SNAK_DEFAULT             0x0
#define GC_USB_DIEPCTL7_SNAK_OFFSET              0x9e0
#define GC_USB_DIEPCTL7_SETD0PID_LSB             0x1c
#define GC_USB_DIEPCTL7_SETD0PID_MASK            0x10000000
#define GC_USB_DIEPCTL7_SETD0PID_SIZE            0x1
#define GC_USB_DIEPCTL7_SETD0PID_DEFAULT         0x0
#define GC_USB_DIEPCTL7_SETD0PID_OFFSET          0x9e0
#define GC_USB_DIEPCTL7_SETD1PID_LSB             0x1d
#define GC_USB_DIEPCTL7_SETD1PID_MASK            0x20000000
#define GC_USB_DIEPCTL7_SETD1PID_SIZE            0x1
#define GC_USB_DIEPCTL7_SETD1PID_DEFAULT         0x0
#define GC_USB_DIEPCTL7_SETD1PID_OFFSET          0x9e0
#define GC_USB_DIEPCTL7_EPDIS_LSB                0x1e
#define GC_USB_DIEPCTL7_EPDIS_MASK               0x40000000
#define GC_USB_DIEPCTL7_EPDIS_SIZE               0x1
