jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
#define GC_USB_DIEPCTL10_USBACTEP_LSB            0xf
#define GC_USB_DIEPCTL10_USBACTEP_MASK           0x8000
#define GC_USB_DIEPCTL10_USBACTEP_SIZE           0x1
#define GC_USB_DIEPCTL10_USBACTEP_DEFAULT        0x0
#define GC_USB_DIEPCTL10_USBACTEP_OFFSET         0xa40
#define GC_USB_DIEPCTL10_DPID_LSB                0x10
#define GC_USB_DIEPCTL10_DPID_MASK               0x10000
#define GC_USB_DIEPCTL10_DPID_SIZE               0x1
#define GC_USB_DIEPCTL10_DPID_DEFAULT            0x0
#define GC_USB_DIEPCTL10_DPID_OFFSET             0xa40
#define GC_USB_DIEPCTL10_NAKSTS_LSB              0x11
#define GC_USB_DIEPCTL10_NAKSTS_MASK             0x20000
#define GC_USB_DIEPCTL10_NAKSTS_SIZE             0x1
#define GC_USB_DIEPCTL10_NAKSTS_DEFAULT          0x0
#define GC_USB_DIEPCTL10_NAKSTS_OFFSET           0xa40
#define GC_USB_DIEPCTL10_EPTYPE_LSB              0x12
#define GC_USB_DIEPCTL10_EPTYPE_MASK             0xc0000
#define GC_USB_DIEPCTL10_EPTYPE_SIZE             0x2
#define GC_USB_DIEPCTL10_EPTYPE_DEFAULT          0x0
#define GC_USB_DIEPCTL10_EPTYPE_OFFSET           0xa40
#define GC_USB_DIEPCTL10_STALL_LSB               0x15
#define GC_USB_DIEPCTL10_STALL_MASK              0x200000
#define GC_USB_DIEPCTL10_STALL_SIZE              0x1
#define GC_USB_DIEPCTL10_STALL_DEFAULT           0x0
#define GC_USB_DIEPCTL10_STALL_OFFSET            0xa40
#define GC_USB_DIEPCTL10_TXFNUM_LSB              0x16
#define GC_USB_DIEPCTL10_TXFNUM_MASK             0x3c00000
#define GC_USB_DIEPCTL10_TXFNUM_SIZE             0x4
#define GC_USB_DIEPCTL10_TXFNUM_DEFAULT          0x0
#define GC_USB_DIEPCTL10_TXFNUM_OFFSET           0xa40
#define GC_USB_DIEPCTL10_CNAK_LSB                0x1a
#define GC_USB_DIEPCTL10_CNAK_MASK               0x4000000
#define GC_USB_DIEPCTL10_CNAK_SIZE               0x1
#define GC_USB_DIEPCTL10_CNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL10_CNAK_OFFSET             0xa40
#define GC_USB_DIEPCTL10_SNAK_LSB                0x1b
#define GC_USB_DIEPCTL10_SNAK_MASK               0x8000000
#define GC_USB_DIEPCTL10_SNAK_SIZE               0x1
#define GC_USB_DIEPCTL10_SNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL10_SNAK_OFFSET             0xa40
#define GC_USB_DIEPCTL10_SETD0PID_LSB            0x1c
#define GC_USB_DIEPCTL10_SETD0PID_MASK           0x10000000
#define GC_USB_DIEPCTL10_SETD0PID_SIZE           0x1
#define GC_USB_DIEPCTL10_SETD0PID_DEFAULT        0x0
#define GC_USB_DIEPCTL10_SETD0PID_OFFSET         0xa40
#define GC_USB_DIEPCTL10_SETD1PID_LSB            0x1d
#define GC_USB_DIEPCTL10_SETD1PID_MASK           0x20000000
#define GC_USB_DIEPCTL10_SETD1PID_SIZE           0x1
#define GC_USB_DIEPCTL10_SETD1PID_DEFAULT        0x0
#define GC_USB_DIEPCTL10_SETD1PID_OFFSET         0xa40
#define GC_USB_DIEPCTL10_EPDIS_LSB               0x1e
#define GC_USB_DIEPCTL10_EPDIS_MASK              0x40000000
#define GC_USB_DIEPCTL10_EPDIS_SIZE              0x1
#define GC_USB_DIEPCTL10_EPDIS_DEFAULT           0x0
#define GC_USB_DIEPCTL10_EPDIS_OFFSET            0xa40
#define GC_USB_DIEPCTL10_EPENA_LSB               0x1f
#define GC_USB_DIEPCTL10_EPENA_MASK              0x80000000
#define GC_USB_DIEPCTL10_EPENA_SIZE              0x1
#define GC_USB_DIEPCTL10_EPENA_DEFAULT           0x0
#define GC_USB_DIEPCTL10_EPENA_OFFSET            0xa40
#define GC_USB_DIEPINT10_XFERCOMPL_LSB           0x0
#define GC_USB_DIEPINT10_XFERCOMPL_MASK          0x1
#define GC_USB_DIEPINT10_XFERCOMPL_SIZE          0x1
#define GC_USB_DIEPINT10_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DIEPINT10_XFERCOMPL_OFFSET        0xa48
#define GC_USB_DIEPINT10_EPDISBLD_LSB            0x1
#define GC_USB_DIEPINT10_EPDISBLD_MASK           0x2
#define GC_USB_DIEPINT10_EPDISBLD_SIZE           0x1
#define GC_USB_DIEPINT10_EPDISBLD_DEFAULT        0x0
#define GC_USB_DIEPINT10_EPDISBLD_OFFSET         0xa48
#define GC_USB_DIEPINT10_AHBERR_LSB              0x2
#define GC_USB_DIEPINT10_AHBERR_MASK             0x4
#define GC_USB_DIEPINT10_AHBERR_SIZE             0x1
#define GC_USB_DIEPINT10_AHBERR_DEFAULT          0x0
#define GC_USB_DIEPINT10_AHBERR_OFFSET           0xa48
#define GC_USB_DIEPINT10_TIMEOUT_LSB             0x3
#define GC_USB_DIEPINT10_TIMEOUT_MASK            0x8
#define GC_USB_DIEPINT10_TIMEOUT_SIZE            0x1
#define GC_USB_DIEPINT10_TIMEOUT_DEFAULT         0x0
#define GC_USB_DIEPINT10_TIMEOUT_OFFSET          0xa48
#define GC_USB_DIEPINT10_INTKNTXFEMP_LSB         0x4
#define GC_USB_DIEPINT10_INTKNTXFEMP_MASK        0x10
#define GC_USB_DIEPINT10_INTKNTXFEMP_SIZE        0x1
#define GC_USB_DIEPINT10_INTKNTXFEMP_DEFAULT     0x0
#define GC_USB_DIEPINT10_INTKNTXFEMP_OFFSET      0xa48
#define GC_USB_DIEPINT10_INTKNEPMIS_LSB          0x5
#define GC_USB_DIEPINT10_INTKNEPMIS_MASK         0x20
#define GC_USB_DIEPINT10_INTKNEPMIS_SIZE         0x1
#define GC_USB_DIEPINT10_INTKNEPMIS_DEFAULT      0x0
#define GC_USB_DIEPINT10_INTKNEPMIS_OFFSET       0xa48
#define GC_USB_DIEPINT10_INEPNAKEFF_LSB          0x6
#define GC_USB_DIEPINT10_INEPNAKEFF_MASK         0x40
#define GC_USB_DIEPINT10_INEPNAKEFF_SIZE         0x1
#define GC_USB_DIEPINT10_INEPNAKEFF_DEFAULT      0x0
#define GC_USB_DIEPINT10_INEPNAKEFF_OFFSET       0xa48
#define GC_USB_DIEPINT10_TXFEMP_LSB              0x7
#define GC_USB_DIEPINT10_TXFEMP_MASK             0x80
#define GC_USB_DIEPINT10_TXFEMP_SIZE             0x1
#define GC_USB_DIEPINT10_TXFEMP_DEFAULT          0x0
#define GC_USB_DIEPINT10_TXFEMP_OFFSET           0xa48
#define GC_USB_DIEPINT10_TXFIFOUNDRN_LSB         0x8
#define GC_USB_DIEPINT10_TXFIFOUNDRN_MASK        0x100
#define GC_USB_DIEPINT10_TXFIFOUNDRN_SIZE        0x1
#define GC_USB_DIEPINT10_TXFIFOUNDRN_DEFAULT     0x0
#define GC_USB_DIEPINT10_TXFIFOUNDRN_OFFSET      0xa48
#define GC_USB_DIEPINT10_BNAINTR_LSB             0x9
#define GC_USB_DIEPINT10_BNAINTR_MASK            0x200
#define GC_USB_DIEPINT10_BNAINTR_SIZE            0x1
#define GC_USB_DIEPINT10_BNAINTR_DEFAULT         0x0
#define GC_USB_DIEPINT10_BNAINTR_OFFSET          0xa48
#define GC_USB_DIEPINT10_PKTDRPSTS_LSB           0xb
#define GC_USB_DIEPINT10_PKTDRPSTS_MASK          0x800
#define GC_USB_DIEPINT10_PKTDRPSTS_SIZE          0x1
#define GC_USB_DIEPINT10_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DIEPINT10_PKTDRPSTS_OFFSET        0xa48
#define GC_USB_DIEPINT10_BBLEERR_LSB             0xc
#define GC_USB_DIEPINT10_BBLEERR_MASK            0x1000
#define GC_USB_DIEPINT10_BBLEERR_SIZE            0x1
#define GC_USB_DIEPINT10_BBLEERR_DEFAULT         0x0
#define GC_USB_DIEPINT10_BBLEERR_OFFSET          0xa48
#define GC_USB_DIEPINT10_NAKINTRPT_LSB           0xd
#define GC_USB_DIEPINT10_NAKINTRPT_MASK          0x2000
#define GC_USB_DIEPINT10_NAKINTRPT_SIZE          0x1
#define GC_USB_DIEPINT10_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT10_NAKINTRPT_OFFSET        0xa48
#define GC_USB_DIEPINT10_NYETINTRPT_LSB          0xe
#define GC_USB_DIEPINT10_NYETINTRPT_MASK         0x4000
#define GC_USB_DIEPINT10_NYETINTRPT_SIZE         0x1
#define GC_USB_DIEPINT10_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DIEPINT10_NYETINTRPT_OFFSET       0xa48
#define GC_USB_DIEPTSIZ10_XFERSIZE_LSB           0x0
#define GC_USB_DIEPTSIZ10_XFERSIZE_MASK          0x7ffff
#define GC_USB_DIEPTSIZ10_XFERSIZE_SIZE          0x13
#define GC_USB_DIEPTSIZ10_XFERSIZE_DEFAULT       0x0
#define GC_USB_DIEPTSIZ10_XFERSIZE_OFFSET        0xa50
#define GC_USB_DIEPTSIZ10_PKTCNT_LSB             0x13
#define GC_USB_DIEPTSIZ10_PKTCNT_MASK            0x1ff80000
#define GC_USB_DIEPTSIZ10_PKTCNT_SIZE            0xa
#define GC_USB_DIEPTSIZ10_PKTCNT_DEFAULT         0x0
#define GC_USB_DIEPTSIZ10_PKTCNT_OFFSET          0xa50
#define GC_USB_DIEPTSIZ10_MC_LSB                 0x1d
#define GC_USB_DIEPTSIZ10_MC_MASK                0x60000000
#define GC_USB_DIEPTSIZ10_MC_SIZE                0x2
#define GC_USB_DIEPTSIZ10_MC_DEFAULT             0x0
#define GC_USB_DIEPTSIZ10_MC_OFFSET              0xa50
#define GC_USB_DIEPDMA10_DMAADDR_LSB             0x0
#define GC_USB_DIEPDMA10_DMAADDR_MASK            0xffffffff
#define GC_USB_DIEPDMA10_DMAADDR_SIZE            0x20
#define GC_USB_DIEPDMA10_DMAADDR_DEFAULT         0x0
#define GC_USB_DIEPDMA10_DMAADDR_OFFSET          0xa54
#define GC_USB_DTXFSTS10_INEPTXFSPCAVAIL_LSB     0x0
#define GC_USB_DTXFSTS10_INEPTXFSPCAVAIL_MASK    0xffff
#define GC_USB_DTXFSTS10_INEPTXFSPCAVAIL_SIZE    0x10
#define GC_USB_DTXFSTS10_INEPTXFSPCAVAIL_DEFAULT 0x0
#define GC_USB_DTXFSTS10_INEPTXFSPCAVAIL_OFFSET  0xa58
#define GC_USB_DIEPDMAB10_DMABUFFERADDR_LSB      0x0
#define GC_USB_DIEPDMAB10_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DIEPDMAB10_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DIEPDMAB10_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DIEPDMAB10_DMABUFFERADDR_OFFSET   0xa5c
#define GC_USB_DIEPCTL11_MPS_LSB                 0x0
#define GC_USB_DIEPCTL11_MPS_MASK                0x7ff
#define GC_USB_DIEPCTL11_MPS_SIZE                0xb
#define GC_USB_DIEPCTL11_MPS_DEFAULT             0x0
#define GC_USB_DIEPCTL11_MPS_OFFSET              0xa60
#define GC_USB_DIEPCTL11_USBACTEP_LSB            0xf
#define GC_USB_DIEPCTL11_USBACTEP_MASK           0x8000
#define GC_USB_DIEPCTL11_USBACTEP_SIZE           0x1
#define GC_USB_DIEPCTL11_USBACTEP_DEFAULT        0x0
#define GC_USB_DIEPCTL11_USBACTEP_OFFSET         0xa60
#define GC_USB_DIEPCTL11_DPID_LSB                0x10
#define GC_USB_DIEPCTL11_DPID_MASK               0x10000
#define GC_USB_DIEPCTL11_DPID_SIZE               0x1
#define GC_USB_DIEPCTL11_DPID_DEFAULT            0x0
#define GC_USB_DIEPCTL11_DPID_OFFSET             0xa60
#define GC_USB_DIEPCTL11_NAKSTS_LSB              0x11
#define GC_USB_DIEPCTL11_NAKSTS_MASK             0x20000
#define GC_USB_DIEPCTL11_NAKSTS_SIZE             0x1
#define GC_USB_DIEPCTL11_NAKSTS_DEFAULT          0x0
#define GC_USB_DIEPCTL11_NAKSTS_OFFSET           0xa60
#define GC_USB_DIEPCTL11_EPTYPE_LSB              0x12
#define GC_USB_DIEPCTL11_EPTYPE_MASK             0xc0000
#define GC_USB_DIEPCTL11_EPTYPE_SIZE             0x2
#define GC_USB_DIEPCTL11_EPTYPE_DEFAULT          0x0
#define GC_USB_DIEPCTL11_EPTYPE_OFFSET           0xa60
#define GC_USB_DIEPCTL11_STALL_LSB               0x15
#define GC_USB_DIEPCTL11_STALL_MASK              0x200000
#define GC_USB_DIEPCTL11_STALL_SIZE              0x1
#define GC_USB_DIEPCTL11_STALL_DEFAULT           0x0
#define GC_USB_DIEPCTL11_STALL_OFFSET            0xa60
#define GC_USB_DIEPCTL11_TXFNUM_LSB              0x16
#define GC_USB_DIEPCTL11_TXFNUM_MASK             0x3c00000
#define GC_USB_DIEPCTL11_TXFNUM_SIZE             0x4
#define GC_USB_DIEPCTL11_TXFNUM_DEFAULT          0x0
#define GC_USB_DIEPCTL11_TXFNUM_OFFSET           0xa60
#define GC_USB_DIEPCTL11_CNAK_LSB                0x1a
#define GC_USB_DIEPCTL11_CNAK_MASK               0x4000000
#define GC_USB_DIEPCTL11_CNAK_SIZE               0x1
#define GC_USB_DIEPCTL11_CNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL11_CNAK_OFFSET             0xa60
#define GC_USB_DIEPCTL11_SNAK_LSB                0x1b
#define GC_USB_DIEPCTL11_SNAK_MASK               0x8000000
#define GC_USB_DIEPCTL11_SNAK_SIZE               0x1
#define GC_USB_DIEPCTL11_SNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL11_SNAK_OFFSET             0xa60
#define GC_USB_DIEPCTL11_SETD0PID_LSB            0x1c
#define GC_USB_DIEPCTL11_SETD0PID_MASK           0x10000000
#define GC_USB_DIEPCTL11_SETD0PID_SIZE           0x1
#define GC_USB_DIEPCTL11_SETD0PID_DEFAULT        0x0
#define GC_USB_DIEPCTL11_SETD0PID_OFFSET         0xa60
#define GC_USB_DIEPCTL11_SETD1PID_LSB            0x1d
#define GC_USB_DIEPCTL11_SETD1PID_MASK           0x20000000
#define GC_USB_DIEPCTL11_SETD1PID_SIZE           0x1
#define GC_USB_DIEPCTL11_SETD1PID_DEFAULT        0x0
#define GC_USB_DIEPCTL11_SETD1PID_OFFSET         0xa60
#define GC_USB_DIEPCTL11_EPDIS_LSB               0x1e
#define GC_USB_DIEPCTL11_EPDIS_MASK              0x40000000
#define GC_USB_DIEPCTL11_EPDIS_SIZE              0x1
#define GC_USB_DIEPCTL11_EPDIS_DEFAULT           0x0
#define GC_USB_DIEPCTL11_EPDIS_OFFSET            0xa60
#define GC_USB_DIEPCTL11_EPENA_LSB               0x1f
#define GC_USB_DIEPCTL11_EPENA_MASK              0x80000000
#define GC_USB_DIEPCTL11_EPENA_SIZE              0x1
#define GC_USB_DIEPCTL11_EPENA_DEFAULT           0x0
#define GC_USB_DIEPCTL11_EPENA_OFFSET            0xa60
#define GC_USB_DIEPINT11_XFERCOMPL_LSB           0x0
#define GC_USB_DIEPINT11_XFERCOMPL_MASK          0x1
#define GC_USB_DIEPINT11_XFERCOMPL_SIZE          0x1
#define GC_USB_DIEPINT11_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DIEPINT11_XFERCOMPL_OFFSET        0xa68
#define GC_USB_DIEPINT11_EPDISBLD_LSB            0x1
#define GC_USB_DIEPINT11_EPDISBLD_MASK           0x2
#define GC_USB_DIEPINT11_EPDISBLD_SIZE           0x1
#define GC_USB_DIEPINT11_EPDISBLD_DEFAULT        0x0
#define GC_USB_DIEPINT11_EPDISBLD_OFFSET         0xa68
#define GC_USB_DIEPINT11_AHBERR_LSB              0x2
#define GC_USB_DIEPINT11_AHBERR_MASK             0x4
#define GC_USB_DIEPINT11_AHBERR_SIZE             0x1
#define GC_USB_DIEPINT11_AHBERR_DEFAULT          0x0
#define GC_USB_DIEPINT11_AHBERR_OFFSET           0xa68
#define GC_USB_DIEPINT11_TIMEOUT_LSB             0x3
#define GC_USB_DIEPINT11_TIMEOUT_MASK            0x8
#define GC_USB_DIEPINT11_TIMEOUT_SIZE            0x1
#define GC_USB_DIEPINT11_TIMEOUT_DEFAULT         0x0
#define GC_USB_DIEPINT11_TIMEOUT_OFFSET          0xa68
#define GC_USB_DIEPINT11_INTKNTXFEMP_LSB         0x4
#define GC_USB_DIEPINT11_INTKNTXFEMP_MASK        0x10
#define GC_USB_DIEPINT11_INTKNTXFEMP_SIZE        0x1
#define GC_USB_DIEPINT11_INTKNTXFEMP_DEFAULT     0x0
#define GC_USB_DIEPINT11_INTKNTXFEMP_OFFSET      0xa68
#define GC_USB_DIEPINT11_INTKNEPMIS_LSB          0x5
#define GC_USB_DIEPINT11_INTKNEPMIS_MASK         0x20
#define GC_USB_DIEPINT11_INTKNEPMIS_SIZE         0x1
#define GC_USB_DIEPINT11_INTKNEPMIS_DEFAULT      0x0
#define GC_USB_DIEPINT11_INTKNEPMIS_OFFSET       0xa68
#define GC_USB_DIEPINT11_INEPNAKEFF_LSB          0x6
#define GC_USB_DIEPINT11_INEPNAKEFF_MASK         0x40
#define GC_USB_DIEPINT11_INEPNAKEFF_SIZE         0x1
#define GC_USB_DIEPINT11_INEPNAKEFF_DEFAULT      0x0
#define GC_USB_DIEPINT11_INEPNAKEFF_OFFSET       0xa68
#define GC_USB_DIEPINT11_TXFEMP_LSB              0x7
#define GC_USB_DIEPINT11_TXFEMP_MASK             0x80
#define GC_USB_DIEPINT11_TXFEMP_SIZE             0x1
#define GC_USB_DIEPINT11_TXFEMP_DEFAULT          0x0
#define GC_USB_DIEPINT11_TXFEMP_OFFSET           0xa68
#define GC_USB_DIEPINT11_TXFIFOUNDRN_LSB         0x8
#define GC_USB_DIEPINT11_TXFIFOUNDRN_MASK        0x100
#define GC_USB_DIEPINT11_TXFIFOUNDRN_SIZE        0x1
#define GC_USB_DIEPINT11_TXFIFOUNDRN_DEFAULT     0x0
#define GC_USB_DIEPINT11_TXFIFOUNDRN_OFFSET      0xa68
#define GC_USB_DIEPINT11_BNAINTR_LSB             0x9
#define GC_USB_DIEPINT11_BNAINTR_MASK            0x200
#define GC_USB_DIEPINT11_BNAINTR_SIZE            0x1
#define GC_USB_DIEPINT11_BNAINTR_DEFAULT         0x0
#define GC_USB_DIEPINT11_BNAINTR_OFFSET          0xa68
#define GC_USB_DIEPINT11_PKTDRPSTS_LSB           0xb
#define GC_USB_DIEPINT11_PKTDRPSTS_MASK          0x800
#define GC_USB_DIEPINT11_PKTDRPSTS_SIZE          0x1
#define GC_USB_DIEPINT11_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DIEPINT11_PKTDRPSTS_OFFSET        0xa68
#define GC_USB_DIEPINT11_BBLEERR_LSB             0xc
#define GC_USB_DIEPINT11_BBLEERR_MASK            0x1000
#define GC_USB_DIEPINT11_BBLEERR_SIZE            0x1
#define GC_USB_DIEPINT11_BBLEERR_DEFAULT         0x0
#define GC_USB_DIEPINT11_BBLEERR_OFFSET          0xa68
#define GC_USB_DIEPINT11_NAKINTRPT_LSB           0xd
#define GC_USB_DIEPINT11_NAKINTRPT_MASK          0x2000
#define GC_USB_DIEPINT11_NAKINTRPT_SIZE          0x1
#define GC_USB_DIEPINT11_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT11_NAKINTRPT_OFFSET        0xa68
#define GC_USB_DIEPINT11_NYETINTRPT_LSB          0xe
#define GC_USB_DIEPINT11_NYETINTRPT_MASK         0x4000
#define GC_USB_DIEPINT11_NYETINTRPT_SIZE         0x1
#define GC_USB_DIEPINT11_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DIEPINT11_NYETINTRPT_OFFSET       0xa68
#define GC_USB_DIEPTSIZ11_XFERSIZE_LSB           0x0
#define GC_USB_DIEPTSIZ11_XFERSIZE_MASK          0x7ffff
#define GC_USB_DIEPTSIZ11_XFERSIZE_SIZE          0x13
#define GC_USB_DIEPTSIZ11_XFERSIZE_DEFAULT       0x0
#define GC_USB_DIEPTSIZ11_XFERSIZE_OFFSET        0xa70
#define GC_USB_DIEPTSIZ11_PKTCNT_LSB             0x13
#define GC_USB_DIEPTSIZ11_PKTCNT_MASK            0x1ff80000
#define GC_USB_DIEPTSIZ11_PKTCNT_SIZE            0xa
#define GC_USB_DIEPTSIZ11_PKTCNT_DEFAULT         0x0
#define GC_USB_DIEPTSIZ11_PKTCNT_OFFSET          0xa70
#define GC_USB_DIEPTSIZ11_MC_LSB                 0x1d
#define GC_USB_DIEPTSIZ11_MC_MASK                0x60000000
#define GC_USB_DIEPTSIZ11_MC_SIZE                0x2
#define GC_USB_DIEPTSIZ11_MC_DEFAULT             0x0
#define GC_USB_DIEPTSIZ11_MC_OFFSET              0xa70
#define GC_USB_DIEPDMA11_DMAADDR_LSB             0x0
#define GC_USB_DIEPDMA11_DMAADDR_MASK            0xffffffff
#define GC_USB_DIEPDMA11_DMAADDR_SIZE            0x20
#define GC_USB_DIEPDMA11_DMAADDR_DEFAULT         0x0
#define GC_USB_DIEPDMA11_DMAADDR_OFFSET          0xa74
#define GC_USB_DTXFSTS11_INEPTXFSPCAVAIL_LSB     0x0
#define GC_USB_DTXFSTS11_INEPTXFSPCAVAIL_MASK    0xffff
#define GC_USB_DTXFSTS11_INEPTXFSPCAVAIL_SIZE    0x10
#define GC_USB_DTXFSTS11_INEPTXFSPCAVAIL_DEFAULT 0x0
#define GC_USB_DTXFSTS11_INEPTXFSPCAVAIL_OFFSET  0xa78
#define GC_USB_DIEPDMAB11_DMABUFFERADDR_LSB      0x0
#define GC_USB_DIEPDMAB11_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DIEPDMAB11_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DIEPDMAB11_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DIEPDMAB11_DMABUFFERADDR_OFFSET   0xa7c
#define GC_USB_DIEPCTL12_MPS_LSB                 0x0
#define GC_USB_DIEPCTL12_MPS_MASK                0x7ff
#define GC_USB_DIEPCTL12_MPS_SIZE                0xb
#define GC_USB_DIEPCTL12_MPS_DEFAULT             0x0
#define GC_USB_DIEPCTL12_MPS_OFFSET              0xa80
#define GC_USB_DIEPCTL12_USBACTEP_LSB            0xf
#define GC_USB_DIEPCTL12_USBACTEP_MASK           0x8000
#define GC_USB_DIEPCTL12_USBACTEP_SIZE           0x1
#define GC_USB_DIEPCTL12_USBACTEP_DEFAULT        0x0
#define GC_USB_DIEPCTL12_USBACTEP_OFFSET         0xa80
#define GC_USB_DIEPCTL12_DPID_LSB                0x10
#define GC_USB_DIEPCTL12_DPID_MASK               0x10000
#define GC_USB_DIEPCTL12_DPID_SIZE               0x1
#define GC_USB_DIEPCTL12_DPID_DEFAULT            0x0
#define GC_USB_DIEPCTL12_DPID_OFFSET             0xa80
#define GC_USB_DIEPCTL12_NAKSTS_LSB              0x11
#define GC_USB_DIEPCTL12_NAKSTS_MASK             0x20000
#define GC_USB_DIEPCTL12_NAKSTS_SIZE             0x1
#define GC_USB_DIEPCTL12_NAKSTS_DEFAULT          0x0
#define GC_USB_DIEPCTL12_NAKSTS_OFFSET           0xa80
#define GC_USB_DIEPCTL12_EPTYPE_LSB              0x12
#define GC_USB_DIEPCTL12_EPTYPE_MASK             0xc0000
#define GC_USB_DIEPCTL12_EPTYPE_SIZE             0x2
#define GC_USB_DIEPCTL12_EPTYPE_DEFAULT          0x0
#define GC_USB_DIEPCTL12_EPTYPE_OFFSET           0xa80
#define GC_USB_DIEPCTL12_STALL_LSB               0x15
#define GC_USB_DIEPCTL12_STALL_MASK              0x200000
#define GC_USB_DIEPCTL12_STALL_SIZE              0x1
#define GC_USB_DIEPCTL12_STALL_DEFAULT           0x0
#define GC_USB_DIEPCTL12_STALL_OFFSET            0xa80
#define GC_USB_DIEPCTL12_TXFNUM_LSB              0x16
#define GC_USB_DIEPCTL12_TXFNUM_MASK             0x3c00000
#define GC_USB_DIEPCTL12_TXFNUM_SIZE             0x4
#define GC_USB_DIEPCTL12_TXFNUM_DEFAULT          0x0
#define GC_USB_DIEPCTL12_TXFNUM_OFFSET           0xa80
#define GC_USB_DIEPCTL12_CNAK_LSB                0x1a
#define GC_USB_DIEPCTL12_CNAK_MASK               0x4000000
#define GC_USB_DIEPCTL12_CNAK_SIZE               0x1
#define GC_USB_DIEPCTL12_CNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL12_CNAK_OFFSET             0xa80
#define GC_USB_DIEPCTL12_SNAK_LSB                0x1b
#define GC_USB_DIEPCTL12_SNAK_MASK               0x8000000
#define GC_USB_DIEPCTL12_SNAK_SIZE               0x1
#define GC_USB_DIEPCTL12_SNAK_DEFAULT            0x0
#define GC_USB_DIEPCTL12_SNAK_OFFSET             0xa80
#define GC_USB_DIEPCTL12_SETD0PID_LSB            0x1c
#define GC_USB_DIEPCTL12_SETD0PID_MASK           0x10000000
#define GC_USB_DIEPCTL12_SETD0PID_SIZE           0x1
#define GC_USB_DIEPCTL12_SETD0PID_DEFAULT        0x0
#define GC_USB_DIEPCTL12_SETD0PID_OFFSET         0xa80
#define GC_USB_DIEPCTL12_SETD1PID_LSB            0x1d
#define GC_USB_DIEPCTL12_SETD1PID_MASK           0x20000000
#define GC_USB_DIEPCTL12_SETD1PID_SIZE           0x1
#define GC_USB_DIEPCTL12_SETD1PID_DEFAULT        0x0
#define GC_USB_DIEPCTL12_SETD1PID_OFFSET         0xa80
#define GC_USB_DIEPCTL12_EPDIS_LSB               0x1e
#define GC_USB_DIEPCTL12_EPDIS_MASK              0x40000000
#define GC_USB_DIEPCTL12_EPDIS_SIZE              0x1
#define GC_USB_DIEPCTL12_EPDIS_DEFAULT           0x0
#define GC_USB_DIEPCTL12_EPDIS_OFFSET            0xa80
#define GC_USB_DIEPCTL12_EPENA_LSB               0x1f
#define GC_USB_DIEPCTL12_EPENA_MASK              0x80000000
#define GC_USB_DIEPCTL12_EPENA_SIZE              0x1
#define GC_USB_DIEPCTL12_EPENA_DEFAULT           0x0
#define GC_USB_DIEPCTL12_EPENA_OFFSET            0xa80
#define GC_USB_DIEPINT12_XFERCOMPL_LSB           0x0
#define GC_USB_DIEPINT12_XFERCOMPL_MASK          0x1
#define GC_USB_DIEPINT12_XFERCOMPL_SIZE          0x1
#define GC_USB_DIEPINT12_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DIEPINT12_XFERCOMPL_OFFSET        0xa88
#define GC_USB_DIEPINT12_EPDISBLD_LSB            0x1
#define GC_USB_DIEPINT12_EPDISBLD_MASK           0x2
#define GC_USB_DIEPINT12_EPDISBLD_SIZE           0x1
#define GC_USB_DIEPINT12_EPDISBLD_DEFAULT        0x0
#define GC_USB_DIEPINT12_EPDISBLD_OFFSET         0xa88
#define GC_USB_DIEPINT12_AHBERR_LSB              0x2
#define GC_USB_DIEPINT12_AHBERR_MASK             0x4
#define GC_USB_DIEPINT12_AHBERR_SIZE             0x1
#define GC_USB_DIEPINT12_AHBERR_DEFAULT          0x0
#define GC_USB_DIEPINT12_AHBERR_OFFSET           0xa88
#define GC_USB_DIEPINT12_TIMEOUT_LSB             0x3
#define GC_USB_DIEPINT12_TIMEOUT_MASK            0x8
#define GC_USB_DIEPINT12_TIMEOUT_SIZE            0x1
#define GC_USB_DIEPINT12_TIMEOUT_DEFAULT         0x0
#define GC_USB_DIEPINT12_TIMEOUT_OFFSET          0xa88
#define GC_USB_DIEPINT12_INTKNTXFEMP_LSB         0x4
#define GC_USB_DIEPINT12_INTKNTXFEMP_MASK        0x10
#define GC_USB_DIEPINT12_INTKNTXFEMP_SIZE        0x1
#define GC_USB_DIEPINT12_INTKNTXFEMP_DEFAULT     0x0
#define GC_USB_DIEPINT12_INTKNTXFEMP_OFFSET      0xa88
#define GC_USB_DIEPINT12_INTKNEPMIS_LSB          0x5
#define GC_USB_DIEPINT12_INTKNEPMIS_MASK         0x20
#define GC_USB_DIEPINT12_INTKNEPMIS_SIZE         0x1
#define GC_USB_DIEPINT12_INTKNEPMIS_DEFAULT      0x0
#define GC_USB_DIEPINT12_INTKNEPMIS_OFFSET       0xa88
#define GC_USB_DIEPINT12_INEPNAKEFF_LSB          0x6
#define GC_USB_DIEPINT12_INEPNAKEFF_MASK         0x40
#define GC_USB_DIEPINT12_INEPNAKEFF_SIZE         0x1
#define GC_USB_DIEPINT12_INEPNAKEFF_DEFAULT      0x0
#define GC_USB_DIEPINT12_INEPNAKEFF_OFFSET       0xa88
#define GC_USB_DIEPINT12_TXFEMP_LSB              0x7
#define GC_USB_DIEPINT12_TXFEMP_MASK             0x80
#define GC_USB_DIEPINT12_TXFEMP_SIZE             0x1
#define GC_USB_DIEPINT12_TXFEMP_DEFAULT          0x0
#define GC_USB_DIEPINT12_TXFEMP_OFFSET           0xa88
#define GC_USB_DIEPINT12_TXFIFOUNDRN_LSB         0x8
#define GC_USB_DIEPINT12_TXFIFOUNDRN_MASK        0x100
#define GC_USB_DIEPINT12_TXFIFOUNDRN_SIZE        0x1
#define GC_USB_DIEPINT12_TXFIFOUNDRN_DEFAULT     0x0
#define GC_USB_DIEPINT12_TXFIFOUNDRN_OFFSET      0xa88
#define GC_USB_DIEPINT12_BNAINTR_LSB             0x9
#define GC_USB_DIEPINT12_BNAINTR_MASK            0x200
#define GC_USB_DIEPINT12_BNAINTR_SIZE            0x1
#define GC_USB_DIEPINT12_BNAINTR_DEFAULT         0x0
#define GC_USB_DIEPINT12_BNAINTR_OFFSET          0xa88
#define GC_USB_DIEPINT12_PKTDRPSTS_LSB           0xb
#define GC_USB_DIEPINT12_PKTDRPSTS_MASK          0x800
