jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
#define GC_USB_DIEPCTL15_EPENA_DEFAULT           0x0
#define GC_USB_DIEPCTL15_EPENA_OFFSET            0xae0
#define GC_USB_DIEPINT15_XFERCOMPL_LSB           0x0
#define GC_USB_DIEPINT15_XFERCOMPL_MASK          0x1
#define GC_USB_DIEPINT15_XFERCOMPL_SIZE          0x1
#define GC_USB_DIEPINT15_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DIEPINT15_XFERCOMPL_OFFSET        0xae8
#define GC_USB_DIEPINT15_EPDISBLD_LSB            0x1
#define GC_USB_DIEPINT15_EPDISBLD_MASK           0x2
#define GC_USB_DIEPINT15_EPDISBLD_SIZE           0x1
#define GC_USB_DIEPINT15_EPDISBLD_DEFAULT        0x0
#define GC_USB_DIEPINT15_EPDISBLD_OFFSET         0xae8
#define GC_USB_DIEPINT15_AHBERR_LSB              0x2
#define GC_USB_DIEPINT15_AHBERR_MASK             0x4
#define GC_USB_DIEPINT15_AHBERR_SIZE             0x1
#define GC_USB_DIEPINT15_AHBERR_DEFAULT          0x0
#define GC_USB_DIEPINT15_AHBERR_OFFSET           0xae8
#define GC_USB_DIEPINT15_TIMEOUT_LSB             0x3
#define GC_USB_DIEPINT15_TIMEOUT_MASK            0x8
#define GC_USB_DIEPINT15_TIMEOUT_SIZE            0x1
#define GC_USB_DIEPINT15_TIMEOUT_DEFAULT         0x0
#define GC_USB_DIEPINT15_TIMEOUT_OFFSET          0xae8
#define GC_USB_DIEPINT15_INTKNTXFEMP_LSB         0x4
#define GC_USB_DIEPINT15_INTKNTXFEMP_MASK        0x10
#define GC_USB_DIEPINT15_INTKNTXFEMP_SIZE        0x1
#define GC_USB_DIEPINT15_INTKNTXFEMP_DEFAULT     0x0
#define GC_USB_DIEPINT15_INTKNTXFEMP_OFFSET      0xae8
#define GC_USB_DIEPINT15_INTKNEPMIS_LSB          0x5
#define GC_USB_DIEPINT15_INTKNEPMIS_MASK         0x20
#define GC_USB_DIEPINT15_INTKNEPMIS_SIZE         0x1
#define GC_USB_DIEPINT15_INTKNEPMIS_DEFAULT      0x0
#define GC_USB_DIEPINT15_INTKNEPMIS_OFFSET       0xae8
#define GC_USB_DIEPINT15_INEPNAKEFF_LSB          0x6
#define GC_USB_DIEPINT15_INEPNAKEFF_MASK         0x40
#define GC_USB_DIEPINT15_INEPNAKEFF_SIZE         0x1
#define GC_USB_DIEPINT15_INEPNAKEFF_DEFAULT      0x0
#define GC_USB_DIEPINT15_INEPNAKEFF_OFFSET       0xae8
#define GC_USB_DIEPINT15_TXFEMP_LSB              0x7
#define GC_USB_DIEPINT15_TXFEMP_MASK             0x80
#define GC_USB_DIEPINT15_TXFEMP_SIZE             0x1
#define GC_USB_DIEPINT15_TXFEMP_DEFAULT          0x0
#define GC_USB_DIEPINT15_TXFEMP_OFFSET           0xae8
#define GC_USB_DIEPINT15_TXFIFOUNDRN_LSB         0x8
#define GC_USB_DIEPINT15_TXFIFOUNDRN_MASK        0x100
#define GC_USB_DIEPINT15_TXFIFOUNDRN_SIZE        0x1
#define GC_USB_DIEPINT15_TXFIFOUNDRN_DEFAULT     0x0
#define GC_USB_DIEPINT15_TXFIFOUNDRN_OFFSET      0xae8
#define GC_USB_DIEPINT15_BNAINTR_LSB             0x9
#define GC_USB_DIEPINT15_BNAINTR_MASK            0x200
#define GC_USB_DIEPINT15_BNAINTR_SIZE            0x1
#define GC_USB_DIEPINT15_BNAINTR_DEFAULT         0x0
#define GC_USB_DIEPINT15_BNAINTR_OFFSET          0xae8
#define GC_USB_DIEPINT15_PKTDRPSTS_LSB           0xb
#define GC_USB_DIEPINT15_PKTDRPSTS_MASK          0x800
#define GC_USB_DIEPINT15_PKTDRPSTS_SIZE          0x1
#define GC_USB_DIEPINT15_PKTDRPSTS_DEFAULT       0x0
#define GC_USB_DIEPINT15_PKTDRPSTS_OFFSET        0xae8
#define GC_USB_DIEPINT15_BBLEERR_LSB             0xc
#define GC_USB_DIEPINT15_BBLEERR_MASK            0x1000
#define GC_USB_DIEPINT15_BBLEERR_SIZE            0x1
#define GC_USB_DIEPINT15_BBLEERR_DEFAULT         0x0
#define GC_USB_DIEPINT15_BBLEERR_OFFSET          0xae8
#define GC_USB_DIEPINT15_NAKINTRPT_LSB           0xd
#define GC_USB_DIEPINT15_NAKINTRPT_MASK          0x2000
#define GC_USB_DIEPINT15_NAKINTRPT_SIZE          0x1
#define GC_USB_DIEPINT15_NAKINTRPT_DEFAULT       0x0
#define GC_USB_DIEPINT15_NAKINTRPT_OFFSET        0xae8
#define GC_USB_DIEPINT15_NYETINTRPT_LSB          0xe
#define GC_USB_DIEPINT15_NYETINTRPT_MASK         0x4000
#define GC_USB_DIEPINT15_NYETINTRPT_SIZE         0x1
#define GC_USB_DIEPINT15_NYETINTRPT_DEFAULT      0x0
#define GC_USB_DIEPINT15_NYETINTRPT_OFFSET       0xae8
#define GC_USB_DIEPTSIZ15_XFERSIZE_LSB           0x0
#define GC_USB_DIEPTSIZ15_XFERSIZE_MASK          0x7ffff
#define GC_USB_DIEPTSIZ15_XFERSIZE_SIZE          0x13
#define GC_USB_DIEPTSIZ15_XFERSIZE_DEFAULT       0x0
#define GC_USB_DIEPTSIZ15_XFERSIZE_OFFSET        0xaf0
#define GC_USB_DIEPTSIZ15_PKTCNT_LSB             0x13
#define GC_USB_DIEPTSIZ15_PKTCNT_MASK            0x1ff80000
#define GC_USB_DIEPTSIZ15_PKTCNT_SIZE            0xa
#define GC_USB_DIEPTSIZ15_PKTCNT_DEFAULT         0x0
#define GC_USB_DIEPTSIZ15_PKTCNT_OFFSET          0xaf0
#define GC_USB_DIEPTSIZ15_MC_LSB                 0x1d
#define GC_USB_DIEPTSIZ15_MC_MASK                0x60000000
#define GC_USB_DIEPTSIZ15_MC_SIZE                0x2
#define GC_USB_DIEPTSIZ15_MC_DEFAULT             0x0
#define GC_USB_DIEPTSIZ15_MC_OFFSET              0xaf0
#define GC_USB_DIEPDMA15_DMAADDR_LSB             0x0
#define GC_USB_DIEPDMA15_DMAADDR_MASK            0xffffffff
#define GC_USB_DIEPDMA15_DMAADDR_SIZE            0x20
#define GC_USB_DIEPDMA15_DMAADDR_DEFAULT         0x0
#define GC_USB_DIEPDMA15_DMAADDR_OFFSET          0xaf4
#define GC_USB_DTXFSTS15_INEPTXFSPCAVAIL_LSB     0x0
#define GC_USB_DTXFSTS15_INEPTXFSPCAVAIL_MASK    0xffff
#define GC_USB_DTXFSTS15_INEPTXFSPCAVAIL_SIZE    0x10
#define GC_USB_DTXFSTS15_INEPTXFSPCAVAIL_DEFAULT 0x0
#define GC_USB_DTXFSTS15_INEPTXFSPCAVAIL_OFFSET  0xaf8
#define GC_USB_DIEPDMAB15_DMABUFFERADDR_LSB      0x0
#define GC_USB_DIEPDMAB15_DMABUFFERADDR_MASK     0xffffffff
#define GC_USB_DIEPDMAB15_DMABUFFERADDR_SIZE     0x20
#define GC_USB_DIEPDMAB15_DMABUFFERADDR_DEFAULT  0x0
#define GC_USB_DIEPDMAB15_DMABUFFERADDR_OFFSET   0xafc
#define GC_USB_DOEPCTL0_MPS_LSB                  0x0
#define GC_USB_DOEPCTL0_MPS_MASK                 0x3
#define GC_USB_DOEPCTL0_MPS_SIZE                 0x2
#define GC_USB_DOEPCTL0_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL0_MPS_OFFSET               0xb00
#define GC_USB_DOEPCTL0_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL0_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL0_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL0_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL0_USBACTEP_OFFSET          0xb00
#define GC_USB_DOEPCTL0_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL0_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL0_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL0_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL0_NAKSTS_OFFSET            0xb00
#define GC_USB_DOEPCTL0_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL0_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL0_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL0_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL0_EPTYPE_OFFSET            0xb00
#define GC_USB_DOEPCTL0_SNP_LSB                  0x14
#define GC_USB_DOEPCTL0_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL0_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL0_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL0_SNP_OFFSET               0xb00
#define GC_USB_DOEPCTL0_STALL_LSB                0x15
#define GC_USB_DOEPCTL0_STALL_MASK               0x200000
#define GC_USB_DOEPCTL0_STALL_SIZE               0x1
#define GC_USB_DOEPCTL0_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL0_STALL_OFFSET             0xb00
#define GC_USB_DOEPCTL0_CNAK_LSB                 0x1a
#define GC_USB_DOEPCTL0_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL0_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL0_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL0_CNAK_OFFSET              0xb00
#define GC_USB_DOEPCTL0_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL0_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL0_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL0_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL0_SNAK_OFFSET              0xb00
#define GC_USB_DOEPCTL0_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL0_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL0_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL0_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL0_EPDIS_OFFSET             0xb00
#define GC_USB_DOEPCTL0_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL0_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL0_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL0_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL0_EPENA_OFFSET             0xb00
#define GC_USB_DOEPINT0_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT0_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT0_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT0_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT0_XFERCOMPL_OFFSET         0xb08
#define GC_USB_DOEPINT0_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT0_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT0_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT0_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT0_EPDISBLD_OFFSET          0xb08
#define GC_USB_DOEPINT0_AHBERR_LSB               0x2
#define GC_USB_DOEPINT0_AHBERR_MASK              0x4
#define GC_USB_DOEPINT0_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT0_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT0_AHBERR_OFFSET            0xb08
#define GC_USB_DOEPINT0_SETUP_LSB                0x3
#define GC_USB_DOEPINT0_SETUP_MASK               0x8
#define GC_USB_DOEPINT0_SETUP_SIZE               0x1
#define GC_USB_DOEPINT0_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT0_SETUP_OFFSET             0xb08
#define GC_USB_DOEPINT0_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT0_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT0_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT0_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT0_OUTTKNEPDIS_OFFSET       0xb08
#define GC_USB_DOEPINT0_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT0_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT0_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT0_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT0_STSPHSERCVD_OFFSET       0xb08
#define GC_USB_DOEPINT0_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT0_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT0_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT0_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT0_BACK2BACKSETUP_OFFSET    0xb08
#define GC_USB_DOEPINT0_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT0_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT0_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT0_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT0_OUTPKTERR_OFFSET         0xb08
#define GC_USB_DOEPINT0_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT0_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT0_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT0_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT0_BNAINTR_OFFSET           0xb08
#define GC_USB_DOEPINT0_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT0_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT0_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT0_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT0_PKTDRPSTS_OFFSET         0xb08
#define GC_USB_DOEPINT0_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT0_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT0_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT0_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT0_BBLEERR_OFFSET           0xb08
#define GC_USB_DOEPINT0_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT0_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT0_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT0_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT0_NAKINTRPT_OFFSET         0xb08
#define GC_USB_DOEPINT0_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT0_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT0_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT0_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT0_NYETINTRPT_OFFSET        0xb08
#define GC_USB_DOEPINT0_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT0_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT0_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT0_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT0_STUPPKTRCVD_OFFSET       0xb08
#define GC_USB_DOEPTSIZ0_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ0_XFERSIZE_MASK           0x7f
#define GC_USB_DOEPTSIZ0_XFERSIZE_SIZE           0x7
#define GC_USB_DOEPTSIZ0_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ0_XFERSIZE_OFFSET         0xb10
#define GC_USB_DOEPTSIZ0_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ0_PKTCNT_MASK             0x80000
#define GC_USB_DOEPTSIZ0_PKTCNT_SIZE             0x1
#define GC_USB_DOEPTSIZ0_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ0_PKTCNT_OFFSET           0xb10
#define GC_USB_DOEPTSIZ0_SUPCNT_LSB              0x1d
#define GC_USB_DOEPTSIZ0_SUPCNT_MASK             0x60000000
#define GC_USB_DOEPTSIZ0_SUPCNT_SIZE             0x2
#define GC_USB_DOEPTSIZ0_SUPCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ0_SUPCNT_OFFSET           0xb10
#define GC_USB_DOEPDMA0_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA0_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA0_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA0_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA0_DMAADDR_OFFSET           0xb14
#define GC_USB_DOEPDMAB0_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB0_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB0_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DOEPDMAB0_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB0_DMABUFFERADDR_OFFSET    0xb1c
#define GC_USB_DOEPCTL1_MPS_LSB                  0x0
#define GC_USB_DOEPCTL1_MPS_MASK                 0x7ff
#define GC_USB_DOEPCTL1_MPS_SIZE                 0xb
#define GC_USB_DOEPCTL1_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL1_MPS_OFFSET               0xb20
#define GC_USB_DOEPCTL1_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL1_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL1_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL1_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL1_USBACTEP_OFFSET          0xb20
#define GC_USB_DOEPCTL1_DPID_LSB                 0x10
#define GC_USB_DOEPCTL1_DPID_MASK                0x10000
#define GC_USB_DOEPCTL1_DPID_SIZE                0x1
#define GC_USB_DOEPCTL1_DPID_DEFAULT             0x0
#define GC_USB_DOEPCTL1_DPID_OFFSET              0xb20
#define GC_USB_DOEPCTL1_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL1_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL1_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL1_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL1_NAKSTS_OFFSET            0xb20
#define GC_USB_DOEPCTL1_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL1_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL1_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL1_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL1_EPTYPE_OFFSET            0xb20
#define GC_USB_DOEPCTL1_SNP_LSB                  0x14
#define GC_USB_DOEPCTL1_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL1_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL1_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL1_SNP_OFFSET               0xb20
#define GC_USB_DOEPCTL1_STALL_LSB                0x15
#define GC_USB_DOEPCTL1_STALL_MASK               0x200000
#define GC_USB_DOEPCTL1_STALL_SIZE               0x1
#define GC_USB_DOEPCTL1_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL1_STALL_OFFSET             0xb20
#define GC_USB_DOEPCTL1_CNAK_LSB                 0x1a
#define GC_USB_DOEPCTL1_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL1_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL1_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL1_CNAK_OFFSET              0xb20
#define GC_USB_DOEPCTL1_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL1_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL1_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL1_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL1_SNAK_OFFSET              0xb20
#define GC_USB_DOEPCTL1_SETD0PID_LSB             0x1c
#define GC_USB_DOEPCTL1_SETD0PID_MASK            0x10000000
#define GC_USB_DOEPCTL1_SETD0PID_SIZE            0x1
#define GC_USB_DOEPCTL1_SETD0PID_DEFAULT         0x0
#define GC_USB_DOEPCTL1_SETD0PID_OFFSET          0xb20
#define GC_USB_DOEPCTL1_SETD1PID_LSB             0x1d
#define GC_USB_DOEPCTL1_SETD1PID_MASK            0x20000000
#define GC_USB_DOEPCTL1_SETD1PID_SIZE            0x1
#define GC_USB_DOEPCTL1_SETD1PID_DEFAULT         0x0
#define GC_USB_DOEPCTL1_SETD1PID_OFFSET          0xb20
#define GC_USB_DOEPCTL1_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL1_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL1_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL1_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL1_EPDIS_OFFSET             0xb20
#define GC_USB_DOEPCTL1_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL1_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL1_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL1_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL1_EPENA_OFFSET             0xb20
#define GC_USB_DOEPINT1_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT1_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT1_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT1_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT1_XFERCOMPL_OFFSET         0xb28
#define GC_USB_DOEPINT1_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT1_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT1_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT1_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT1_EPDISBLD_OFFSET          0xb28
#define GC_USB_DOEPINT1_AHBERR_LSB               0x2
#define GC_USB_DOEPINT1_AHBERR_MASK              0x4
#define GC_USB_DOEPINT1_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT1_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT1_AHBERR_OFFSET            0xb28
#define GC_USB_DOEPINT1_SETUP_LSB                0x3
#define GC_USB_DOEPINT1_SETUP_MASK               0x8
#define GC_USB_DOEPINT1_SETUP_SIZE               0x1
#define GC_USB_DOEPINT1_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT1_SETUP_OFFSET             0xb28
#define GC_USB_DOEPINT1_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT1_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT1_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT1_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT1_OUTTKNEPDIS_OFFSET       0xb28
#define GC_USB_DOEPINT1_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT1_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT1_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT1_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT1_STSPHSERCVD_OFFSET       0xb28
#define GC_USB_DOEPINT1_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT1_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT1_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT1_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT1_BACK2BACKSETUP_OFFSET    0xb28
#define GC_USB_DOEPINT1_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT1_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT1_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT1_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT1_OUTPKTERR_OFFSET         0xb28
#define GC_USB_DOEPINT1_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT1_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT1_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT1_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT1_BNAINTR_OFFSET           0xb28
#define GC_USB_DOEPINT1_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT1_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT1_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT1_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT1_PKTDRPSTS_OFFSET         0xb28
#define GC_USB_DOEPINT1_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT1_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT1_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT1_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT1_BBLEERR_OFFSET           0xb28
#define GC_USB_DOEPINT1_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT1_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT1_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT1_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT1_NAKINTRPT_OFFSET         0xb28
#define GC_USB_DOEPINT1_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT1_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT1_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT1_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT1_NYETINTRPT_OFFSET        0xb28
#define GC_USB_DOEPINT1_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT1_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT1_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT1_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT1_STUPPKTRCVD_OFFSET       0xb28
#define GC_USB_DOEPTSIZ1_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ1_XFERSIZE_MASK           0x7ffff
#define GC_USB_DOEPTSIZ1_XFERSIZE_SIZE           0x13
#define GC_USB_DOEPTSIZ1_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ1_XFERSIZE_OFFSET         0xb30
#define GC_USB_DOEPTSIZ1_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ1_PKTCNT_MASK             0x1ff80000
#define GC_USB_DOEPTSIZ1_PKTCNT_SIZE             0xa
#define GC_USB_DOEPTSIZ1_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ1_PKTCNT_OFFSET           0xb30
#define GC_USB_DOEPTSIZ1_RXDPID_LSB              0x1d
#define GC_USB_DOEPTSIZ1_RXDPID_MASK             0x60000000
#define GC_USB_DOEPTSIZ1_RXDPID_SIZE             0x2
#define GC_USB_DOEPTSIZ1_RXDPID_DEFAULT          0x0
#define GC_USB_DOEPTSIZ1_RXDPID_OFFSET           0xb30
#define GC_USB_DOEPDMA1_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA1_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA1_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA1_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA1_DMAADDR_OFFSET           0xb34
#define GC_USB_DOEPDMAB1_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB1_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB1_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DOEPDMAB1_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB1_DMABUFFERADDR_OFFSET    0xb3c
#define GC_USB_DOEPCTL2_MPS_LSB                  0x0
#define GC_USB_DOEPCTL2_MPS_MASK                 0x7ff
#define GC_USB_DOEPCTL2_MPS_SIZE                 0xb
#define GC_USB_DOEPCTL2_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL2_MPS_OFFSET               0xb40
#define GC_USB_DOEPCTL2_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL2_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL2_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL2_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL2_USBACTEP_OFFSET          0xb40
#define GC_USB_DOEPCTL2_DPID_LSB                 0x10
#define GC_USB_DOEPCTL2_DPID_MASK                0x10000
#define GC_USB_DOEPCTL2_DPID_SIZE                0x1
#define GC_USB_DOEPCTL2_DPID_DEFAULT             0x0
#define GC_USB_DOEPCTL2_DPID_OFFSET              0xb40
#define GC_USB_DOEPCTL2_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL2_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL2_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL2_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL2_NAKSTS_OFFSET            0xb40
#define GC_USB_DOEPCTL2_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL2_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL2_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL2_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL2_EPTYPE_OFFSET            0xb40
#define GC_USB_DOEPCTL2_SNP_LSB                  0x14
#define GC_USB_DOEPCTL2_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL2_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL2_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL2_SNP_OFFSET               0xb40
#define GC_USB_DOEPCTL2_STALL_LSB                0x15
#define GC_USB_DOEPCTL2_STALL_MASK               0x200000
#define GC_USB_DOEPCTL2_STALL_SIZE               0x1
#define GC_USB_DOEPCTL2_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL2_STALL_OFFSET             0xb40
#define GC_USB_DOEPCTL2_CNAK_LSB                 0x1a
