jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
#define GC_USB_DOEPDMAB4_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB4_DMABUFFERADDR_OFFSET    0xb9c
#define GC_USB_DOEPCTL5_MPS_LSB                  0x0
#define GC_USB_DOEPCTL5_MPS_MASK                 0x7ff
#define GC_USB_DOEPCTL5_MPS_SIZE                 0xb
#define GC_USB_DOEPCTL5_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL5_MPS_OFFSET               0xba0
#define GC_USB_DOEPCTL5_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL5_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL5_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL5_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL5_USBACTEP_OFFSET          0xba0
#define GC_USB_DOEPCTL5_DPID_LSB                 0x10
#define GC_USB_DOEPCTL5_DPID_MASK                0x10000
#define GC_USB_DOEPCTL5_DPID_SIZE                0x1
#define GC_USB_DOEPCTL5_DPID_DEFAULT             0x0
#define GC_USB_DOEPCTL5_DPID_OFFSET              0xba0
#define GC_USB_DOEPCTL5_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL5_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL5_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL5_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL5_NAKSTS_OFFSET            0xba0
#define GC_USB_DOEPCTL5_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL5_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL5_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL5_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL5_EPTYPE_OFFSET            0xba0
#define GC_USB_DOEPCTL5_SNP_LSB                  0x14
#define GC_USB_DOEPCTL5_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL5_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL5_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL5_SNP_OFFSET               0xba0
#define GC_USB_DOEPCTL5_STALL_LSB                0x15
#define GC_USB_DOEPCTL5_STALL_MASK               0x200000
#define GC_USB_DOEPCTL5_STALL_SIZE               0x1
#define GC_USB_DOEPCTL5_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL5_STALL_OFFSET             0xba0
#define GC_USB_DOEPCTL5_CNAK_LSB                 0x1a
#define GC_USB_DOEPCTL5_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL5_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL5_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL5_CNAK_OFFSET              0xba0
#define GC_USB_DOEPCTL5_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL5_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL5_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL5_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL5_SNAK_OFFSET              0xba0
#define GC_USB_DOEPCTL5_SETD0PID_LSB             0x1c
#define GC_USB_DOEPCTL5_SETD0PID_MASK            0x10000000
#define GC_USB_DOEPCTL5_SETD0PID_SIZE            0x1
#define GC_USB_DOEPCTL5_SETD0PID_DEFAULT         0x0
#define GC_USB_DOEPCTL5_SETD0PID_OFFSET          0xba0
#define GC_USB_DOEPCTL5_SETD1PID_LSB             0x1d
#define GC_USB_DOEPCTL5_SETD1PID_MASK            0x20000000
#define GC_USB_DOEPCTL5_SETD1PID_SIZE            0x1
#define GC_USB_DOEPCTL5_SETD1PID_DEFAULT         0x0
#define GC_USB_DOEPCTL5_SETD1PID_OFFSET          0xba0
#define GC_USB_DOEPCTL5_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL5_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL5_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL5_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL5_EPDIS_OFFSET             0xba0
#define GC_USB_DOEPCTL5_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL5_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL5_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL5_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL5_EPENA_OFFSET             0xba0
#define GC_USB_DOEPINT5_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT5_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT5_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT5_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT5_XFERCOMPL_OFFSET         0xba8
#define GC_USB_DOEPINT5_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT5_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT5_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT5_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT5_EPDISBLD_OFFSET          0xba8
#define GC_USB_DOEPINT5_AHBERR_LSB               0x2
#define GC_USB_DOEPINT5_AHBERR_MASK              0x4
#define GC_USB_DOEPINT5_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT5_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT5_AHBERR_OFFSET            0xba8
#define GC_USB_DOEPINT5_SETUP_LSB                0x3
#define GC_USB_DOEPINT5_SETUP_MASK               0x8
#define GC_USB_DOEPINT5_SETUP_SIZE               0x1
#define GC_USB_DOEPINT5_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT5_SETUP_OFFSET             0xba8
#define GC_USB_DOEPINT5_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT5_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT5_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT5_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT5_OUTTKNEPDIS_OFFSET       0xba8
#define GC_USB_DOEPINT5_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT5_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT5_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT5_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT5_STSPHSERCVD_OFFSET       0xba8
#define GC_USB_DOEPINT5_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT5_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT5_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT5_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT5_BACK2BACKSETUP_OFFSET    0xba8
#define GC_USB_DOEPINT5_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT5_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT5_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT5_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT5_OUTPKTERR_OFFSET         0xba8
#define GC_USB_DOEPINT5_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT5_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT5_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT5_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT5_BNAINTR_OFFSET           0xba8
#define GC_USB_DOEPINT5_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT5_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT5_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT5_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT5_PKTDRPSTS_OFFSET         0xba8
#define GC_USB_DOEPINT5_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT5_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT5_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT5_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT5_BBLEERR_OFFSET           0xba8
#define GC_USB_DOEPINT5_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT5_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT5_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT5_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT5_NAKINTRPT_OFFSET         0xba8
#define GC_USB_DOEPINT5_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT5_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT5_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT5_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT5_NYETINTRPT_OFFSET        0xba8
#define GC_USB_DOEPINT5_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT5_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT5_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT5_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT5_STUPPKTRCVD_OFFSET       0xba8
#define GC_USB_DOEPTSIZ5_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ5_XFERSIZE_MASK           0x7ffff
#define GC_USB_DOEPTSIZ5_XFERSIZE_SIZE           0x13
#define GC_USB_DOEPTSIZ5_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ5_XFERSIZE_OFFSET         0xbb0
#define GC_USB_DOEPTSIZ5_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ5_PKTCNT_MASK             0x1ff80000
#define GC_USB_DOEPTSIZ5_PKTCNT_SIZE             0xa
#define GC_USB_DOEPTSIZ5_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ5_PKTCNT_OFFSET           0xbb0
#define GC_USB_DOEPTSIZ5_RXDPID_LSB              0x1d
#define GC_USB_DOEPTSIZ5_RXDPID_MASK             0x60000000
#define GC_USB_DOEPTSIZ5_RXDPID_SIZE             0x2
#define GC_USB_DOEPTSIZ5_RXDPID_DEFAULT          0x0
#define GC_USB_DOEPTSIZ5_RXDPID_OFFSET           0xbb0
#define GC_USB_DOEPDMA5_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA5_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA5_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA5_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA5_DMAADDR_OFFSET           0xbb4
#define GC_USB_DOEPDMAB5_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB5_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB5_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DOEPDMAB5_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB5_DMABUFFERADDR_OFFSET    0xbbc
#define GC_USB_DOEPCTL6_MPS_LSB                  0x0
#define GC_USB_DOEPCTL6_MPS_MASK                 0x7ff
#define GC_USB_DOEPCTL6_MPS_SIZE                 0xb
#define GC_USB_DOEPCTL6_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL6_MPS_OFFSET               0xbc0
#define GC_USB_DOEPCTL6_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL6_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL6_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL6_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL6_USBACTEP_OFFSET          0xbc0
#define GC_USB_DOEPCTL6_DPID_LSB                 0x10
#define GC_USB_DOEPCTL6_DPID_MASK                0x10000
#define GC_USB_DOEPCTL6_DPID_SIZE                0x1
#define GC_USB_DOEPCTL6_DPID_DEFAULT             0x0
#define GC_USB_DOEPCTL6_DPID_OFFSET              0xbc0
#define GC_USB_DOEPCTL6_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL6_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL6_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL6_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL6_NAKSTS_OFFSET            0xbc0
#define GC_USB_DOEPCTL6_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL6_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL6_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL6_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL6_EPTYPE_OFFSET            0xbc0
#define GC_USB_DOEPCTL6_SNP_LSB                  0x14
#define GC_USB_DOEPCTL6_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL6_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL6_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL6_SNP_OFFSET               0xbc0
#define GC_USB_DOEPCTL6_STALL_LSB                0x15
#define GC_USB_DOEPCTL6_STALL_MASK               0x200000
#define GC_USB_DOEPCTL6_STALL_SIZE               0x1
#define GC_USB_DOEPCTL6_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL6_STALL_OFFSET             0xbc0
#define GC_USB_DOEPCTL6_CNAK_LSB                 0x1a
#define GC_USB_DOEPCTL6_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL6_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL6_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL6_CNAK_OFFSET              0xbc0
#define GC_USB_DOEPCTL6_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL6_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL6_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL6_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL6_SNAK_OFFSET              0xbc0
#define GC_USB_DOEPCTL6_SETD0PID_LSB             0x1c
#define GC_USB_DOEPCTL6_SETD0PID_MASK            0x10000000
#define GC_USB_DOEPCTL6_SETD0PID_SIZE            0x1
#define GC_USB_DOEPCTL6_SETD0PID_DEFAULT         0x0
#define GC_USB_DOEPCTL6_SETD0PID_OFFSET          0xbc0
#define GC_USB_DOEPCTL6_SETD1PID_LSB             0x1d
#define GC_USB_DOEPCTL6_SETD1PID_MASK            0x20000000
#define GC_USB_DOEPCTL6_SETD1PID_SIZE            0x1
#define GC_USB_DOEPCTL6_SETD1PID_DEFAULT         0x0
#define GC_USB_DOEPCTL6_SETD1PID_OFFSET          0xbc0
#define GC_USB_DOEPCTL6_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL6_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL6_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL6_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL6_EPDIS_OFFSET             0xbc0
#define GC_USB_DOEPCTL6_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL6_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL6_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL6_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL6_EPENA_OFFSET             0xbc0
#define GC_USB_DOEPINT6_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT6_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT6_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT6_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT6_XFERCOMPL_OFFSET         0xbc8
#define GC_USB_DOEPINT6_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT6_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT6_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT6_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT6_EPDISBLD_OFFSET          0xbc8
#define GC_USB_DOEPINT6_AHBERR_LSB               0x2
#define GC_USB_DOEPINT6_AHBERR_MASK              0x4
#define GC_USB_DOEPINT6_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT6_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT6_AHBERR_OFFSET            0xbc8
#define GC_USB_DOEPINT6_SETUP_LSB                0x3
#define GC_USB_DOEPINT6_SETUP_MASK               0x8
#define GC_USB_DOEPINT6_SETUP_SIZE               0x1
#define GC_USB_DOEPINT6_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT6_SETUP_OFFSET             0xbc8
#define GC_USB_DOEPINT6_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT6_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT6_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT6_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT6_OUTTKNEPDIS_OFFSET       0xbc8
#define GC_USB_DOEPINT6_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT6_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT6_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT6_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT6_STSPHSERCVD_OFFSET       0xbc8
#define GC_USB_DOEPINT6_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT6_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT6_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT6_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT6_BACK2BACKSETUP_OFFSET    0xbc8
#define GC_USB_DOEPINT6_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT6_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT6_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT6_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT6_OUTPKTERR_OFFSET         0xbc8
#define GC_USB_DOEPINT6_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT6_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT6_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT6_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT6_BNAINTR_OFFSET           0xbc8
#define GC_USB_DOEPINT6_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT6_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT6_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT6_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT6_PKTDRPSTS_OFFSET         0xbc8
#define GC_USB_DOEPINT6_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT6_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT6_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT6_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT6_BBLEERR_OFFSET           0xbc8
#define GC_USB_DOEPINT6_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT6_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT6_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT6_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT6_NAKINTRPT_OFFSET         0xbc8
#define GC_USB_DOEPINT6_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT6_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT6_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT6_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT6_NYETINTRPT_OFFSET        0xbc8
#define GC_USB_DOEPINT6_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT6_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT6_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT6_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT6_STUPPKTRCVD_OFFSET       0xbc8
#define GC_USB_DOEPTSIZ6_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ6_XFERSIZE_MASK           0x7ffff
#define GC_USB_DOEPTSIZ6_XFERSIZE_SIZE           0x13
#define GC_USB_DOEPTSIZ6_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ6_XFERSIZE_OFFSET         0xbd0
#define GC_USB_DOEPTSIZ6_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ6_PKTCNT_MASK             0x1ff80000
#define GC_USB_DOEPTSIZ6_PKTCNT_SIZE             0xa
#define GC_USB_DOEPTSIZ6_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ6_PKTCNT_OFFSET           0xbd0
#define GC_USB_DOEPTSIZ6_RXDPID_LSB              0x1d
#define GC_USB_DOEPTSIZ6_RXDPID_MASK             0x60000000
#define GC_USB_DOEPTSIZ6_RXDPID_SIZE             0x2
#define GC_USB_DOEPTSIZ6_RXDPID_DEFAULT          0x0
#define GC_USB_DOEPTSIZ6_RXDPID_OFFSET           0xbd0
#define GC_USB_DOEPDMA6_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA6_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA6_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA6_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA6_DMAADDR_OFFSET           0xbd4
#define GC_USB_DOEPDMAB6_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB6_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB6_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DOEPDMAB6_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB6_DMABUFFERADDR_OFFSET    0xbdc
#define GC_USB_DOEPCTL7_MPS_LSB                  0x0
#define GC_USB_DOEPCTL7_MPS_MASK                 0x7ff
#define GC_USB_DOEPCTL7_MPS_SIZE                 0xb
#define GC_USB_DOEPCTL7_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL7_MPS_OFFSET               0xbe0
#define GC_USB_DOEPCTL7_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL7_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL7_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL7_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL7_USBACTEP_OFFSET          0xbe0
#define GC_USB_DOEPCTL7_DPID_LSB                 0x10
#define GC_USB_DOEPCTL7_DPID_MASK                0x10000
#define GC_USB_DOEPCTL7_DPID_SIZE                0x1
#define GC_USB_DOEPCTL7_DPID_DEFAULT             0x0
#define GC_USB_DOEPCTL7_DPID_OFFSET              0xbe0
#define GC_USB_DOEPCTL7_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL7_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL7_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL7_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL7_NAKSTS_OFFSET            0xbe0
#define GC_USB_DOEPCTL7_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL7_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL7_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL7_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL7_EPTYPE_OFFSET            0xbe0
#define GC_USB_DOEPCTL7_SNP_LSB                  0x14
#define GC_USB_DOEPCTL7_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL7_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL7_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL7_SNP_OFFSET               0xbe0
#define GC_USB_DOEPCTL7_STALL_LSB                0x15
#define GC_USB_DOEPCTL7_STALL_MASK               0x200000
#define GC_USB_DOEPCTL7_STALL_SIZE               0x1
#define GC_USB_DOEPCTL7_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL7_STALL_OFFSET             0xbe0
#define GC_USB_DOEPCTL7_CNAK_LSB                 0x1a
#define GC_USB_DOEPCTL7_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL7_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL7_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL7_CNAK_OFFSET              0xbe0
#define GC_USB_DOEPCTL7_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL7_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL7_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL7_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL7_SNAK_OFFSET              0xbe0
#define GC_USB_DOEPCTL7_SETD0PID_LSB             0x1c
#define GC_USB_DOEPCTL7_SETD0PID_MASK            0x10000000
#define GC_USB_DOEPCTL7_SETD0PID_SIZE            0x1
#define GC_USB_DOEPCTL7_SETD0PID_DEFAULT         0x0
#define GC_USB_DOEPCTL7_SETD0PID_OFFSET          0xbe0
#define GC_USB_DOEPCTL7_SETD1PID_LSB             0x1d
#define GC_USB_DOEPCTL7_SETD1PID_MASK            0x20000000
#define GC_USB_DOEPCTL7_SETD1PID_SIZE            0x1
#define GC_USB_DOEPCTL7_SETD1PID_DEFAULT         0x0
#define GC_USB_DOEPCTL7_SETD1PID_OFFSET          0xbe0
#define GC_USB_DOEPCTL7_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL7_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL7_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL7_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL7_EPDIS_OFFSET             0xbe0
#define GC_USB_DOEPCTL7_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL7_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL7_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL7_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL7_EPENA_OFFSET             0xbe0
#define GC_USB_DOEPINT7_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT7_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT7_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT7_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT7_XFERCOMPL_OFFSET         0xbe8
#define GC_USB_DOEPINT7_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT7_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT7_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT7_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT7_EPDISBLD_OFFSET          0xbe8
#define GC_USB_DOEPINT7_AHBERR_LSB               0x2
#define GC_USB_DOEPINT7_AHBERR_MASK              0x4
#define GC_USB_DOEPINT7_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT7_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT7_AHBERR_OFFSET            0xbe8
#define GC_USB_DOEPINT7_SETUP_LSB                0x3
#define GC_USB_DOEPINT7_SETUP_MASK               0x8
#define GC_USB_DOEPINT7_SETUP_SIZE               0x1
#define GC_USB_DOEPINT7_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT7_SETUP_OFFSET             0xbe8
#define GC_USB_DOEPINT7_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT7_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT7_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT7_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT7_OUTTKNEPDIS_OFFSET       0xbe8
#define GC_USB_DOEPINT7_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT7_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT7_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT7_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT7_STSPHSERCVD_OFFSET       0xbe8
#define GC_USB_DOEPINT7_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT7_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT7_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT7_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT7_BACK2BACKSETUP_OFFSET    0xbe8
#define GC_USB_DOEPINT7_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT7_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT7_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT7_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT7_OUTPKTERR_OFFSET         0xbe8
#define GC_USB_DOEPINT7_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT7_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT7_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT7_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT7_BNAINTR_OFFSET           0xbe8
#define GC_USB_DOEPINT7_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT7_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT7_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT7_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT7_PKTDRPSTS_OFFSET         0xbe8
#define GC_USB_DOEPINT7_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT7_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT7_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT7_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT7_BBLEERR_OFFSET           0xbe8
