jackadam1981/ChromeEc/chip/stm32/dwc_reg_defs.h
#define GC_USB_DOEPINT7_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT7_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT7_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT7_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT7_NAKINTRPT_OFFSET         0xbe8
#define GC_USB_DOEPINT7_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT7_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT7_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT7_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT7_NYETINTRPT_OFFSET        0xbe8
#define GC_USB_DOEPINT7_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT7_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT7_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT7_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT7_STUPPKTRCVD_OFFSET       0xbe8
#define GC_USB_DOEPTSIZ7_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ7_XFERSIZE_MASK           0x7ffff
#define GC_USB_DOEPTSIZ7_XFERSIZE_SIZE           0x13
#define GC_USB_DOEPTSIZ7_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ7_XFERSIZE_OFFSET         0xbf0
#define GC_USB_DOEPTSIZ7_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ7_PKTCNT_MASK             0x1ff80000
#define GC_USB_DOEPTSIZ7_PKTCNT_SIZE             0xa
#define GC_USB_DOEPTSIZ7_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ7_PKTCNT_OFFSET           0xbf0
#define GC_USB_DOEPTSIZ7_RXDPID_LSB              0x1d
#define GC_USB_DOEPTSIZ7_RXDPID_MASK             0x60000000
#define GC_USB_DOEPTSIZ7_RXDPID_SIZE             0x2
#define GC_USB_DOEPTSIZ7_RXDPID_DEFAULT          0x0
#define GC_USB_DOEPTSIZ7_RXDPID_OFFSET           0xbf0
#define GC_USB_DOEPDMA7_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA7_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA7_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA7_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA7_DMAADDR_OFFSET           0xbf4
#define GC_USB_DOEPDMAB7_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB7_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB7_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DOEPDMAB7_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB7_DMABUFFERADDR_OFFSET    0xbfc
#define GC_USB_DOEPCTL8_MPS_LSB                  0x0
#define GC_USB_DOEPCTL8_MPS_MASK                 0x7ff
#define GC_USB_DOEPCTL8_MPS_SIZE                 0xb
#define GC_USB_DOEPCTL8_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL8_MPS_OFFSET               0xc00
#define GC_USB_DOEPCTL8_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL8_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL8_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL8_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL8_USBACTEP_OFFSET          0xc00
#define GC_USB_DOEPCTL8_DPID_LSB                 0x10
#define GC_USB_DOEPCTL8_DPID_MASK                0x10000
#define GC_USB_DOEPCTL8_DPID_SIZE                0x1
#define GC_USB_DOEPCTL8_DPID_DEFAULT             0x0
#define GC_USB_DOEPCTL8_DPID_OFFSET              0xc00
#define GC_USB_DOEPCTL8_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL8_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL8_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL8_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL8_NAKSTS_OFFSET            0xc00
#define GC_USB_DOEPCTL8_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL8_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL8_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL8_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL8_EPTYPE_OFFSET            0xc00
#define GC_USB_DOEPCTL8_SNP_LSB                  0x14
#define GC_USB_DOEPCTL8_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL8_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL8_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL8_SNP_OFFSET               0xc00
#define GC_USB_DOEPCTL8_STALL_LSB                0x15
#define GC_USB_DOEPCTL8_STALL_MASK               0x200000
#define GC_USB_DOEPCTL8_STALL_SIZE               0x1
#define GC_USB_DOEPCTL8_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL8_STALL_OFFSET             0xc00
#define GC_USB_DOEPCTL8_CNAK_LSB                 0x1a
#define GC_USB_DOEPCTL8_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL8_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL8_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL8_CNAK_OFFSET              0xc00
#define GC_USB_DOEPCTL8_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL8_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL8_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL8_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL8_SNAK_OFFSET              0xc00
#define GC_USB_DOEPCTL8_SETD0PID_LSB             0x1c
#define GC_USB_DOEPCTL8_SETD0PID_MASK            0x10000000
#define GC_USB_DOEPCTL8_SETD0PID_SIZE            0x1
#define GC_USB_DOEPCTL8_SETD0PID_DEFAULT         0x0
#define GC_USB_DOEPCTL8_SETD0PID_OFFSET          0xc00
#define GC_USB_DOEPCTL8_SETD1PID_LSB             0x1d
#define GC_USB_DOEPCTL8_SETD1PID_MASK            0x20000000
#define GC_USB_DOEPCTL8_SETD1PID_SIZE            0x1
#define GC_USB_DOEPCTL8_SETD1PID_DEFAULT         0x0
#define GC_USB_DOEPCTL8_SETD1PID_OFFSET          0xc00
#define GC_USB_DOEPCTL8_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL8_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL8_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL8_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL8_EPDIS_OFFSET             0xc00
#define GC_USB_DOEPCTL8_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL8_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL8_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL8_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL8_EPENA_OFFSET             0xc00
#define GC_USB_DOEPINT8_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT8_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT8_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT8_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT8_XFERCOMPL_OFFSET         0xc08
#define GC_USB_DOEPINT8_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT8_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT8_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT8_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT8_EPDISBLD_OFFSET          0xc08
#define GC_USB_DOEPINT8_AHBERR_LSB               0x2
#define GC_USB_DOEPINT8_AHBERR_MASK              0x4
#define GC_USB_DOEPINT8_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT8_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT8_AHBERR_OFFSET            0xc08
#define GC_USB_DOEPINT8_SETUP_LSB                0x3
#define GC_USB_DOEPINT8_SETUP_MASK               0x8
#define GC_USB_DOEPINT8_SETUP_SIZE               0x1
#define GC_USB_DOEPINT8_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT8_SETUP_OFFSET             0xc08
#define GC_USB_DOEPINT8_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT8_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT8_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT8_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT8_OUTTKNEPDIS_OFFSET       0xc08
#define GC_USB_DOEPINT8_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT8_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT8_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT8_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT8_STSPHSERCVD_OFFSET       0xc08
#define GC_USB_DOEPINT8_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT8_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT8_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT8_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT8_BACK2BACKSETUP_OFFSET    0xc08
#define GC_USB_DOEPINT8_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT8_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT8_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT8_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT8_OUTPKTERR_OFFSET         0xc08
#define GC_USB_DOEPINT8_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT8_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT8_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT8_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT8_BNAINTR_OFFSET           0xc08
#define GC_USB_DOEPINT8_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT8_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT8_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT8_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT8_PKTDRPSTS_OFFSET         0xc08
#define GC_USB_DOEPINT8_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT8_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT8_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT8_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT8_BBLEERR_OFFSET           0xc08
#define GC_USB_DOEPINT8_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT8_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT8_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT8_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT8_NAKINTRPT_OFFSET         0xc08
#define GC_USB_DOEPINT8_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT8_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT8_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT8_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT8_NYETINTRPT_OFFSET        0xc08
#define GC_USB_DOEPINT8_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT8_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT8_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT8_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT8_STUPPKTRCVD_OFFSET       0xc08
#define GC_USB_DOEPTSIZ8_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ8_XFERSIZE_MASK           0x7ffff
#define GC_USB_DOEPTSIZ8_XFERSIZE_SIZE           0x13
#define GC_USB_DOEPTSIZ8_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ8_XFERSIZE_OFFSET         0xc10
#define GC_USB_DOEPTSIZ8_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ8_PKTCNT_MASK             0x1ff80000
#define GC_USB_DOEPTSIZ8_PKTCNT_SIZE             0xa
#define GC_USB_DOEPTSIZ8_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ8_PKTCNT_OFFSET           0xc10
#define GC_USB_DOEPTSIZ8_RXDPID_LSB              0x1d
#define GC_USB_DOEPTSIZ8_RXDPID_MASK             0x60000000
#define GC_USB_DOEPTSIZ8_RXDPID_SIZE             0x2
#define GC_USB_DOEPTSIZ8_RXDPID_DEFAULT          0x0
#define GC_USB_DOEPTSIZ8_RXDPID_OFFSET           0xc10
#define GC_USB_DOEPDMA8_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA8_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA8_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA8_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA8_DMAADDR_OFFSET           0xc14
#define GC_USB_DOEPDMAB8_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB8_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB8_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DOEPDMAB8_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB8_DMABUFFERADDR_OFFSET    0xc1c
#define GC_USB_DOEPCTL9_MPS_LSB                  0x0
#define GC_USB_DOEPCTL9_MPS_MASK                 0x7ff
#define GC_USB_DOEPCTL9_MPS_SIZE                 0xb
#define GC_USB_DOEPCTL9_MPS_DEFAULT              0x0
#define GC_USB_DOEPCTL9_MPS_OFFSET               0xc20
#define GC_USB_DOEPCTL9_USBACTEP_LSB             0xf
#define GC_USB_DOEPCTL9_USBACTEP_MASK            0x8000
#define GC_USB_DOEPCTL9_USBACTEP_SIZE            0x1
#define GC_USB_DOEPCTL9_USBACTEP_DEFAULT         0x0
#define GC_USB_DOEPCTL9_USBACTEP_OFFSET          0xc20
#define GC_USB_DOEPCTL9_DPID_LSB                 0x10
#define GC_USB_DOEPCTL9_DPID_MASK                0x10000
#define GC_USB_DOEPCTL9_DPID_SIZE                0x1
#define GC_USB_DOEPCTL9_DPID_DEFAULT             0x0
#define GC_USB_DOEPCTL9_DPID_OFFSET              0xc20
#define GC_USB_DOEPCTL9_NAKSTS_LSB               0x11
#define GC_USB_DOEPCTL9_NAKSTS_MASK              0x20000
#define GC_USB_DOEPCTL9_NAKSTS_SIZE              0x1
#define GC_USB_DOEPCTL9_NAKSTS_DEFAULT           0x0
#define GC_USB_DOEPCTL9_NAKSTS_OFFSET            0xc20
#define GC_USB_DOEPCTL9_EPTYPE_LSB               0x12
#define GC_USB_DOEPCTL9_EPTYPE_MASK              0xc0000
#define GC_USB_DOEPCTL9_EPTYPE_SIZE              0x2
#define GC_USB_DOEPCTL9_EPTYPE_DEFAULT           0x0
#define GC_USB_DOEPCTL9_EPTYPE_OFFSET            0xc20
#define GC_USB_DOEPCTL9_SNP_LSB                  0x14
#define GC_USB_DOEPCTL9_SNP_MASK                 0x100000
#define GC_USB_DOEPCTL9_SNP_SIZE                 0x1
#define GC_USB_DOEPCTL9_SNP_DEFAULT              0x0
#define GC_USB_DOEPCTL9_SNP_OFFSET               0xc20
#define GC_USB_DOEPCTL9_STALL_LSB                0x15
#define GC_USB_DOEPCTL9_STALL_MASK               0x200000
#define GC_USB_DOEPCTL9_STALL_SIZE               0x1
#define GC_USB_DOEPCTL9_STALL_DEFAULT            0x0
#define GC_USB_DOEPCTL9_STALL_OFFSET             0xc20
#define GC_USB_DOEPCTL9_CNAK_LSB                 0x1a
#define GC_USB_DOEPCTL9_CNAK_MASK                0x4000000
#define GC_USB_DOEPCTL9_CNAK_SIZE                0x1
#define GC_USB_DOEPCTL9_CNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL9_CNAK_OFFSET              0xc20
#define GC_USB_DOEPCTL9_SNAK_LSB                 0x1b
#define GC_USB_DOEPCTL9_SNAK_MASK                0x8000000
#define GC_USB_DOEPCTL9_SNAK_SIZE                0x1
#define GC_USB_DOEPCTL9_SNAK_DEFAULT             0x0
#define GC_USB_DOEPCTL9_SNAK_OFFSET              0xc20
#define GC_USB_DOEPCTL9_SETD0PID_LSB             0x1c
#define GC_USB_DOEPCTL9_SETD0PID_MASK            0x10000000
#define GC_USB_DOEPCTL9_SETD0PID_SIZE            0x1
#define GC_USB_DOEPCTL9_SETD0PID_DEFAULT         0x0
#define GC_USB_DOEPCTL9_SETD0PID_OFFSET          0xc20
#define GC_USB_DOEPCTL9_SETD1PID_LSB             0x1d
#define GC_USB_DOEPCTL9_SETD1PID_MASK            0x20000000
#define GC_USB_DOEPCTL9_SETD1PID_SIZE            0x1
#define GC_USB_DOEPCTL9_SETD1PID_DEFAULT         0x0
#define GC_USB_DOEPCTL9_SETD1PID_OFFSET          0xc20
#define GC_USB_DOEPCTL9_EPDIS_LSB                0x1e
#define GC_USB_DOEPCTL9_EPDIS_MASK               0x40000000
#define GC_USB_DOEPCTL9_EPDIS_SIZE               0x1
#define GC_USB_DOEPCTL9_EPDIS_DEFAULT            0x0
#define GC_USB_DOEPCTL9_EPDIS_OFFSET             0xc20
#define GC_USB_DOEPCTL9_EPENA_LSB                0x1f
#define GC_USB_DOEPCTL9_EPENA_MASK               0x80000000
#define GC_USB_DOEPCTL9_EPENA_SIZE               0x1
#define GC_USB_DOEPCTL9_EPENA_DEFAULT            0x0
#define GC_USB_DOEPCTL9_EPENA_OFFSET             0xc20
#define GC_USB_DOEPINT9_XFERCOMPL_LSB            0x0
#define GC_USB_DOEPINT9_XFERCOMPL_MASK           0x1
#define GC_USB_DOEPINT9_XFERCOMPL_SIZE           0x1
#define GC_USB_DOEPINT9_XFERCOMPL_DEFAULT        0x0
#define GC_USB_DOEPINT9_XFERCOMPL_OFFSET         0xc28
#define GC_USB_DOEPINT9_EPDISBLD_LSB             0x1
#define GC_USB_DOEPINT9_EPDISBLD_MASK            0x2
#define GC_USB_DOEPINT9_EPDISBLD_SIZE            0x1
#define GC_USB_DOEPINT9_EPDISBLD_DEFAULT         0x0
#define GC_USB_DOEPINT9_EPDISBLD_OFFSET          0xc28
#define GC_USB_DOEPINT9_AHBERR_LSB               0x2
#define GC_USB_DOEPINT9_AHBERR_MASK              0x4
#define GC_USB_DOEPINT9_AHBERR_SIZE              0x1
#define GC_USB_DOEPINT9_AHBERR_DEFAULT           0x0
#define GC_USB_DOEPINT9_AHBERR_OFFSET            0xc28
#define GC_USB_DOEPINT9_SETUP_LSB                0x3
#define GC_USB_DOEPINT9_SETUP_MASK               0x8
#define GC_USB_DOEPINT9_SETUP_SIZE               0x1
#define GC_USB_DOEPINT9_SETUP_DEFAULT            0x0
#define GC_USB_DOEPINT9_SETUP_OFFSET             0xc28
#define GC_USB_DOEPINT9_OUTTKNEPDIS_LSB          0x4
#define GC_USB_DOEPINT9_OUTTKNEPDIS_MASK         0x10
#define GC_USB_DOEPINT9_OUTTKNEPDIS_SIZE         0x1
#define GC_USB_DOEPINT9_OUTTKNEPDIS_DEFAULT      0x0
#define GC_USB_DOEPINT9_OUTTKNEPDIS_OFFSET       0xc28
#define GC_USB_DOEPINT9_STSPHSERCVD_LSB          0x5
#define GC_USB_DOEPINT9_STSPHSERCVD_MASK         0x20
#define GC_USB_DOEPINT9_STSPHSERCVD_SIZE         0x1
#define GC_USB_DOEPINT9_STSPHSERCVD_DEFAULT      0x0
#define GC_USB_DOEPINT9_STSPHSERCVD_OFFSET       0xc28
#define GC_USB_DOEPINT9_BACK2BACKSETUP_LSB       0x6
#define GC_USB_DOEPINT9_BACK2BACKSETUP_MASK      0x40
#define GC_USB_DOEPINT9_BACK2BACKSETUP_SIZE      0x1
#define GC_USB_DOEPINT9_BACK2BACKSETUP_DEFAULT   0x0
#define GC_USB_DOEPINT9_BACK2BACKSETUP_OFFSET    0xc28
#define GC_USB_DOEPINT9_OUTPKTERR_LSB            0x8
#define GC_USB_DOEPINT9_OUTPKTERR_MASK           0x100
#define GC_USB_DOEPINT9_OUTPKTERR_SIZE           0x1
#define GC_USB_DOEPINT9_OUTPKTERR_DEFAULT        0x0
#define GC_USB_DOEPINT9_OUTPKTERR_OFFSET         0xc28
#define GC_USB_DOEPINT9_BNAINTR_LSB              0x9
#define GC_USB_DOEPINT9_BNAINTR_MASK             0x200
#define GC_USB_DOEPINT9_BNAINTR_SIZE             0x1
#define GC_USB_DOEPINT9_BNAINTR_DEFAULT          0x0
#define GC_USB_DOEPINT9_BNAINTR_OFFSET           0xc28
#define GC_USB_DOEPINT9_PKTDRPSTS_LSB            0xb
#define GC_USB_DOEPINT9_PKTDRPSTS_MASK           0x800
#define GC_USB_DOEPINT9_PKTDRPSTS_SIZE           0x1
#define GC_USB_DOEPINT9_PKTDRPSTS_DEFAULT        0x0
#define GC_USB_DOEPINT9_PKTDRPSTS_OFFSET         0xc28
#define GC_USB_DOEPINT9_BBLEERR_LSB              0xc
#define GC_USB_DOEPINT9_BBLEERR_MASK             0x1000
#define GC_USB_DOEPINT9_BBLEERR_SIZE             0x1
#define GC_USB_DOEPINT9_BBLEERR_DEFAULT          0x0
#define GC_USB_DOEPINT9_BBLEERR_OFFSET           0xc28
#define GC_USB_DOEPINT9_NAKINTRPT_LSB            0xd
#define GC_USB_DOEPINT9_NAKINTRPT_MASK           0x2000
#define GC_USB_DOEPINT9_NAKINTRPT_SIZE           0x1
#define GC_USB_DOEPINT9_NAKINTRPT_DEFAULT        0x0
#define GC_USB_DOEPINT9_NAKINTRPT_OFFSET         0xc28
#define GC_USB_DOEPINT9_NYETINTRPT_LSB           0xe
#define GC_USB_DOEPINT9_NYETINTRPT_MASK          0x4000
#define GC_USB_DOEPINT9_NYETINTRPT_SIZE          0x1
#define GC_USB_DOEPINT9_NYETINTRPT_DEFAULT       0x0
#define GC_USB_DOEPINT9_NYETINTRPT_OFFSET        0xc28
#define GC_USB_DOEPINT9_STUPPKTRCVD_LSB          0xf
#define GC_USB_DOEPINT9_STUPPKTRCVD_MASK         0x8000
#define GC_USB_DOEPINT9_STUPPKTRCVD_SIZE         0x1
#define GC_USB_DOEPINT9_STUPPKTRCVD_DEFAULT      0x0
#define GC_USB_DOEPINT9_STUPPKTRCVD_OFFSET       0xc28
#define GC_USB_DOEPTSIZ9_XFERSIZE_LSB            0x0
#define GC_USB_DOEPTSIZ9_XFERSIZE_MASK           0x7ffff
#define GC_USB_DOEPTSIZ9_XFERSIZE_SIZE           0x13
#define GC_USB_DOEPTSIZ9_XFERSIZE_DEFAULT        0x0
#define GC_USB_DOEPTSIZ9_XFERSIZE_OFFSET         0xc30
#define GC_USB_DOEPTSIZ9_PKTCNT_LSB              0x13
#define GC_USB_DOEPTSIZ9_PKTCNT_MASK             0x1ff80000
#define GC_USB_DOEPTSIZ9_PKTCNT_SIZE             0xa
#define GC_USB_DOEPTSIZ9_PKTCNT_DEFAULT          0x0
#define GC_USB_DOEPTSIZ9_PKTCNT_OFFSET           0xc30
#define GC_USB_DOEPTSIZ9_RXDPID_LSB              0x1d
#define GC_USB_DOEPTSIZ9_RXDPID_MASK             0x60000000
#define GC_USB_DOEPTSIZ9_RXDPID_SIZE             0x2
#define GC_USB_DOEPTSIZ9_RXDPID_DEFAULT          0x0
#define GC_USB_DOEPTSIZ9_RXDPID_OFFSET           0xc30
#define GC_USB_DOEPDMA9_DMAADDR_LSB              0x0
#define GC_USB_DOEPDMA9_DMAADDR_MASK             0xffffffff
#define GC_USB_DOEPDMA9_DMAADDR_SIZE             0x20
#define GC_USB_DOEPDMA9_DMAADDR_DEFAULT          0x0
#define GC_USB_DOEPDMA9_DMAADDR_OFFSET           0xc34
#define GC_USB_DOEPDMAB9_DMABUFFERADDR_LSB       0x0
#define GC_USB_DOEPDMAB9_DMABUFFERADDR_MASK      0xffffffff
#define GC_USB_DOEPDMAB9_DMABUFFERADDR_SIZE      0x20
#define GC_USB_DOEPDMAB9_DMABUFFERADDR_DEFAULT   0x0
#define GC_USB_DOEPDMAB9_DMABUFFERADDR_OFFSET    0xc3c
#define GC_USB_DOEPCTL10_MPS_LSB                 0x0
#define GC_USB_DOEPCTL10_MPS_MASK                0x7ff
#define GC_USB_DOEPCTL10_MPS_SIZE                0xb
#define GC_USB_DOEPCTL10_MPS_DEFAULT             0x0
#define GC_USB_DOEPCTL10_MPS_OFFSET              0xc40
#define GC_USB_DOEPCTL10_USBACTEP_LSB            0xf
#define GC_USB_DOEPCTL10_USBACTEP_MASK           0x8000
#define GC_USB_DOEPCTL10_USBACTEP_SIZE           0x1
#define GC_USB_DOEPCTL10_USBACTEP_DEFAULT        0x0
#define GC_USB_DOEPCTL10_USBACTEP_OFFSET         0xc40
#define GC_USB_DOEPCTL10_DPID_LSB                0x10
#define GC_USB_DOEPCTL10_DPID_MASK               0x10000
#define GC_USB_DOEPCTL10_DPID_SIZE               0x1
#define GC_USB_DOEPCTL10_DPID_DEFAULT            0x0
#define GC_USB_DOEPCTL10_DPID_OFFSET             0xc40
#define GC_USB_DOEPCTL10_NAKSTS_LSB              0x11
#define GC_USB_DOEPCTL10_NAKSTS_MASK             0x20000
#define GC_USB_DOEPCTL10_NAKSTS_SIZE             0x1
#define GC_USB_DOEPCTL10_NAKSTS_DEFAULT          0x0
#define GC_USB_DOEPCTL10_NAKSTS_OFFSET           0xc40
#define GC_USB_DOEPCTL10_EPTYPE_LSB              0x12
#define GC_USB_DOEPCTL10_EPTYPE_MASK             0xc0000
#define GC_USB_DOEPCTL10_EPTYPE_SIZE             0x2
#define GC_USB_DOEPCTL10_EPTYPE_DEFAULT          0x0
#define GC_USB_DOEPCTL10_EPTYPE_OFFSET           0xc40
#define GC_USB_DOEPCTL10_SNP_LSB                 0x14
#define GC_USB_DOEPCTL10_SNP_MASK                0x100000
#define GC_USB_DOEPCTL10_SNP_SIZE                0x1
#define GC_USB_DOEPCTL10_SNP_DEFAULT             0x0
#define GC_USB_DOEPCTL10_SNP_OFFSET              0xc40
#define GC_USB_DOEPCTL10_STALL_LSB               0x15
#define GC_USB_DOEPCTL10_STALL_MASK              0x200000
#define GC_USB_DOEPCTL10_STALL_SIZE              0x1
#define GC_USB_DOEPCTL10_STALL_DEFAULT           0x0
#define GC_USB_DOEPCTL10_STALL_OFFSET            0xc40
#define GC_USB_DOEPCTL10_CNAK_LSB                0x1a
#define GC_USB_DOEPCTL10_CNAK_MASK               0x4000000
#define GC_USB_DOEPCTL10_CNAK_SIZE               0x1
#define GC_USB_DOEPCTL10_CNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL10_CNAK_OFFSET             0xc40
#define GC_USB_DOEPCTL10_SNAK_LSB                0x1b
#define GC_USB_DOEPCTL10_SNAK_MASK               0x8000000
#define GC_USB_DOEPCTL10_SNAK_SIZE               0x1
#define GC_USB_DOEPCTL10_SNAK_DEFAULT            0x0
#define GC_USB_DOEPCTL10_SNAK_OFFSET             0xc40
#define GC_USB_DOEPCTL10_SETD0PID_LSB            0x1c
#define GC_USB_DOEPCTL10_SETD0PID_MASK           0x10000000
#define GC_USB_DOEPCTL10_SETD0PID_SIZE           0x1
#define GC_USB_DOEPCTL10_SETD0PID_DEFAULT        0x0
#define GC_USB_DOEPCTL10_SETD0PID_OFFSET         0xc40
#define GC_USB_DOEPCTL10_SETD1PID_LSB            0x1d
#define GC_USB_DOEPCTL10_SETD1PID_MASK           0x20000000
#define GC_USB_DOEPCTL10_SETD1PID_SIZE           0x1
#define GC_USB_DOEPCTL10_SETD1PID_DEFAULT        0x0
#define GC_USB_DOEPCTL10_SETD1PID_OFFSET         0xc40
#define GC_USB_DOEPCTL10_EPDIS_LSB               0x1e
#define GC_USB_DOEPCTL10_EPDIS_MASK              0x40000000
#define GC_USB_DOEPCTL10_EPDIS_SIZE              0x1
#define GC_USB_DOEPCTL10_EPDIS_DEFAULT           0x0
#define GC_USB_DOEPCTL10_EPDIS_OFFSET            0xc40
#define GC_USB_DOEPCTL10_EPENA_LSB               0x1f
#define GC_USB_DOEPCTL10_EPENA_MASK              0x80000000
#define GC_USB_DOEPCTL10_EPENA_SIZE              0x1
#define GC_USB_DOEPCTL10_EPENA_DEFAULT           0x0
#define GC_USB_DOEPCTL10_EPENA_OFFSET            0xc40
#define GC_USB_DOEPINT10_XFERCOMPL_LSB           0x0
#define GC_USB_DOEPINT10_XFERCOMPL_MASK          0x1
#define GC_USB_DOEPINT10_XFERCOMPL_SIZE          0x1
#define GC_USB_DOEPINT10_XFERCOMPL_DEFAULT       0x0
#define GC_USB_DOEPINT10_XFERCOMPL_OFFSET        0xc48
#define GC_USB_DOEPINT10_EPDISBLD_LSB            0x1
#define GC_USB_DOEPINT10_EPDISBLD_MASK           0x2
#define GC_USB_DOEPINT10_EPDISBLD_SIZE           0x1
#define GC_USB_DOEPINT10_EPDISBLD_DEFAULT        0x0
#define GC_USB_DOEPINT10_EPDISBLD_OFFSET         0xc48
#define GC_USB_DOEPINT10_AHBERR_LSB              0x2
#define GC_USB_DOEPINT10_AHBERR_MASK             0x4
#define GC_USB_DOEPINT10_AHBERR_SIZE             0x1
#define GC_USB_DOEPINT10_AHBERR_DEFAULT          0x0
#define GC_USB_DOEPINT10_AHBERR_OFFSET           0xc48
#define GC_USB_DOEPINT10_SETUP_LSB               0x3
#define GC_USB_DOEPINT10_SETUP_MASK              0x8
